{
    "artists": [
        {
            "bio": "Weezer is an American rock band. Formed in 1992, they have released eight full length albums, six EPs, and a DVD. Their latest album, titled 'Weezer (White Album)', came out on April 1st, 2016. They've sold over nine million records in the United States to date. Playing music influenced by alternative bands and power pop artists among others, they're sometimes viewed as a part of the 90s indie movement.\n\nWeezer started in Los Angeles, California when Rivers Cuomo joined with Patrick Wilson, Matt Sharp, and Jason Cropper, who was later replaced by Brian Bell. Five weeks after forming, they had their first gig, opening for Dogstar at Raji's Bar and Ribshack on Hollywood Boulevard. Weezer began playing clubs to small audiences around L.A. and recording homemade demos. The group soon received attention from various A&R reps, and the guys were signed on June 26, 1993 by Todd Sullivan, an A&R rep from Geffen Records. The band became a part of the DGC label (which later turned into Interscope).\n\nCreating \"The Blue Album\" (1993-1994)\n\nThe self-titled debut, 'Weezer', commonly referred to as 'The Blue Album', came out on May 10, 1994. It picked up considerable acclaim. Tracks \"Undone (The Sweater Song)\" (also known as \"Undone - The Sweater Song\"), \"Buddy Holly\", and \"Say It Ain't So” were released as singles. The album was produced by former The Cars frontman Ric Ocasek. During the recording of the Blue Album, Jason Cropper left the band to take care of his future wife, who was pregnant with their first child. Jason was replaced by Brian Bell, a then bassist from a band called Carnival Art.\n\nThe first single, \"Undone - The Sweater Song\", garnered attention given that Spike Jonze directed the music video for the track. In a single, unbroken take, that video featured Weezer performing the song on a sound stage with various amusing studio antics, including a pack of dogs swarming the set. Jonze also later directed the band's second video, which was made for the single \"Buddy Holly\".\n\nNamed after the famous 50s rock star, the \"Buddy Holly\" music video featured footage of the television sitcom Happy Days spliced with the band performing in a remade \"Arnold's Diner\", a setting from the series. The video had heavy rotation on MTV. It went on to win Jonze and the band four MTV Video Music Awards (including Breakthrough Video and Best Alternative Music Video) and two Billboard Music Video Awards. This video was also included as a bonus on the Microsoft Windows 95 CD. The success of the video arguably served as the key for pushing the band into the mainstream rock spotlight.\n\nThe video for Weezer's third single, \"Say It Ain't So\", was directed by Sophie Muller. It featured the bandmates playing hacky-sack and performing in the band's original rehearsal space in California. A photo of what the band calls the \"Garage\" is featured on the inside cover of the album.\n\n'The Blue Album' is currently certified three times platinum, making it Weezer's all-time best seller and one of the most popular rock albums of the early 90s. It was re-released and repackaged in 2004 as a \"Deluxe Edition\". That version of the album included a second disc of B-sides along with other previously unreleased rarities.\n\nKiller Record: Pinkerton(1995-1997)\n\nIn late December 1994, Weezer took a break from touring for the Christmas holidays. Cuomo traveled back east to his home state of Connecticut. Using an eight-track recorder, he began piecing together demo material for Weezer's next album. Cuomo's original concept for Weezer's sophomore effort was to be a space-themed rock opera, with him mulling over the title 'Songs from the Black Hole'.\n\nThe album was intended to feature songs that flowed together seamlessly, and it was planned to end with a special coda that briefly revisited the major musical elements of the piece (something reminiscent of progressive rock works from the 70s). The band began demoing and working on Cuomo's concept through intermittent recording sessions in the spring and summer of 1995. Ultimately, the 'Songs from the Black Hole' album concept was dropped. The album that actually came out would instead feature some old tunes made from before their first album (which had briefly been incorporated into the space-opera) as well as some new ones written while Cuomo was at Harvard.\n\nAfter the multi-platinum success of their debut album, Weezer's sophomore album was finally released on September 24, 1996. Titled 'Pinkerton', the work peaked at #19 in the U.S. upon its release. It didn't sell as many copies as its predecessor, probably due to its darker, more abrasive nature. Pinkerton was labeled \"one of the worst albums of 1996\" by a Rolling Stone reader poll. Eventually, the album grew into a cult classic, and is viewed by some fans as Weezer's greatest album. In fact, in 2004, the magazine changed their rating to a 5-star rating and inducted it into The Rolling Stone Hall Of Fame. This article can be found in the Reviews sections of the 500 Greatest Songs Of All Time issue.\n\nThree singles were taken from the album: \"El Scorcho\", \"The Good Life\" and \"Pink Triangle\". The video for \"El Scorcho\" featured the band inside a darkened room, sitting in a circle, that would be lit differently throughout parts of the song; it was directed by Mark Romanek. The video for \"The Good Life\" was directed by the team of Jonathan Dayton and Valerie Faris (though no known video was made for \"Pink Triangle\"). However, the singles did not receive as much airtime as the singles from their debut album.\n\nThe title of the album comes from the character Lieutenant Pinkerton in Giacomo Puccini's opera Madame Butterfly. The entire album is heavily influenced by the opera's story line. Madame Butterfly is mentioned under her real name, Cio-Cio San, in \"El Scorcho.\" The song \"Butterfly\" is written from Pinkerton's point of view at the end of the opera.\n\nThe album's title was the source of a legal challenge. Pinkerton Securities of Encino, Calif., filed a temporary restraining order against the band and its Geffen record label for copyright infringement two days before the album was to be released on September 24, 1996. A judge ruled against the security company and the album was finally released.\n\nWeezer completed their touring for Pinkerton in the summer of 1997. The members of the band took a break, with drummer Patrick Wilson returning to his home in Portland, Oregon to work on his side project, The Special Goodness, Matt Sharp left to complete the follow-up album for his group The Rentals, and Brian Bell went to work on his group, Space Twins.\n\nRivers Cuomo returned to Boston, Massachusetts, but dropped out of Harvard to focus on songwriting. He eventually went into seclusion. He painted his walls black, disconnected his phone, and didn't communicate with anyone. Later, he formed a solo group, The Rivers Cuomo Band. Cuomo used the group to try out unreleased material, including possible new songs for the next Weezer album. The band played their first show at T.T. the Bear's on October 8, 1997. Future Weezer bassist Mikey Welsh was part of the solo band's lineup. The Boston songs were later abandoned and not used on the next Weezer album, but live recordings of the Boston shows are openly traded on the internet. In February of 1998, Rivers left Boston and Harvard academia behind and returned to Los Angeles.\n\nPat Wilson and Brian Bell joined Cuomo in L.A. to start work on the next album. Matt Sharp did not rejoin the band and officially left the group in April of 1998. The group decided on Mikey Welsh as Sharp's replacement. Weezer continued rehearsal and cut demos until the fall of 1998. Frustration and creative disagreements led to a decline in rehearsals, and in late fall of 1998, drummer Pat Wilson left for his home in Portland pending renewed productivity from Cuomo.\n\nThe band would not reunite until April of 2000, when the Fuji Festival in Japan offered Weezer a high-paying gig to play in August 2000. The festival served as a catalyst for Weezer's productivity, and from April to May, 2000, the band rehearsed and demoed new songs in Los Angeles. The band returned to live shows in June 2000, but without the Weezer name. Instead the shows featured the group's first use of the pseudonym Goat Punishment.\n\nOn June 23, 2000, the band, now back under the Weezer name, joined the Warped Tour for eight planned dates. Weezer was received well at the festival, leading the band to book more tour dates for the summer.\n\nSS2K - The Summer Sessions (2000)\n\nIn the summer of 2000, Weezer (now consisting of Rivers Cuomo, Mikey Welsh, Pat Wilson, and Brian Bell) went on tour. Weezer's setlist consisted of 14 new songs that fans have labeled the Summer Songs of 2000 (commonly abbreviated, SS2K). When 13 of these songs did not appear on Weezer's next album, fans of the songs started a petition demanding the release of studio demos. Eventually, mp3s were made available on the band's official website for download. Three SS2K songs, \"Hash Pipe\", \"Dope Nose\" and \"Slob,\" have appeared on studio albums (\"Hash Pipe\" on the Green Album and \"Dope Nose\" and \"Slob\" appearing on Maladroit).\n\nGreen Album & Maladroit (2001-2003)\n\nEventually, the band went back into the studio to produce a third album. Weezer (2001) chose to repeat the self-titled name of their first release. This album quickly became known as The Green Album due to its distinctive bright green coloring. Shortly after the release of The Green Album, Weezer went on another American tour. They attracted a new generation of fans thanks to heavy MTV rotation for the videos of their hit singles \"Hash Pipe\" and \"Island in the Sun.\"\n\nThe video for \"Hash Pipe,\" directed by Marcos Siega featured sumo wrestlers and was nominated for Best Rock Video at the 2001 MTV Video Music Awards, but lost out to Limp Bizkit's \"Rollin.\" Two videos were recorded for \"Island in the Sun.\" Marcos Siega directed the first, which focused on a Mexican wedding, and Spike Jonze directed the second, which involved Weezer with animals in a wildlife reserve. Their video for \"Photograph\" was shot and put together by Weezer friend and unofficial \"5th member\" Karl Koch.\n\nAs reported on August 16th, 2001, by MTV, bassist Mikey Welsh was checked into a psychiatric hospital. His whereabouts were previously unknown, as he mysteriously went missing before their second filming of the \"Island in the Sun\" music video, featuring the band with various animals. Weezer was prompted to find a temporary replacement for Welsh. Through a mutual friend, Cuomo received Scott Shriner's number and asked if he was interested to fill in for Welsh. Shriner, at first believing it was a prank phone call, accepted.\n\nMuch to the ire of their recording label, Weezer decided to forgo the industry-preferred waiting period of 2 to 3 years between albums and began recording demos for their fourth album. The band took an experimental approach for the recording process by allowing fans to download the demos from their official website in return for feedback. After the release of the album, the band subsequently stated that the process was somewhat of a failure, as the fans did not supply them with cohesive constructive advice. Only the song \"Slob\" was included on the album due to general fan advice.\n\nThe fourth album, Maladroit, was released in 2002 with Scott Shriner replacing Mikey Welsh on the bass. The album served as a harder-edged version of their trademark catchy pop-influenced music. Although met with generally positive critical reviews (including making many \"Best of '02\" lists), its sales were not as strong as The Green Album and remains their worst-selling album to date.\n\nTwo singles were released from the album. The \"Dope Nose\" music video featured a Japanese motorcycle gang, and was put into regular rotation. The music video for \"Keep Fishin'\" combined Weezer with The Muppets, and had heavy rotation on MTV. Both videos were directed by Marcos Siega.\n\nAs soon as Maladroit had wrapped up, the band immediately began work on their fifth album, recording numerous demos between tours for Maladroit (often recording as many as 24 songs in a day). These songs were eventually scrapped, and Weezer took a break after the release of two albums in quick succession.\n\nMake Believe (2003-2005)\n\nIn March of 2004, Weezer released their first DVD. Titled Video Capture Device, the DVD contains all of their then-current music videos. It also included live concerts and homemade movies. The DVD was certified \"gold\" on November 8, 2004.\n\nFrom December 2003 to the summer and early fall of 2004, the members of Weezer recorded a large amount of material intended for a new album to be released in the spring of 2005 with producer Rick Rubin. The band's early recording efforts became available to the public through the band's website. The demos, entitled the Album Five Demos (or album 4.5), were a big hit with fans but only one song, \"Hold Me\", would be included on the finished album. That album, entitled Make Believe, was released on May 10, 2005. The album was very well received by the public. However, long-time Weezer fans often consider it as a decline from their earlier albums, and has received mixed reviews.\n\nThe album's first single, \"Beverly Hills,\" became a hit in the U.S. and worldwide, staying on the charts for several months after its release. The video for \"Beverly Hills\", directed by Marcos Siega, featured the band and a select choice of fans interacting with Playboy Bunnies and Hugh Hefner at the Playboy Mansion. It became the first Weezer song to hit #1 on the Billboard Modern Rock chart. The song was nominated for Best Rock Song at the 48th Annual Grammy Awards, the first ever Grammy nomination for the band. The video for the song was also nominated for Best Rock Video at the 2005 MTV Video Music Awards.\n\nDuring the \"Make Believe\" tour of 2005, Cuomo allowed other members of the band to step into the spotlight of certain songs:\n\n    * Brian Bell: \"Getchoo\" and \"Why Bother?\" (from Pinkerton), \"Smile\" (from \"The Green Album\"), and \"Keep Fishin'\" (from Maladroit)\n    * Scott Shriner: \"Fall Together\", and \"Dope Nose\", and \"In the Garage\" (from \"The Blue Album\")\n    * Patrick Wilson: \"Photograph\" (from \"The Green Album\"), \"Song 2\" (Blur cover, whilst playing lead guitar)\n\nIn late August 2005, Weezer performed with the rock band The Pixies, which was one of Rivers' influences, at Summerfest and other dates.\n\nFrom September 8 to October 28, 2005, Weezer set out on a tour with the Foo Fighters, which, to many, was simply called Foozer. The Foozer tour was awarded \"Most Creative Tour Package\" at The 17th Annual Concert Industry Awards.\n\nOn December 13th, 2005, Winter Weezerland EP was released on iTunes. The EP was essentially a re-release of the 2000 Weezer christmas CD which featured \"The Christmas Song\" and \"Christmas Celebration\".\n\nAlso, in late 2005 the band released the second single off Make Believe, called \"We Are All on Drugs\" (for family-oriented purposes, some releases of the song were renamed \"We Are All in Love\"), and the music video was directed by Justin Francis. It didn't do well as a single, and many weezer fans hated it.\n\nIn early 2006, it was announced that Make Believe was certified platinum, and \"Beverly Hills\" was the second most popular download on iTunes for 2005.\n\nAlso in early 2006, Make Believe's third single, \"Perfect Situation\", spent four weeks in a row at the #1 spot on the Billboard Modern Rock chart, a personal record for Weezer. The Perfect Situation video starred Elisha Cuthbert and was directed by Marc Webb. The only other Weezer track to hit #1 was \"Beverly Hills,\" for one week. \"This is Such a Pity\" is the band's fourth single from the album, but no music video was made for its release.\n\nAs of January, 2006, Bell and Wilson are set to portray Velvet Underground members Lou Reed and John Cale in Factory Girl, an upcoming film about the life of Andy Warhol cohort Edie Sedgwick.\n\nRivers Cuomo announced a new song called \"Piece of the Pie\" while onstage during the band's October 7th, 2005 show in Detroit (but did not perform it). Cuomo has mentioned other song ideas recently, dropping titles and ideas such as \"East Coast or West Coast,\" \"Pig\" and new songs with lyrics he described as \"bloggy\".\n\nRivers has commented on his myspace blog that his recent comments to mtv.com were 'misquoted' and said that what he meant \"was that the soccer song, \"Our Time will Come\", certainly won't be on a Weezer album.\" and said \"The rest of the songs, though, are definite contenders for a Weezer record.\" A strong hint that the band are in fact only on a break and that a sixth album is on the card.\n\nIn late 2006, Brian Bell began work on a new project called The Relationship which fans can follow on the band's myspace page. Pat Wilson told Keifer Wells and Martin Michalek in a radio interview for Andover High School that he and Scott Shriner had been creating songs together and are trying to get Rivers to sing for when the band has jam sessions. Pat has also been creating a few Special Goodness songs, but said little more on the subject. Fans can currently follow the news of the band at Rivers Cuomo's myspace page and the official Weezer website.\n\nWeezer's sixth studio album will be released on June 3, 2008, just over three years after their latest release, Make Believe. Rick Rubin produced the album[30] and Rich Costey provided the mixing[31] for what Weezer fans are calling \"Album Six\".[32] The record is being described as \"experimental\", and according to Cuomo, includes longer and non-traditional songs, TR-808 drum machines, synthesizers, Southern rap, baroque counterpoint, and band members other than Cuomo writing, singing, and switching instruments.[33]\n\nLead singer Rivers Cuomo released a demo-compilation album entitled Alone: The Home Recordings of Rivers Cuomo on December 18, 2007. The album contains demos of Cuomo's that span from 1992 to 2007, including songs from Weezer's abandoned second album, Songs from the Black Hole. Also included in Alone is a song intended for Weezer's upcoming 6th studio album, entitled \"This is the Way\". The booklet of Alone tells of the band wanting the song for the album, but ultimately choosing \"an epic, 6-minute, symphonic type of art song\" entitled \"Daydreamer\" instead.\n\nWeezer's \"Weezer\" (also referred to as \"The Red Album\") was released in June 2008. Rick Rubin produced the album and Rich Costey mixed it. The record is being described as \"experimental\", and according to Cuomo, includes longer and non-traditional songs, TR-808 drum machines, synthesizers, Southern rap, baroque counterpoint, and band members other than Cuomo writing, singing, and switching instruments. Pat Wilson said that the album cost about a million dollars to make, contrasting it with the $150,000 budget of \"The Blue Album\". The album's singles were produced by Jacknife Lee. Its lead single, \"Pork and Beans\", topped the Billboard Modern Rock Tracks charts for 11 weeks, and its music video won a Grammy for Best Short Form Music Video. The album's second single, \"Troublemaker\", debuted at #39 on the Billboard Hot Modern Rock Tracks chart and peaked at #2. In October 2008, the group announced that the third single would be \"The Greatest Man That Ever Lived (Variations on a Shaker Hymn)\".\n\nIn 2009, the band announced their next album, \"Raditude\", would be released on November 3, 2009, where it debuted as the seventh best-selling album of the week on the Billboard 200 chart. The band scheduled tour dates in December 2009 extending into early 2010 to coincide with the new album's release. On December 6, 2009, Weezer frontman Rivers Cuomo was injured when his tour bus crashed in upstate New York due to black ice. Cuomo suffered three broken ribs, and his assistant broke two ribs. His wife, baby daughter, and their nanny were also on the bus; however, they escaped injury. Weezer cancelled tour dates the following day. The band resumed touring on January 20, 2010.\n\nIn December 2009, it was revealed that the band was no longer with Geffen Records. The band stated that they would still release new material, but they are unsure of the means, whether it be self-released, released online, or getting signed by another label. Eventually, the band was signed to the independent label Epitaph.\n\nThe album \"Hurley\" was released in September 2010 through Epitaph Records. The name comes from the character Hugo \"Hurley\" Reyes from the television show \"Lost\". Jorge Garcia, the actor who portrayed Hurley, stated that being featured on the album cover is \"one of the biggest honors of [his] career.\" Weezer used internet streaming service YouTube as a way to promote the album. Weezer loaned itself to 15 amateur online video producers, \"going along with whatever plans the creator could execute in about 30 minutes.\" They have used many of the popular channels to promote themselves, such as Barely Political, Ray William Johnson and Fred Figglehorn. The Gregory Brothers solicited musical and vocal contributions from the band on one of its compositions built around speeches by Rep. Charles Rangel and President Barack Obama. Weezer calls the promotion \"The YouTube Invasion\"\n\nOn November 2, 2010, Weezer released another studio album called \"Death to False Metal\". This album was composed of newly re-recorded versions of unused recordings spanning the band's career.\n\nOn October 9, 2011, the band announced on their website that former bassist Mikey Welsh had died.\n\nEverything Will Be Alright in the End and the White Album (2014–2016)\nIn January 2014, the band started to record its ninth studio album with producer Ric Ocasek, who previously worked with the band on its first two self-titled albums. A clip of a new song was posted on the band's official YouTube account on March 19, 2014, which confirmed previous rumors of the band being in the studio. On June 12, 2014, it was revealed that the album title would be Everything Will Be Alright in the End. It was released on October 7, 2014 to generally favorable reviews, becoming the band's best-reviewed release since Pinkerton.\n\nOn October 26, 2015, the band released a new single, \"Thank God for Girls\", through Apple Music and to radio the same day. The following week, the band released a second single, \"Do You Wanna Get High?\". Cuomo claimed in an interview with Zane Lowe, that the band was not working on a new album. Later, on January 14, 2016, Weezer released a third single, \"King of the World\", and announced that the band's fourth self-titled album, also known as the White Album, which continued the critical success of the band's previous release. In support of the album, the band performed on the Weezer & Panic! at the Disco Summer Tour 2016 with Panic! at the Disco in 2016. The band later signed to Atlantic Records as part of a joint venture between Warner Music Group and Crush Management.\n\nPacific Daydream (2017–present)\nSoon after the release of the White Album, Cuomo discussed plans for Weezer's next album, provisionally titled the Black Album: \"It’s going to maybe be like Beach Boys gone bad [...] I’m thinking of swearing, which is something I’ve never done in songs.” Cuomo also said the album would tackle “more mature topics” and be “less summer day and more winter night”. He suggested the band could return to the recording studio as soon as October 2016. Weezer delayed recording after Cuomo felt his new material was more \"like reveries from a beach at the end of the world [... as if] the Beach Boys and the Clash fell in love by the ocean and had one hell of an amazing baby\".\n\nOn March 16, 2017, the band released a new song titled \"Feels Like Summer\", later revealed to be the lead single of an upcoming album. The song drew a mixed reaction from fans but became their biggest hit on Alternative radio in a decade. \"Feels Like Summer\" was heard on The Weather Channel's local forecast segments on July 4, 2017, and again on August 18, 2017. It was also heard on some of the network's promos that summer. \n\nOn August 16, the band revealed the album title, Pacific Daydream, and scheduled for October 27. The next day, the a promotional single from the album, \"Mexican Fender\", was released. The following months, \"Beach Boys\" was released, and the month after, they released \"Weekend Woman\" to positive reception.\n\nThe band currently consists of the following members:\n\n    * Brian Bell — guitar, backing vocals\n    * Rivers Cuomo — vocals, guitar\n    * Scott Shriner — bass guitar, backing vocals (2002-present) (plays on Maladroit and Make Believe)\n    * Patrick Wilson — drums\n\nFormer members:\n\n    * Jason Cropper — Guitar, left the band in September 1993 (believed to have been fired by Cuomo, although it is not clear as Cropper is forbidden from discussing the issue)\n    * Matt Sharp — bass guitar, backing vocals (1992-1997) (plays on The Blue Album and Pinkerton)\n    * Mikey Welsh — bass guitar, backing vocals (1998-2001) (plays on The Green Album) Read more on Last.fm. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.", 
            "genres": [
                "alternative metal", 
                "alternative rock", 
                "garage rock", 
                "indie christmas", 
                "indie pop", 
                "indie rock", 
                "modern rock", 
                "permanent wave", 
                "pop christmas", 
                "pop punk", 
                "pop rock", 
                "post-grunge", 
                "punk christmas", 
                "rock"
            ], 
            "id": "3jOstUTkEu2JkjvRdBA5Gu", 
            "image_filepath": "artists/images/3jOstUTkEu2JkjvRdBA5Gu.jpg", 
            "image_url": "https://i.scdn.co/image/2d9c08427ea2ffd4ae8a16ad5f0c39fd4d91c0be", 
            "name": "Weezer"
        }, 
        {
            "bio": "Courtney Barnett is an Australian singer/songwriter originally from Sydney, New South Wales; later moving to Hobart where she began performing music in 2006 before relocating to Melbourne in 2010.\n\nCourtney puts a lot of effort into sounding effortless. Her songs are wild and wooly and wordy, her lyrics plainspoken and delivered like she’s making them up on the spot. \n\nCourt’s debut album, Sometimes I Sit and Think, and Sometimes I Just Sit (2015), is out now! And can be ordered here on official site: www.courtneybarnett.com.au.\n\nBarnett was originally a part of several bands, including Immigrant Union and The Olivettes before focusing on her solo work. In 2012, Courtney started her own record label, Milk! Records, and recorded her debut EP I've Got A Friend Called Emily Ferris in a friend's lounge room and released it later that year. Late 2012 also saw the release of a new single, \"History Eraser,\" which was backed with Jen Cloher's \"Mount Beauty\" for a split seven-inch release.\n\nIn 2013, Barnett released her second EP, How to Carve a Carrot Into a Rose. Along with \"History Eraser,\" the EP spawned a second single, \"Avant Gardener.\" Her second EP received international acclaim, taking her and the band, Dave Mudie (drums), Bones Sloane (bass) and Dan Luscombe (guitar) all around the world.\n\nBarnett would later combine those two EP releases into one for The Double EP: A Sea of Split Peas, which was released internationally on 20 May 2013 via House Anxiety/Marathon Artists. It was named the album of the week by Stereogum. Read more on Last.fm. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.", 
            "genres": [
                "alternative rock", 
                "anti-folk", 
                "chamber pop", 
                "folk-pop", 
                "freak folk", 
                "garage rock", 
                "indie folk", 
                "indie pop", 
                "indie rock", 
                "modern rock", 
                "neo-psychedelic", 
                "preverb"
            ], 
            "id": "4OOlG5eBXSkSAAEeKjJb5Y", 
            "image_filepath": "artists/images/4OOlG5eBXSkSAAEeKjJb5Y.jpg", 
            "image_url": "https://i.scdn.co/image/b49aaefb3dcc3e22a0eca23e7fca340aafa12ef9", 
            "name": "Courtney Barnett"
        }, 
        {
            "bio": "Kurt Vile (born 1980 in Philadelphia) is an American guitarist and singer. Previously the lead guitarist in the band The War on Drugs, he began his solo career in 2008.\n\nVile began his musical career in 2003 creating lo-fi home recordings with frequent collaborator Adam Granduciel. The duo subsequently formed the indie rock band The War on Drugs in 2005. Vile departed following the release of their debut studio album, Wagonwheel Blues, in 2008.\n\nVile's music has been likened to Bruce Springsteen, Bob Seger, and Tom Petty. His first album for Matador, titled Childish Prodigy was released in October 2009. Prior to signing with Matador, Vile released two albums, God Is Saying This To You and Constant Hitmaker, on Mexican Summer and Woodsist, respectively. He plays both solo shows as well as shows with a backing band called The Violators.\n\nSmoke Ring For My Halo, released in March of 2011, is Kurt Vile's fourth album and second official release for Matador Records. Uncut placed the album at number 14 on its list of \"Top 50 albums of 2011\" and garnered Vile the iTunes #Rewind2011 Singer/Songwriter Album of the Year. Vile followed up the widely acclaimed album with the six-song EP release, So Outta Reach, in November of the same year. The EP was composed of tracks originating from the same sessions that birthed Smoke Ring for My Halo. So Outta Reach includes the single 'The Creature', acknowledged as one of Vile's best, and a driving rock cover of Bruce Springsteen's 'Downbound Train'.  Read more on Last.fm. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.", 
            "genres": [
                "alternative rock", 
                "chamber pop", 
                "chillwave", 
                "dream pop", 
                "folk-pop", 
                "freak folk", 
                "garage rock", 
                "indie folk", 
                "indie pop", 
                "indie rock", 
                "indietronica", 
                "lo-fi", 
                "modern rock", 
                "neo-psychedelic", 
                "noise pop", 
                "nu gaze", 
                "roots rock", 
                "singer-songwriter", 
                "slow core", 
                "stomp and holler"
            ], 
            "id": "5gspAQIAH8nJUrMYgXjCJ2", 
            "image_filepath": "artists/images/5gspAQIAH8nJUrMYgXjCJ2.jpg", 
            "image_url": "https://i.scdn.co/image/bcf02cddd3f3b917c22f90825292481d80890cd8", 
            "name": "Kurt Vile"
        }, 
        {
            "bio": "Alvvays is a dreampop band formed in Toronto, Canada in 2011.\n\nReverb-drenched and bittersweet, Alvvays members Molly Rankin and Kerri MacLellan were childhood friends, who began playing music with Alec O'Hanley while in high school.  Lead vocalist Molly Rankin is the daughter of John Morris Rankin from the popular Canadian folk family group the Rankin Family. Molly Rankin released a solo EP titled \"She EP\" in 2010 and then in 2011 formed Alvvays with MacLellan, O'Hanley, and new members Brian Murphy and Phil MacIsaac.\n\nFollowing tours with The Pains of Being Pure at Heart and Peter Bjorn and John, the group recorded a full-length album, Alvvays, which was released by Royal Mountain Records (Canada), Polyvinyl Records (US), and Transgressive Records (Europe) in July 2014.  Chad VanGaalen, John Agnello, and Graham Walsh of Holy Fuck all contributed to the album's production.  Simon Vozick-Levinson, writing in Rolling Stone, called the eponymous album an \"indie-pop wonder\".  Alvvays went to #1 on US college charts on August 5, 2014.\n Read more on Last.fm. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.", 
            "genres": [
                "chamber pop", 
                "chamber psych", 
                "chillwave", 
                "dream pop", 
                "folk-pop", 
                "freak folk", 
                "garage psych", 
                "indie folk", 
                "indie garage rock", 
                "indie pop", 
                "indie psych-rock", 
                "indie rock", 
                "indietronica", 
                "lo-fi", 
                "modern rock", 
                "neo-psychedelic", 
                "noise pop", 
                "preverb", 
                "shimmer pop", 
                "synthpop"
            ], 
            "id": "3kzwYV3OCB010YfXMF0Avt", 
            "image_filepath": "artists/images/3kzwYV3OCB010YfXMF0Avt.jpg", 
            "image_url": "https://i.scdn.co/image/098b97354be95aa4e5f3cabfd66870f8252984fa", 
            "name": "Alvvays"
        }, 
        {
            "bio": "The National is a Brooklyn-based alternative rock band formed in 1999, by friends from Cincinnati, Ohio, USA. The band's lyrics are written and sung by Matt Berninger in a distinctive, deep baritone. The rest of the band is composed of two pairs of brothers: Aaron Dessner (guitar, bass, keyboards), Bryce Dessner (guitar), Scott Devendorf (bass, guitar) and Bryan Devendorf (drums). \n\nTheir self-titled debut album\"The National\" (Brassland 2001) was recorded and released before they had played even a single show. They cut the album with engineer Nick Lloyd and formed a label with writer Alec Bemis, so those recordings could be released. Kerrang! magazine gave it four Ks, calling it \"the stuff underground legends are made of.\"\n\nThe National made a second album, \"Sad Songs for Dirty Lovers\" (Brassland/Talitres 2003). The staff was the same, though Peter Katis, who produced \"Turn on The Bright Lights\" and \"Antics\" by Interpol, helped produce and mix, and Australian composer Padma Newsome from Clogs collaborated on arrangements and strings.\n\nFollowing the first session of several for Bernard Lenoir on France's Radio Inter, an in-between EP was released, Cherry Tree, containing what would become the blueprint for the sound on their next record and the session of Sad Song's standout Murder Me Rachael. After these accolades and being impressed by their live show, Roger Trust signed them to Beggars Banquet.\n\nA show at their favorite bar became a van ride to neighboring cities, became a plane ride to Europe, became two summers overseas. Their ties to those good jobs slackened. And they continue on their own path, moving out even further out in Brooklyn to Ditmas Park, where there is space and familiar suburban streets and even Geese on Beverly Road. Their album, \"Alligator\", much of which was recorded at their homes in Ditmas Park, was engineered by Paul Mahajan, who has worked with the Yeah Yeah Yeahs and TV on the Radio. Padma Newsome camped out for a month with the band, and Peter Katis added more production and mixed the record at his house in Bridgeport, Connecticut.\n\nBerninger's potent baritone still intones about matters fraught and funny and sad; about record collections, missing persons and medium-sized American hearts. But the record's not simply gothic or miserablist -- more like the plays of Tennessee Williams, it's full of peculiar intimacies and awkward grace. Alligator's heroes are reckless and possessed seducers, but they are apologetic ones. In The National's imaginings, in songs alternately lush and spare, there is something twighlit and dreamy worked out in the basement of our brains.\n\n\"Abel,\" \"Secret Meeting,\" and \"Lit Up\" were released as singles.\n\nOn May 22, 2007, The National released their follow-up to Alligator, Boxer, on Beggars Banquet. Taking advantage of the fact that nobody had heard their first album and earliest demos, Matt proceeded to steal lyrics and melodies from them and give them the attention they deserved while keeping the intimacy that made them special. They even managed to convince new friend Sufjan Stevens to lay down some piano tracks for them, and recorded the album in a scant 6 months after coming off the long post-Alligator road.\n\n\"Mistaken for Strangers\", \"Fake Empire\" and \"Apartment Story\" have been released as singles. The band have just finished touring North America and are on a large European autumn/winter tour after playing high slots at several large festivals. In their Dec. 07/Jan. 08 issue, Paste magazine named Boxer best record of 2007.\n\nThe band's fifth album, High Violet, was released on May 10, 2010 by 4AD Records. \"Bloodbuzz Ohio\", \"Anyone's Ghost\" and \"Terrible Love\" were released as singles.\n\nThe National homepage: http://www.americanmary.com/\nThe National blog http://tntl.tumblr.com\nThe National on Twitter http://twitter.com/The_National\nBrassland homepage: http://brassland.org/\nBeggars Banquet homepage: http://www.beggars.com/ Read more on Last.fm. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.", 
            "genres": [
                "alternative rock", 
                "chamber pop", 
                "folk-pop", 
                "indie folk", 
                "indie pop", 
                "indie rock", 
                "modern rock", 
                "stomp and holler"
            ], 
            "id": "2cCUtGK9sDU2EoElnk0GNB", 
            "image_filepath": "artists/images/2cCUtGK9sDU2EoElnk0GNB.jpg", 
            "image_url": "https://i.scdn.co/image/7249cc6ecd94aebd2dfa5cefb6db057a84790d40", 
            "name": "The National"
        }, 
        {
            "bio": "Sleater-Kinney is a rock band which formed in 1994 in Olympia, Washington, United States. The band's lineup is Corin Tucker (vocals, guitar), Carrie Brownstein (vocals, guitar) and Janet Weiss (drums). Before Weiss, the band had a succession of drummers, including Lora Macfarlane, Misty Farrell and Toni Gogin.\n\nThe group's name is derived from Sleater Kinney Road, Interstate 5 off ramp #108 in Lacey, Washington, the location of one of their early practice spaces. They formed in and were a vital part of the riot grrrl and punk scenes in Washington, although they later relocated to Portland, Oregon. Throughout its existence the band was often noted by critics for its \"anthemic\" feminist message, its willingness to reinvent the musical palette of punk rock, and its consistency in producing highly acclaimed albums.\n\nCorin Tucker had previously been a member of Heavens to Besty (and would form the side project Cadallaca while a member of Sleater-Kinney), and Brownstein had been a member Excuse 17 (and, like Tucker, formed a side project, The Spells, while still a member of Sleater-Kinney). Weiss, a member of Quasi, and later Motorgoat and Stephen Malkmus and the Jicks, became the band's drummer in 1996. The band released seven albums, \"Sleater-Kinney\" (1995), \"Call the Doctor\" (1996), \"Dig Me Out\" (1997), \"The Hot Rock\" (1999), \"All Hands on the Bad One\" (2000), \"One Beat\" (2002) and \"The Woods\" (2005) before disbanding in 2006, with the members going on to pursue other projects. \n\nCorin Tucker formed Corin Tucker Band in 2010, and provided backing vocals to Eddie Vedder's \"Into the Wild\" soundtrack album in 2008. Brownstein, who had written for \"The Believer\" and \"Slate\" while still in the band, became a writer for NPR. Her blog, Monitor Mix, was active from 2007 to 2010. Brownstein also formed the band Wild Flag in 2010 and created, co-wrote and co-starred in the sketch comedy series \"Portlandia\" which began airing on IFC in early 2011.\n\nOn October 20, 2014, the band announced a full reunion and released details of their forthcoming eighth album, \"No Cities To Love\" (2015). Read more on Last.fm. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.", 
            "genres": [
                "alternative pop", 
                "alternative rock", 
                "anti-folk", 
                "electroclash", 
                "escape room", 
                "folk-pop", 
                "garage rock", 
                "indie folk", 
                "indie pop", 
                "indie punk", 
                "indie rock", 
                "lilith", 
                "lo-fi", 
                "modern rock", 
                "noise pop", 
                "noise rock", 
                "preverb", 
                "riot grrrl"
            ], 
            "id": "4wLIbcoqmqI4WZHDiBxeCB", 
            "image_filepath": "artists/images/4wLIbcoqmqI4WZHDiBxeCB.jpg", 
            "image_url": "https://i.scdn.co/image/2ff829de85b2b35a0aeabdb49bcbe2f616b0c63a", 
            "name": "Sleater-Kinney"
        }
    ]
}