{
    "artists": [
        {
            "bio": "Raphael Saadiq (born Charlie Ray Wiggins on May 14, 1966 in Oakland, California) is an acclaimed American music artist. He is a singer, songwriter and record producer associated with the neo-soul music movement.\n\nSaadiq made a name for himself as the lead vocalist in the rhythm and blues and dance trio Tony! Toni! Toné!. He went by his birth name during the beginning of Tony! Toni! Toné!, where he was joined by his brother Dwayne Wiggins, and his cousin Timothy Christian. He adopted the name of Raphael Saadiq in the mid-1990s.\n\nAfter the 1996 Tony! Toni! Toné! album, House of Music, (when he performed under his current name) Saadiq started his solo career. He produced a few solo tracks, but Saadiq's next big project became the R&B supergroup Lucy Pearl. He recorded the self-titled album with Dawn Robinson (En Vogue) and Ali Shaheed Muhammad (A Tribe Called Quest). This group only lasted for one album. His solo album Instant Vintage, released in 2002, also earned 5 Grammy nominations.\n\nSaadiq released his third solo album, The Way I See It, on September 16 2008, featuring collaborations with Stevie Wonder and Joss Stone. Saadiq acknowledges the album's old school soul sound, which he says includes nods to Gladys Knight & The Pips, Al Green,  The Four Tops, The Delfonics and The Stylistics.\n\nVarious artists have tapped Saadiq to produce their work through the years. Some of Saadiq's most notable work has been with D'Angelo. The 2000 collaboration \"Untitled\" won D'Angelo a Grammy award for Best R&B Album. In 2007, Saadiq was called on to produce the whole third album from UK Soul singer Joss Stone. Other artists he has collaborated with include The Roots, Macy Gray, Snoop Dogg, Kelis, Q-Tip and Young Bellz.\n\nIn 2002, Saadiq founded his own record label, Pookie Entertainment. Among the artists on the label are Joi and Truth Hurts.\n\nSaadiq has been playing music since the age of six. Back in the 1970s and 1980s, he played bass at church and school. He also enjoyed his on-stage moments at various local events of his hometown.\n\nhttp://vimeo.com/3020000\n Read more on Last.fm. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.", 
            "genres": [
                "funk", 
                "indie r&b", 
                "neo soul", 
                "quiet storm", 
                "r&b", 
                "soul", 
                "urban contemporary"
            ], 
            "id": "6g0Wah2YFtb1rFgKhUktlo", 
            "image_filepath": "./artist/images/6g0Wah2YFtb1rFgKhUktlo.jpg", 
            "image_url": "https://i.scdn.co/image/653a59d57738be077de0f3f0a67393304a6e385d", 
            "name": "Raphael Saadiq"
        }, 
        {
            "bio": "Born Jill Heather Scott in the North Philly neighborhood of the City of Philadelphia, PA  on April 4, 1972.  She began her career as a performance poet. She was discovered by Amir \"Questlove\" Thompson of The Roots. Questlove invited her to join the band in the studios. Which resulted in the live version of \"You Got Me\" in 1999. \n\nSubsequently, she collaborated with Eric Benet, Will Smith, Lupe Fiasco, Common and broadened her performing experience by touring Canada in a production of the Broadway musical Rent. Signed to Steve McKeever's newly formed Hidden Beach Recordings label, she released her debut album Who Is Jill Scott: Words and Sounds Vol. 1 in July 2000. The following summer she released Experience:Jil Scott 826+ after she released the single \"A Long Walk.\" Scott continued to gain more recognition, eventually earning a Grammy nomination in early 2003 for Best Female Vocal Performance for \"A Long Walk\", Jill Scott won a Grammy award at the 2005 Grammy awards for Best R&B Solo Vocal Performance, Male or Female.\n\nJill Scott appears in David Chappelle's Block Party performing with The Roots and Erykah Badu.\n\nScott released a new album, entitled Beautifully Human: Words and Sounds Vol. 2 in 2004. Her book of poetry, The Moments, The Minutes, The Hours was released in April 2005.\n\nRecently, Scott was prominently featured on hip-hop artist Lupe Fiasco's 2006 single \"Daydreaming\" which also appeared on a new Scott collection called Collaborations on January 30, 2007.\nThe Collaborations collection served as \"an appetizer\" for her next studio album, The Real Thing: Words and Sounds Vol. 3 released September 25, 2007. A clip of the title track was released on a bonus disc from Hidden Beach Records and included with Collaborations. The lead single \"Hate on Me\", gained airplay in May 2007 with a video released in mid-July. In advance of the album's release, Hidden Beach released a 17-minute album sampler through their forums. Interspersed between the dozen songs previewed on the sampler was a personal explanation from Jill for the inspiration behind some of her songs.\n\nJill Scott is also an accomplished actor, appearing as detective Precious Ramotswe in the BBC's dramatisation of Alexander McCall Smith's series of books: \"The No. 1 Ladies' Detective Agency\". Scott also appeared as \"Sheila\" in the Tyler Perrry film, \"Why Did I Get Married\" (2007) and its sequel, \"Why Did I Get Married Too\" (2010) .\n Read more on Last.fm. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.", 
            "genres": [
                "dance pop", 
                "deep indie r&b", 
                "funk", 
                "hip hop", 
                "hip pop", 
                "indie r&b", 
                "neo soul", 
                "new jack swing", 
                "pop", 
                "quiet storm", 
                "r&b", 
                "soul", 
                "urban contemporary", 
                "vocal jazz"
            ], 
            "id": "6AVLthptCPhfrxlHadOBJD", 
            "image_filepath": "./artist/images/6AVLthptCPhfrxlHadOBJD.jpg", 
            "image_url": "https://i.scdn.co/image/1523c231a2f7cb0c83ecf0b6e933e6033c8b38d6", 
            "name": "Jill Scott"
        }, 
        {
            "bio": "Rancid is a punk rock band which formed in Berkeley, California, United States in 1991. The band consists of Tim Armstrong (vocals, guitar), Lars Frederiksen (guitar), Matt Freeman (bass) and Branden Steineckert (drums). The band has released nine albums: Rancid (1993), Let's Go (1994), ...And Out Come the Wolves (1995), Life Won't Wait (1998), Rancid (2000), Indestructible (2003), Let the Dominoes Fall (2009), ...Honor Is All We Know (2014), and Trouble Maker (2017). The band originally consisted of Armstrong, Freeman (both former members of Operation Ivy) and drummer Brett Reed, with Frederiksen joining in 1993. Reed left in 2006 and was replaced by Stieneckert.\n\nTo date, Rancid has released nine studio albums, one split album, one compilation, two extended plays, and a series of live online-only albums, and has been featured on a number of compilation albums.The band has independently sold over four million records worldwide,[4] making it one of the most successful independent punk groups of all time. The band rose to fame in 1994 with its second studio album, Let's Go, featuring the single \"Salvation\". In the following year, Rancid released its highly successful album ...And Out Come the Wolves, which produced its best-known songs \"Roots Radicals\", \"Ruby Soho\" and \"Time Bomb\", and was certified gold and platinum by the RIAA, selling over one million copies in the United States alone. Its next four albums, Life Won't Wait, Rancid, Indestructible and Let the Dominoes Fall, were also critically acclaimed, though not as successful as ...And Out Come the Wolves. Read more on Last.fm. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.", 
            "genres": [
                "alternative rock", 
                "pop punk", 
                "punk", 
                "skate punk"
            ], 
            "id": "6xTk3EK5T9UzudENVvu9YB", 
            "image_filepath": "./artist/images/6xTk3EK5T9UzudENVvu9YB.jpg", 
            "image_url": "https://i.scdn.co/image/f08ac7ae053bab1adbc3fe0be5d63edbb11a8e60", 
            "name": "Rancid"
        }, 
        {
            "bio": "Bad Brains are a United States hardcore punk band, originally formed in Washington DC in 1977. Though the band's members objected to the term \"hardcore\" to describe their music, they are considered pioneers of hardcore punk, and their debut albums of all time Bad Brains is considered by many to be one of the finest albums ever. Just as often as their sound is fast and frantic, the band often plays full-on dub and reggae.\n\nOriginally formed as a jazz fusion ensemble, Bad Brains developed a very fast and intense punk rock sound, which was both musically complex and more extreme than most of their punk contemporaries. They were also an adept reggae band, in a sort of Jekyll-and-Hyde arrangement, while later recordings also featured elements of funk and heavy metal. Bad Brains were also notable as religious Rastafarians. \n\nBad Brains have broken up and reformed several times over the years (most recently as the Soul Brains), sometimes with different singers and/or drummers. Their existence has been in three periods: 1977–1984, 1986–1995, and 1997–present. The group's classic line-up was singer H.R., guitarist Dr. Know, bass guitarist Darryl Jennifer, and drummer Earl Hudson.\n\n(SOMETHING MISSING HERE?)\n\nThis might have been the end of the Bad Brains—if it were not for Ric Ocasek. Ocasek, frontman of New Wave band The Cars, had seen the group play in Boston, and asked them to record an album. Having arrived back from tour with no place to live and no equipment, the Bad Brains took him up on his offer. The result was Rock for Light, released on the large independent label PVC/Jem (who also released The Cure's first album).\n\nIn the early '90s, H.R. embarked upon a solo reggae career. During his initial departure, he was replaced along with drummer Hudson by new singer Israel Joseph I and their sound became more in the vein of alternative rock.\n\nMarking a return to their trademark hardcore punk/reggae sound, the original lineup of the Bad Brains released Build a Nation in June 2007, a new, critically acclaimed album with longtime fan Adam Yauch of the Beastie Boys handling the production. The Beastie Boys, were huge Bad Brains fans, and they intentionally selected a name with the initials B.B. because of this.\n\nOfficial Site: http://www.badbrains.com\nMyspace: http://myspace.com/badbrains Read more on Last.fm. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.", 
            "genres": [
                "alternative rock", 
                "crossover thrash", 
                "funk rock", 
                "grunge", 
                "hardcore", 
                "hardcore punk", 
                "post-hardcore", 
                "post-punk", 
                "punk", 
                "rap rock", 
                "ska punk", 
                "skate punk"
            ], 
            "id": "1oVj9JmPUPg4SQ2uerV2xc", 
            "image_filepath": "./artist/images/1oVj9JmPUPg4SQ2uerV2xc.jpg", 
            "image_url": "https://i.scdn.co/image/799bf8dbc475adc51b78d1a963db4fd566f2f24d", 
            "name": "Bad Brains"
        }, 
        {
            "bio": "From San Diego, California, award-winning reggae group Tribal Seeds have become known for their spiritually driven, refreshing rock vibe they have infused with the roots style of reggae music. Originally started by two brothers, Steven Rene Jacobo [lyrics, lead vocals, rhythm guitar] and Tony-Ray Jacobo [producer, keyboard player], Tribal Seeds now boats six members, including: Tony Navarro [lead guitar], Carlos Verdugo [drums], Jose Rodriguez [keys, percussion], and Victor Navarro [bass].\n\nTribal Seedsʻ unmatched musical talent and authentic sound has brought them to the forefront of the reggae rock genre, as their art form has reached people of all ages across the United States, and worldwide. The bandʼs self titled debut album, “Tribal Seeds” was released in 2008, and their second album “The Harvest” was released in June of 2009. iTunes named both albums the “Best Of” in the Reggae genre, for their respected years. Their debut album helped garner them the “Best World Music” title at the San Diego Music Awards in 2008, and “The Harvest,” which obtained fourteen new and original songs, debuted at the number 5 spot on the Billboard Reggae Charts. The tracks, written and produced by Tribal Seeds, were recorded and mixed by Alan Sanderson at Signature Sound Studios in San Diego, and mastered by Erik Lobson at Universal Mastering.\n\nOn July 19, 2011, Tribal Seeds gave listeners a brand new EP entitled “Soundwaves,” which peaked at number 2 on the Billboard Reggae Charts. The band notes that the album was inspired by their life experiences, being on tour, and their desire to inspire youth to raise their voices and seek a higher consciousness.\n\nTribal Seeds have toured throughout the United States, and have also performed in Mexico, Guam, Aruba, and Hawaii. They have shared the stage with artists such as Matisyahu, MGMT, Cee Lo Green, Jason Mraz, Sublime with Rome, Taking Back Sunday, O.A.R., Pretty Lights, Pepper, Collie BuddzThe Wailers, Stephen Marley, Gregory Issacs, SOJA, Rebelution, and many more. Read more on Last.fm. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.", 
            "genres": [
                "reggae", 
                "reggae rock", 
                "roots reggae"
            ], 
            "id": "7jgZFR40bWjwOrRCOZFB02", 
            "image_filepath": "./artist/images/7jgZFR40bWjwOrRCOZFB02.jpg", 
            "image_url": "https://i.scdn.co/image/a4d438f1d982b37c6aec34534f286ac8eb341e5a", 
            "name": "Tribal Seeds"
        }, 
        {
            "bio": "Bob Marley and the Wailers (BMW) was a Jamaican  reggae band 1974-1981) lead by Rastafarian Bob Marley (1945-1981) when Peter Tosh and Bunny Wailer left the old band, The Wailers. BMW, consisted of Marley himself as song writer and lead singer, 6-7 regular musicians in Wailers Band and the I Threes backup female vocalists. It is the most prosperous reggae band ever with +75 million record sales, known for songs like One Love, I Shot The Sheriff, Natural Mystic. Stir It Up, No Woman No Cry, Exodus and Get Up Stand Up.\n\nThe band included Carlton Barrett on drums – Aston \"Family Man\" Barrett bass – Junior Marvin and Al Anderson on lead guitar – Tyrone Downie and Earl \"Wire\" Lindo on keyboards – Alvin \"Seeco\" Patterson on percussion. The I Threes, consisted of Bob Marley's wife Rita Marley, Judy Mowatt and Marcia Griffiths.\n\nOften, usually for marketing purposes, Bob Marleys name alone, or the name Bob Marley and the Wailers, are used indiscriminately to refer to recordings made before 1974, during reggae, rocksteady and ska eras, made by The Wailers (Marley, Peter Tosh, Bunny Wailer (real name: Neville Livingston)) with different accompaniment musicians.\n\nDISCOGRAPHY (Island Records / Tuff Gong) – studio albums and live albums\n\n*1974 – Natty Dread\n*1975 – Live! – live album\n*1976 – Rastaman Vibration\n*1977 – Exodus \n*1978 – Kaya \n*1978 – Babylon By Bus – live album\n*1979 – Survival\n*1980 – Uprising\n\nP o s t h u m o u s l y :\n\n* 1983 – Confrontation – studio album\n* 1991 – Talkin' Blues (rec 1973 och 1975) – live album\n* 2003 – Live at the Roxy (rec 1976) – live album\n* 2011 – Live Forever (rec 1980) – live album\n\nCompilation albums:\n\n* 1984 – Legend  \n* 1986 – Rebel Music\n* 1995 – Natural Mystic: The Legend Lives On\n* 2001 – One Love: The Very Best of Bob Marley & The Wailers\n* 2005 – Gold\n* 2005 – Africa Unite: The Singles Collection\n* 2011 – Live Forever: The Stanley Theatre, Pittsburgh, PA, September 23, 1980 – live album\n* 2013 – Legend: Remixed – 2 CD + 1 DVD\n\n\nALBUMS by the reggae band THE WAILERS (Bob Marley, Peter Tosh, Bunny Wailer, Aston Barrett, Carlton Barrett on Island Records)\n\n*1973 – Catch a Fire\n*1973 – Burnin'\n\n\n Read more on Last.fm. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.", 
            "genres": [
                "reggae", 
                "roots reggae"
            ], 
            "id": "2QsynagSdAqZj3U9HgDzjD", 
            "image_filepath": "./artist/images/2QsynagSdAqZj3U9HgDzjD.jpg", 
            "image_url": "https://i.scdn.co/image/b5aae2067db80f694a980e596e7f49618c1206c9", 
            "name": "Bob Marley & The Wailers"
        }, 
        {
            "bio": "Gyptian (born Windel Beneto Edwards, 25 October 1983, Oldham, England) is an English-born Jamaican reggae singer. He often appears with roots reggae songs within the reggae subgenre dancehall.\nGyptain best known hits include Serious Times, Mama, Beautiful Lady, I Can Feel Your Pain, Love Against The Wall, Hold You and She's My Lady.\n\nBorn to a Seventh-day Adventist mother and Rastafarian father, Gyptian received his musical calling at the age of seven, when he began singing in the church. Recognizing his talent, his parents introduced him to Mr. Wong, a record producer from Portmore, St. Catherine. \"I did not take it seriously,\" said Gyptian \"My family members have always been carrying me to Portmore to see him, but I usually disappear. One day, they dropped me off at his studio and left me and it all began there.\"\nUnder the guidance of Mr. Wong and Earl Chinna Smith, Gyptian honed his sound, winning the 2004 Star Search talent competition at Kens Wild Flower Lounge in Portmore, earning him a spot at Sting 2004, dubbed the 'greatest one night reggae show on earth'.\nThe singer earned his nickname from his habit of tying a shirt around his head and twisting his chin hair like an Egyptian pharaoh.\nIn 2005 he scored two hits, \"Is There A Place\" on the Seasons Riddim and \"Serious Times\".\nNominated for Best New Entertainer at the 2006 International Reggae and World Music Awards, the twenty-three year old singer has been dominating the Jamaician charts with hits including \"Is There a Place\", \"Beautiful Lady\", and the chart-topping ballad, \"Mama, Don't Cry\".\nHis style of reggae music is considered lovers rock and roots reggae, with songs about political issues and love. His musical and lyrical style has been compared to established Jamaican artists, such as Sizzla, Luciano and Beres Hammond.\nOn 12 September 2006, Gyptian released his first album on VP Records. On 12 December 2007, Gyptian, while in New York, shot the music video for his new single, \"I Can Feel Your Pain\" (Cloud Nine Riddim) Produced by Jon FX. The song was the first to be confirmed to appear on his album \"I Can Feel Your Pain\" which was released in 2008.\n\nAs of the end of May 2010, his single \"Hold Yuh\" had peaked at number 91 on the Billboard Hot 100, number 33 on the Billboard R&B/Hip-Hop Chart, number 6 on the Billboard Heatseekers Songs Chart and had been at the top of the Reggae Digital Songs chart for nine consecutive weeks. In June, the song re-entered the Billboard Hot 100 and eventually reached a new peak of 77 on that chart, number 3 on the Heatseekers Songs chart, 31 on the Billboard R&B/Hip-Hop Chart, 63 on the Radio Songs chart and an astonishing peak of 28 on the Billboard Rhythmic Top 40, capitalizing it crossover success. The song also peaked at number 1 on the Dancehall/Reggae fusion Charts of the Jamaica Weekly Music Charts for two consecutive weeks. In Canada it peaked at #69 on the Canadian Hot 100. The official remix for the song features rapper Nicki Minaj. It spent 29 weeks on the Billboard R&B/Hip-Hop Chart and 15 weeks on the Billboard Hot 100.\nGyptian has been enjoying chart success with his new album, Hold Yuh, which continues to hold the #2 spot on Billboard’s Reggae Albums Chart. The title track, “Hold Yuh,” has become a multi-chart hit worldwide and deemed a “2010 Summer Anthem.” According to Billboard Magazine “not since Wayne Wonder's \"No Letting Go,\" has an underground reggae artist garnered as much attention in the United States as Jamaica's own Gyptian.” The song also became popular in the UK, and was released there on November 7 by Ministry of Sound Recordings, in an EP which will include remixes by Shy FX, Major Lazer and Toddla T. Read more on Last.fm. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.", 
            "genres": [
                "dancehall", 
                "roots reggae"
            ], 
            "id": "2JX4h8xm0hNxCB0aNBWzyi", 
            "image_filepath": "./artist/images/2JX4h8xm0hNxCB0aNBWzyi.jpg", 
            "image_url": "https://i.scdn.co/image/a09a20585079a8b349b6d98482fd29153270b2fa", 
            "name": "Gyptian"
        }, 
        {
            "bio": "I Wayne (born Cliffroy Taylor in 1980 in Portmore, Jamaica), is a roots reggae singer. He is known for his hits Living In Love and Can't Satisfy Her from his debut album Lava Ground as well as the title track from his second album, Book of Life.\n\nI Wayne was raised by his aunt and her husband Ansell Collins, a renowned keyboard player. This young artist has been refining his craft since age seven. Coming from a musical family, I Wayne had first made his venture into performance as a student at Greater Portmore High School, joining a local group Vibes Machine. The group, consisting of singers and DJs, used to perform at afterwork parties at popular clubs like Cactus and Asylum. One night, the artiste was forced to perform alone due to the fact that his bandmates were running extremely late. The response was tremendous, and I Wayne was motivated to perfect his solo act.\n\nIn the Summer of 2004, Wayne released Can't Satisfy Her, in the new wave of reggae. The track was reportedly the first roots reggae song to be added to the playlist of Hot 97, the influential hip-hop radio station in New York City.\n\nIn November of 2004, I Wayne signed a record deal with VP Records to release his debut album, Lava Ground. Lava Ground was praised for returning to reggae's \"essential roots\" in contrast to popular reggae artists who induce listeners to \"dance and groove to their carefree music\".\n\nI Wayne’s first week sales from his sophmore album Book of Life (Nov. 6, 2007) walked him straight to the top of the Billboard charts at the #4 spot in the reggae category. Read more on Last.fm. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.", 
            "genres": [
                "dancehall", 
                "lovers rock", 
                "reggae", 
                "reggae fusion", 
                "roots reggae"
            ], 
            "id": "3HQIkVkhoARQMb0XlvyUKL", 
            "image_filepath": "./artist/images/3HQIkVkhoARQMb0XlvyUKL.jpg", 
            "image_url": "https://i.scdn.co/image/4d98c6004339a02109a23a0d03375d160dee7f69", 
            "name": "I Wayne"
        }, 
        {
            "bio": "Buddy Guy (born George Guy, July 30, 1936 in Lettsworth, Louisiana) is an American blues music and rock music guitarist, as well as a singer. Known as an inspiration to Jimi Hendrix and other 1960s blues and rock legends, Guy is considered as an important proponent of Chicago blues made famous by Muddy Waters and Howlin' Wolf. He has influenced both widely known and local blues guitarists.\n\nGuy is known for his showmanship; for example, he plays with drumsticks and walks into the audience whilst playing, the latter being a gimmick he picked up from a local blues guitarist at an early age (joining or leaping into the audience has also long been common in both American popular and gospel music, as in the earlier work of Big Jay McNeely or the Dixie Hummingbirds).\n\nGuy grew up in Louisiana where he learned to play guitar. In the early 1950s he began performing with bands in Baton Rouge. Soon after moving to Chicago in 1957, Guy fell under the influence of \"Mighty\" Muddy Waters. In 1958 he won a record contract with Artistic Records after beating the West Side guitarists Magic Sam and Otis Rush in a \"Head Cutting Contest\" at the Blue Flame Club. Soon afterwards he recorded for the Cobra label.\n\nIn the early 1960s, Guy was a session guitarist for Chess Records. He recorded on Junior Wells sessions for Delmark Records under the pseudonym Friendly Chap in 1965 and 1966. His career took off during a blues revival period in the late 1980s and early 1990s, and was sparked by Eric Clapton's request that Guy be part of the '24 nights' all-star blues guitar lineup at London's Royal Albert Hall and Guy's subsequent signing with Silvertone Records. Read more on Last.fm. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.", 
            "genres": [
                "acoustic blues", 
                "album rock", 
                "blues", 
                "blues-rock", 
                "chicago blues", 
                "classic rock", 
                "country blues", 
                "delta blues", 
                "electric blues", 
                "jazz blues", 
                "louisiana blues", 
                "memphis blues", 
                "memphis soul", 
                "modern blues", 
                "new orleans blues", 
                "piedmont blues", 
                "rock", 
                "roots rock", 
                "soul blues", 
                "southern rock", 
                "swamp blues", 
                "texas blues", 
                "traditional blues"
            ], 
            "id": "2gCsNOpiBaMNh20jQ5prf0", 
            "image_filepath": "./artist/images/2gCsNOpiBaMNh20jQ5prf0.jpg", 
            "image_url": "https://i.scdn.co/image/f89a2d2e5a90201d5fd90c7ffff29ea22f1d96d5", 
            "name": "Buddy Guy"
        }, 
        {
            "bio": "Junior Wells (December 9, 1934 - January 15, 1998), born Amos Blakemore, was a blues vocalist and harmonica player based in Chicago who was famous for playing with Muddy Waters, Buddy Guy, Magic Sam, Lonnie Brooks, The Rolling Stones and Van Morrison.\n\nHe was born in Memphis, Tennessee, and raised in Arkansas. Wells moved to Chicago in 1948 and first made his mark at age 18 playing in Muddy Waters' band. He later worked with Buddy Guy in the 1960s and recorded for Delmark Records. His most memorable songs are \"Messin' With the Kid\" and \"Little by Little,\" and his best-known album, 1965's Hoodoo Man Blues, which evokes the smoky atmosphere of the era's Westside Chicago blues bars.\n\nWells made an appearance in the 1998 movie Blues Brothers 2000, the sequel to The Blues Brothers. The movie was released less than a month after his death.\n\nOn his passing in 1998, Junior Wells was interred in the Oak Woods Cemetery, Chicago. Read more on Last.fm. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.", 
            "genres": [
                "acoustic blues", 
                "blues", 
                "blues-rock", 
                "british blues", 
                "chicago blues", 
                "country blues", 
                "delta blues", 
                "electric blues", 
                "harmonica blues", 
                "jazz blues", 
                "jump blues", 
                "louisiana blues", 
                "memphis blues", 
                "modern blues", 
                "new orleans blues", 
                "piano blues", 
                "piedmont blues", 
                "soul blues", 
                "swamp blues", 
                "texas blues", 
                "traditional blues"
            ], 
            "id": "78CBFzwo7wwNaaTYVP5btK", 
            "image_filepath": "./artist/images/78CBFzwo7wwNaaTYVP5btK.jpg", 
            "image_url": "https://i.scdn.co/image/c25d71058253bd3495b542c108a520cbbdaf5c52", 
            "name": "Junior Wells"
        }, 
        {
            "bio": "Mance began playing professionally in his early teens and left college in 1947 to join Gene Ammons' band, where he began his recording career. Mance also worked with Lester Young before being drafted into the U.S. Army in 1951. In the 36th Army Band, he served with another notable Jazz musician: Julian \"Cannonball\" Adderley.\n\nAfter his discharge from the Army in 1953, Mance worked as a sideman and accompanist with musicians such as Dinah Washington, Cannonball Adderley, and Dizzy Gillespie before recording his first album as a leader and forming his own trio in 1961. To date he has recorded over thirty albums, for labels such as Verve, Jazzland, Riverside, Capitol, Atlantic, Milestone, Polydor, Inner City, JSP, Nilva, Sackville, Bee Hive, and others.\n\nSince 1988 he has been a member of the faculty of the Jazz and Contemporary Music Program at the New School University in New York City.\n\nIn 1997, Junior Mance was inducted into The International Jazz Hall of Fame.\n\n(2) Junior Mance is well-known for his soulful bluesy style, but he is also expert at playing bop standards. He started playing professionally when he was ten. Mance worked with Gene Ammons in Chicago during 1947-1949, played with Lester Young (1950), and was with the Ammons-Sonny Stitt group until he was drafted. He was the house pianist at Chicago's Bee Hive (1953-1954), worked as Dinah Washington's accompanist (1954-1955), was in the first Cannonball Adderley Quintet (1956-1957), and then spent two years touring with Dizzy Gillespie (1958-1960). After a few months with the Eddie \"Lockjaw\" Davis/Johnny Griffin group, Mance formed his own trio and has mostly been a leader ever since. He has led sessions for Verve, Jazzland, Riverside, Capitol, Atlantic, Milestone, Polydor, Inner City, JSP, Nilva, Sackville, and Bee Hive, among other labels. ~ Scott Yanow Read more on Last.fm. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.", 
            "genres": [
                "bebop", 
                "contemporary post-bop", 
                "cool jazz", 
                "hard bop", 
                "jazz", 
                "soul jazz", 
                "stride"
            ], 
            "id": "1KTUh4AYegM2fSdac5xqPb", 
            "image_filepath": "./artist/images/1KTUh4AYegM2fSdac5xqPb.jpg", 
            "image_url": "https://i.scdn.co/image/da32b254e807b46b876f9f50057e31df54632097", 
            "name": "Junior Mance"
        }, 
        {
            "bio": "Modest Mouse is an alternative rock band which formed in 1993 in Issaquah, Washington, United States. The band's original lineup consisted of guitarist Isaac Brock, drummer Jeremiah Green and bassist Eric Judy. Since being signed to Sony's Epic Records in 2000, Modest Mouse has attained significant popular success with songs such as \"Float On\" and \"Dashboard.\"\n\nThe band's current configuration is Isaac Brock (vocals, guitar), Tom Peloso (strings, horns, bass, keyboards), Jim Fairchild (guitar), Eric Judy (bass), Jeremiah Green (drums) and Joe Plummer (drums). Plummer has recently become the new drummer for The Shins.\n\nBrock came up with the name \"Modest Mouse\" when he read the Virginia Woolf stream of consciousness essay The Mark On the Wall in which the author described the working middle class as \"modest mouse-coloured people\"\n\nBrock frequently moved around with his mother when he was a child. Around this time, his mother left his father for his father's brother (Brock's uncle). Brock's mother's house flooded and forced them to move into his mother's new husband's trailer, but there was no room for Brock. Brock stayed behind, living in the second story of the flooded house, until he was eventually evicted by police. He then moved into a shed next to his mother's house and it is said this is where Brock, drummer Jeremiah Green and bassist Eric Judy first began playing music.\n\nIn 1994, the band recorded their debut EP, Blue Cadet-3, Do You Connect?, at Calvin Johnson's Dub Narcotic Studios, which was then released on Calvin's record label K Records. Then followed a single with Sub Pop that was recorded by producer Steve Wold at Moon Studios. Wold, who in the mid-2000's would begin to perform under the name Seasick Steve, would also perform on the band's albums, but was never an official member of the band. After moving to Up Records Modest Mouse put out several releases recorded at Moon Studios, including 1996's This Is A Long Drive For Someone With Nothing To Think About. This double LP was produced and recorded by Steve Wold. The next offering on UP was Interstate 8; also produced by Steve Wold. 1997's The Lonesome Crowded West, (also recorded at Moon Studios, by Scott Swayze) turned out to be the band's breakthrough album. The Lonesome Crowded West gained the band a cult following and is now widely considered by many critics to be one of the defining albums of mid-90s indie rock.\n\nIn 2000, Modest Mouse released The Moon And Antarctica, their first album on a major label (Epic Records). The band enjoyed some success on alternative radio with the singles \"3rd Planet\" and \"Gravity Rides Everything.\" Lead singer Isaac Brock has since put out an album with his side project Ugly Casanova on Sub Pop Records. \n\nIn 2003, drummer Jeremiah Green quit the band; the official word was that he was quitting to work with his side project, Vells. He was replaced with two members, drummer Benjamin Weikel (who also drummed for The Helio Sequence) and guitarist Dann Gallucci (Murder City Devils).  Weikel being new to the band and Gallucci returning to the band for the first time since This is a Long Drive for Someone with Nothing to Think About. On April 6, 2004, Modest Mouse released the platinum-selling Good News For People Who Love Bad News, which scored two hits with \"Float On\" and \"Ocean Breathes Salty\". In 2004 Jeremiah Green returned to the band, and Benjamin Weikel now drums exclusively for The Helio Sequence. Dann Gallucci left the band in August, and they toured with Hutch Harris of The Thermals during the fall of 2004.\n\nModest Mouse was mentioned by name in the 2005 Supreme Court decision in the case of MGM v. Grokster. Justice Souter wrote that on the Grokster P2P network, \"Users seeking Top 40 songs, for example, or the latest release by Modest Mouse, are certain to be far more numerous than those seeking a free Decameron, and Grokster and StreamCast translated that demand into dollars.\"\n\nIn 2005, multi-instrumentalist Tom Peloso, who already played various instruments on Good News For People Who Love Bad News, officially joined the band. In 2006,  Johnny Marr, former guitarist for The Smiths, became an official member of the band.\n\nOn March 20, 2007, the band released their fifth album, We Were Dead Before The Ship Even Sank. Four singles were released from the album: \"Dashboard\", \"Missed the Boat\", \"We've Got Everything\" and \"Little Motel\". The album debuted at #1 on the Billboard 200 album chart. James Mercer of The Shins provides backing vocals on three songs.\n\nIn 2009, they released No One's First And You're Next, an EP of unreleased songs from around the time Good News and We Were Dead were recorded, and two songs that had already been released, \"I've Got It All (Most)\" and \"King Rat\". The video for King Rat was directed by late actor Heath Ledger.\n\nIn 2009, Johnny Marr left the band and was replaced by Jim Fairchild, formerly of Grandaddy. The band performed at several festivals throughout 2009 and 2010, including the main stage of the Reading and Leeds Festivals in 2010. \n\nAfter an 8 year wait, the band's latest full-length is \"Strangers To Ourselves\", released March 17th, 2015- two weeks after the original release date, March 3rd, 2015. The album art is an aerial photo of an RV resort located in Mesa, Arizona. Five singles were released before the album, \"Lampshades on Fire\", \"Coyotes\", \"The Ground Walks, with Time in a Box\", \"The Best Room\", and \"Of Course we Know\".  Read more on Last.fm. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.", 
            "genres": [
                "alternative rock", 
                "garage rock", 
                "indie folk", 
                "indie pop", 
                "indie rock", 
                "lo-fi", 
                "modern rock", 
                "neo-psychedelic", 
                "noise pop", 
                "pop rock", 
                "stomp and holler"
            ], 
            "id": "1yAwtBaoHLEDWAnWR87hBT", 
            "image_filepath": "./artist/images/1yAwtBaoHLEDWAnWR87hBT.jpg", 
            "image_url": "https://i.scdn.co/image/4766cd29878454c265a06c7a9b20ca1b74c1fbcd", 
            "name": "Modest Mouse"
        }, 
        {
            "bio": "Oh Wonder are a London-based alt-pop duo, consisting of Josephine Vander Gucht and Anthony West. Since releasing their DIY debut album, they have seen international success with their mellow, slow-grooving, R&B-flecked alt-pop tunes. Beginning in September 2014, Anthony and Josephine set out to write, record, and release one song a month for a year. All of the songs were released together as a self-titled debut album on September 4, 2015.\n\nSold out shows in London, Paris, Los Angeles, Amsterdam and New York a week after their debut album release marked the beginning of the band’s touring career.\n\n Read more on Last.fm. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.", 
            "genres": [
                "indie poptimism", 
                "pop"
            ], 
            "id": "5cIc3SBFuBLVxJz58W2tU9", 
            "image_filepath": "./artist/images/5cIc3SBFuBLVxJz58W2tU9.jpg", 
            "image_url": "https://i.scdn.co/image/08855f6f3b24efed3426583e06b33cc7fcf0f28d", 
            "name": "Oh Wonder"
        }, 
        {
            "bio": "The Shins are an American indie rock band centered around James Mercer.\n\nThe band formed in 1997, in Albuquerque, New Mexico, United States as a side project of Mercer (previously of Blue Roof Dinner) and drummer Jesse Sandoval, who were both members of Flake Music. The band's original lineup was Mercer (vocals, guitar), Sandoval (drums), Marty Crandall (keyboards) and Dave Hernandez (bass). Neil Langford replaced Hernandez in 1998. Hernandez returned to the band in 2003, as Langford had left the band in 2001. Hernandez remained in the band until 2009. Fruit Bats keyboardist Eric Johnson joined the band in 2006.\n\nTheir debut album, Oh, Inverted World was issued in 2001 and contained the singles \"New Slang\" and \"Caring is Creepy\", which were both featured in the 2004 film \"Garden State\". The band's next album, Chutes Too Narrow was released in 2003 and featured the single \"So Says I\".  The band's third album Wincing The Night Away, was released in 2007 and debuted at #2 on the Billboard 200 charts, the highest charting album in Sub Pop history until Arcade Fire's\"The Suburbs\" debuted at #1. After a short hiatus, Mercer announced in 2009 that the band was to record a new album and that Marty Crandall, and Jesse Sandoval were no longer members of The Shins. The band's new lineup included James Mercer, Eric Johnson, Modest Mouse drummer Joe Plummer and Grand Archives keyboardist Ron Lewis.\n\nBefore the release of Port of Morrow, the band lineup changed once more with only Mercer and Plummer remaining from the previously announced lineup. The newly added members were announced as guitarist Jessica Dobson, bassist Yuuki Matthews (formerly of Crystal Skulls) and keyboardist Richard Swift.\n\nThe Simple Song Songfacts reports that \"Simple Song.\" was the first single from the Port Of Morrow album, the band's debut release on James Mercer's Aural Apothecary record label. It was also the first offering to be heard from the band following the departure of Jesse Sandoval and Marty Crandall.\n\nThe current line-up for the live act is James Mercer (vocals, guitar), Jessica Dobson (guitar), Yuuki Matthews (bass), Richard Swift (keyboards) and Joe Plummer (drums). \n\n\n2017 - Fifth Album & World Tour\nThe band released their 5th studio album, \"Heartworms\" on March 10, 2017 on the Aural Apothecary/Columbia Records, together with a supporting world tour. \"Heartworms\" features Mercer's most diverse lyrical palette to date: From fictional character sketches ('Fantasy Island', 'Rubber Ballz'), autobiographical accounts ('Mildenhall'), to first single 'Name For You', a resounding call for female empowerment inspired by Mercer’s three daughters.\n\n\nMore information:\n *http://www.theshins.com\n *http://en.wikipedia.org/wiki/The_Shins Read more on Last.fm. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.", 
            "genres": [
                "albuquerque indie", 
                "alternative rock", 
                "chamber pop", 
                "folk christmas", 
                "folk-pop", 
                "garage rock", 
                "indie christmas", 
                "indie folk", 
                "indie pop", 
                "indie rock", 
                "indietronica", 
                "lo-fi", 
                "modern rock", 
                "neo-psychedelic", 
                "pop rock", 
                "stomp and holler"
            ], 
            "id": "4LG4Bs1Gadht7TCrMytQUO", 
            "image_filepath": "./artist/images/4LG4Bs1Gadht7TCrMytQUO.jpg", 
            "image_url": "https://i.scdn.co/image/e9e850f299d7715eb1b05e07d8af3bfc98b6f9c5", 
            "name": "The Shins"
        }, 
        {
            "bio": "Future is the name of at least three artists;\n\n1)  Nayvadius DeMun Wilburn, (born November 20, 1983), better known by his stage name Future, is an American rapper, singer, songwriter and record producer from the Kirkwood neighborhood of Atlanta, Georgia.\n\nAfter releasing a series of moderately successful mixtapes between 2010 and 2011, Future signed a major label deal with Epic Records and fellow American rapper Rocko's A1 Recordings, which helped launch his own label imprint Freebandz. Future subsequently began working on his debut studio album \"Pluto,\" and in April 2012 released the album to positive reviews. The album spawned five singles, all of which charted on the Billboard Hot 100. The album was later re-released in November, as \"Pluto 3D.\" His second studio album \"Honest,\" was released on April 22, 2014, and is also performing with his group Freeband Gang. He released his highly anticipated third studio album, \"DS2,\" on July 16, 2015. The Atlanta rapper also released several mixtape during 2015, \"Beast Mode\" in January, \"56 Nights\" in March, and \"What a Time to Be Alive (with Drake)\" in September. Future released \"Purple Reign\" in January 2016. The 13 track mixtape was executive produced by Metro Boomin and DJ Esco, with additional production from Southside, Zaytoven, and more.\n\n2) Future was a Dutch funk band active in the 1980s\n\n3) Future was an Italian singer, who won San Remo Junior in 1988 Read more on Last.fm. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.", 
            "genres": [
                "pop rap", 
                "rap", 
                "southern hip hop", 
                "trap music"
            ], 
            "id": "1RyvyyTE3xzB2ZywiAwp0i", 
            "image_filepath": "./artist/images/1RyvyyTE3xzB2ZywiAwp0i.jpg", 
            "image_url": "https://i.scdn.co/image/5edf0373e8df999d93a2d6bf198c6b7ba85c3f67", 
            "name": "Future"
        }, 
        {
            "bio": "Jeffery Williams, better known by his stage name Young Thug, and was briefly known as \"Jeffery\", is an American rapper from Atlanta, Georgia who is signed to Gucci Mane's 1017 Brick Squad Records, Asylum Records and Atlantic Records. Thug grew to prominence in 2013 after releasing his mixtape 1017 Thug to positive critical reception. He has collaborated with artists such as Gucci Mane, Young Scooter, Rich Homie Quan and Waka Flocka Flame.\n\nThug was born amongst the masses eliminating any doubt that he wouldn’t be special. The second youngest child of 11 children developed a skill for standing out amongst many, early. Young Thug moved to Jonesboro, an impoverished suburb of Georgia where his lifestyle was engrossed by the crime, drug addiction and violence that surrounded him. It was there that he developed an insatiable appetite to succeed his current situation. After discovering and acknowledging his talent and creativity for music in  2010, Thug started a new hustle that would soon mature as one of the most promising music careers in the South. \n\nEyeballing the throne of Hip hop royalty, Young Thug began to create a sound and style that would inevitably place him on top. Young Thug’s catchy verses and raw lyrical talent distinguished noise from art, clearly being the latter his creations are the best that remain of Southern hip hop. He is the embodiment of the evolution of Southern hip-hop. Young Thug is the representative for a generation that doesn't see hip-hop as a hobby but a lifestyle. Keeping true to himself, his art, and his home Young Thug will stand alone as the one true savior of the Southern movement.\n\n2. Young Thug aka The Demon Child is hardcore/horrorcore rapper/beatmaker from Central France. Often collaborated with Lil Prod. Also he made 2 albums under the alias Da Mystic Terror, in these 2 albums he changed his voice to make it sounds like it's an other person rapping.\nOfficial blogspots:\nhttp://demonchildproductions.blogspot.com/\nhttp://lilproddiscographie.blogspot.com/ Read more on Last.fm. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.", 
            "genres": [
                "dwn trap", 
                "gangster rap", 
                "pop rap", 
                "rap", 
                "trap music"
            ], 
            "id": "50co4Is1HCEo8bhOyUWKpn", 
            "image_filepath": "./artist/images/50co4Is1HCEo8bhOyUWKpn.jpg", 
            "image_url": "https://i.scdn.co/image/1eb847e76b0c8391cd9ec6dff07e93b86ec33d77", 
            "name": "Young Thug"
        }, 
        {
            "bio": "In Flames is a Swedish metal band from Gothenburg, formed in 1990. The band’s earlier work is considered to be a major influence on the melodic death metal music genre, although they have changed styles into a more nu-metal sound on more recent albums. Since the band’s conception in 1990, they have received numerous awards and released ten studio albums and one live DVD. The band has enjoyed increased popularity in recent years, both in its native Sweden and internationally. As of 2008, In Flames has sold over two million records worldwide. Read more on Last.fm. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.", 
            "genres": [
                "alternative metal", 
                "groove metal", 
                "melodic death metal", 
                "melodic metalcore", 
                "metal", 
                "metalcore", 
                "nu metal", 
                "rap metal", 
                "swedish metal"
            ], 
            "id": "57ylwQTnFnIhJh4nu4rxCs", 
            "image_filepath": "./artist/images/57ylwQTnFnIhJh4nu4rxCs.jpg", 
            "image_url": "https://i.scdn.co/image/f2dc8cb2e372425ede8467243f3952761835d578", 
            "name": "In Flames"
        }, 
        {
            "bio": "Five Finger Death Punch were formed in 2005 by guitarist Zoltan Bathory (formerly of U.P.O.). The American Capitalist Songfacts states that Bathory came up with the name after being amused by a scene involving a five finger punch in Kill Bill 2.  Other members recruited to the band include former Motograter & Ghost Machine vocalist Ivan Moody, former W.A.S.P. members guitarist Darrell Roberts and drummer Jeremy Spencer, and former Anubis Rising/Deadsett bassist Matt Snell.\n\nThe band recorded their debut album The Way of the Fist in 2006 with Stevo \"Shotgun\" Bruno (Mötley Crüe, Prong) and Mike Sarkisyan (Spineshank). The record was mixed and mastered by former Machine Head/Soulfly guitarist Logan Mader.\nAfter making waves in the underground metal scene, in early June it was announced that the band had inked a deal with Firm Music, which is a branch of \"The Firm\", a highly successful management company (Korn, Staind, Limp Bizkit). Their debut album \"The Way Of The Fist\" was released on July 31, 2007 The record broke into the Billboard 200 on its first week of release, and hit the #1 position on Billboard's New Artist/Heetseekers chart. Their First single, \"The Bleeding\" landed in the top 40 rock radio charts, eventually worked its way into the top 10 and ruled the radio waves for an astonishing 8 months. In times when US Rock Radio is anything but friendly toward heavier bands, against all odds 5FDP not just repeated but surpassed their first single's success with their follow up \"Never Enough\". The song climbed even faster to set up a seemingly permanent camp in the top 10, until the 3rd single \"Stranger Than Fiction\" showed up on the horizon to take over the guard post.\nSupporting their release, for 19 consecutive months Five Finger Death Punch has relentlessly toured North America, eventually establishing themselves as a true headlining act and selling almost 300,000 records in the USA before branching out to the rest of the world. The international release of \"The Way Of The Fist\" (via Spinefarm/Universal) is scheduled to hit stores across the world in January 2009.\nRecently, it was announced that guitarist Darrel Roberts left the band and will be replaced by Jason Hook\nFive Finger Death Punch released \"Under and Over It\" as the first single from their third studio album, American Capitalist on July 27, 2011. (Under and Over It Songfacts).\n\nLos Angeles, California\n2005  Read more on Last.fm. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.", 
            "genres": [
                "alternative metal", 
                "groove metal", 
                "nu metal", 
                "post-grunge"
            ], 
            "id": "5t28BP42x2axFnqOOMg3CM", 
            "image_filepath": "./artist/images/5t28BP42x2axFnqOOMg3CM.jpg", 
            "image_url": "https://i.scdn.co/image/8d2f81743d2f506f8eba5fe3beacb5a415ee36b8", 
            "name": "Five Finger Death Punch"
        }, 
        {
            "bio": "There are at least five artists with this name: \n\n(1) John Towner Williams (film score composer)\n(2) John Christopher Williams (classical guitarist)\n(3) John Williams (Irish musician)\n(4) John Williams (blues/jazz guitarist)\n(5) John Knowles Williams (experimental/indie)\n---------------------------------------------\n\n(1) John Towner Williams (born February 8, 1932) is one of the most widely recognized composers of film scores. As of 2017, he has received 50 music-related Academy Award nominations, an accomplishment surpassed by none.\n\nEarly scores and compositions are credited as Johnny Williams.\n\nWilliams is best known for heroic, rousing themes in adventure and fantasy films. This includes some of the highest grossing films of all time, such as the Star Wars movies, the Superman movies, Jaws, E.T. the Extra-Terrestrial, Raiders of the Lost Ark, Jurassic Park, and the first three Harry Potter movies. His richly thematic and highly popular 1977 score to the first Star Wars film was selected by the American Film Institute as the greatest American movie score of all time. Five of his film scores won Oscars.\n\nHis long career has also included many sensitive dramatic scores (such as Schindler's List, Saving Private Ryan, and Munich) and quirky character studies (like Catch Me If You Can, the theme for which makes extensive use of jazz, perhaps in homage to Mancini's famous music for The Pink Panther). Also noteworthy are his recent collaborations with Yo-Yo Ma and Itzhak Perlman on the score for Memoirs of a Geisha, as well as Williams' other more experimental concert works.\n\nWilliams has composed the scores for every Steven Spielberg movie, with the exception of The Color Purple (scored by co-producer Quincy Jones) and Duel (Spielberg's first feature film).\n\nWhile skilled in a variety of twentieth-century compositional idioms, his most familiar style may be described as a form of neo-romanticism, influenced by his predecessors and their use of large-scale orchestral music. Korngold (and other Hollywood Golden Age composers), is clearly evident in many of Williams' most famous works.\n\nAnyone who has watched the Olympics on television has heard Williams' \"Olympic Fanfare and Theme,\" parts of which (especially the last fifteen seconds of the fanfare) receive extensive playtime every four years.\n\nWilliams also composed \"The Mission,\" the worldwide-known theme from NBC News.\n\n---------------------------------------------\n(2) John Christopher Williams is a classical guitar player.\n\nBorn in Melbourne, Australia, on 24 April 1941, to an English father (Len Williams) and an Australian-Chinese mother, Williams was taught initially by his father. At the age of twelve he went to Italy to study under \"The Maestro,\" Andrés Segovia. Later, he attended the Royal College of Music in London, studying piano because the school did not have a guitar department at the time. Upon graduation, he was offered the opportunity to create such a department. He seized the opportunity and ran it for the first two years. Williams has maintained links with the College (and with the Northern College in Manchester) ever since.\n\nWilliams is best known as a classical guitarist, but has explored many different musical traditions. He has collaborated with Julian Bream and Paco Peña and was a member of the fusion group Sky. He is also a composer and arranger.\n\nWilliams has commissioned guitar concertos from composers such as Stephen Dodgson, André Previn, Patrick Gowers, Richard Harvey, and Steve Gray. He has also worked with composers from his native Australia, including Phillip Houghton, Peter Sculthorpe, Ross Edwards (composer), and Nigel Westlake, to produce guitar works that capture the spirit of his homeland.\n\nHe enjoyed a worldwide hit single with his recording of Cavatina by Stanley Myers, used as the theme tune to the Oscar-winning film The Deer Hunter (1979). The piece had originally been written for piano, for another film ten years earlier, The Walking Stick (1970) but re-written for guitar and expanded by Myers at Williams' invitation. In 1973, Cleo Laine wrote lyrics and recorded the song \"He Was Beautiful\" accompanied by John Williams. A year later, it was a top-five UK hit single for Iris Williams (no relation).\n\nAt the invitation of producer Martin Lewis he created a highly acclaimed classical-rock fusion duet with celebrated rock guitarist Pete Townshend of Townshend's anthemic \"Won't Get Fooled Again\" for the 1979 Amnesty International benefit show The Secret Policeman's Ball. The duet was featured on the resulting album and the film version of the show – bringing Williams to the broader attention of the rock audience.\n\nThe relationship with Lewis led to Williams' classical-rock fusion band Sky being invited to give the first-ever rock concert to be held at Westminster Abbey – a benefit concert for Amnesty that Lewis produced in February 1981.\n\nHe is visiting professor at the Royal Academy of Music, London.\n\nWilliams and his artist wife Kathy Panama reside in London and Australia.\n\n---------------------------------------------\n(3) John Williams\n\nJohn Williams is internationally regarded as one of the foremost players of Irish music today. With five All-Ireland titles to his credit, John is the only American-born competitor ever to win first place in the \"senior concertina\" category. His additional talents on flute, button accordion, bodhran, and piano distinguish him as a much sought after multi-instrumentalist in the acoustic scene around the world.\n\nBorn and raised on the Southwest Side of Chicago, John spent his summers during college on the Southwest coast of Ireland in his father’s village of Doolin, Co. Clare. Like Chicago, Doolin became a major musical crossroads for John and countless other local and international musicians to meet and exchange music. Gigging every night in the pubs of Doolin and Lisdoonvarna soon led to performances in Galway, Cork, Dublin, Belfast, Paris, Britanny, Zurich, and New York City (bio http://www.johnwilliamsmusic.com/bio.htm).\n\n---------------------------------------------\n(4) John Williams\n\nA blues/jazz guitarist in Seattle, Washington, whose music is available at Magnatune.com (bio http://magnatune.com/artists/john_williams).\n\n---------------------------------------------\n(5) John Knowles Williams\n\nAn experimental/indie musician. Music is available at sweetnuthin.letsneverdie.net/Music/My_Recordings/ or www.myspace.com/JohnKWilliams. Read more on Last.fm. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.", 
            "genres": [
                "soundtrack"
            ], 
            "id": "3dRfiJ2650SZu6GbydcHNb", 
            "image_filepath": "./artist/images/3dRfiJ2650SZu6GbydcHNb.jpg", 
            "image_url": "https://i.scdn.co/image/bde64350466df4aa41efb9b8b766deef6c46fd08", 
            "name": "John Williams"
        }, 
        {
            "bio": "The Boston Pops Orchestra was founded in 1885 as a subsection of the Boston Symphony Orchestra (BSO), founded four years earlier. Careful examination of the rosters of “Pops\" or “Festival\" orchestras, which are associated with a co-resident symphony orchestra in the same community, shows that the principal players of a “Pops\" ensemble usually hold the post of assistant or associate principal of the “parent\" ensemble. In general parlance, the Boston Pops is described as: “The Boston Symphony minus the first-chair players.\" This “elite core” of BSO musicians constitute a separate subsection of the BSO, and perform alongside the Pops as the Boston Symphony Chamber Players, a 12-member ensemble founded in 1964. These arrangements, and a similar one with the Tanglewood Festival provide year-round employment for the musicians.\n\nOther cities have founded their own \"pops\" orchestras, but the Boston Pops remains the most famous and well-known.\n\nHistory of the Pops\n\nIn 1881, Henry Lee Higginson, the founder of the Boston Symphony Orchestra, wrote of his wish to present in Boston \"concerts of a lighter kind of music.\" The Boston Pops Orchestra was founded to present this kind of music to the public, with the first concert performed in 1885. Called the \"Promenade Concerts\" until 1900, these performances combined light classical music, tunes from the current hits of the musical theater, and an occasional novelty number. Allowing for some changes of taste over the course of a century, the early programs were remarkably similar to the Boston Pops programs of today.\n\nThe Boston Pops Orchestra did not adopt its own official conductor until 1930, when Arthur Fiedler began a fifty-year tenure as the Pops conductor. Fiedler's career as the conductor of the Pops brought worldwide acclaim to the orchestra. He was unhappy with the reputation of classical music as being solely for elite, aristocratic, upper-class audiences. Fiedler made efforts to bring classical music to wider audiences. He instituted a series of free concerts at the Hatch Shell on the Esplanade, a riverside public park along the Charles River. Along with his insistence that the Pops Orchestra would play popular music alongside well-known classical pieces, Fiedler opened up a new niche in popular culture that encouraged popularization of classical music. Under his direction, the Boston Pops allegedly made more commercially available recordings than any other orchestra in the world, with total sales of albums, singles, tapes, and cassettes exceeding $50 million. Of the many musical pieces produced over the years, the Pops' most famous and popular work is Fiedler's production of Leroy Anderson's composition \"Sleigh Ride\".\n\nFiedler's respectful easy-listening arrangements on Arthur Fiedler and the Boston Pops Play the Beatles, released in 1971, opened many eyes to the musical qualities of Lennon and McCartney.\n\nFiedler is most widely remembered in Boston for having begun the annual tradition of the Fourth of July Pops concert and fireworks display on the Esplanade, one of the best-attended Independence Day celebrations in the country with regular estimated attendance of 200,000–500,000 people. (This event is organized by Boston's Fourth of July celebration under the leadership of David Mugar.) Also during Fiedler's tenure, the Pops and local public television station WGBH developed a series of weekly televised broadcasts recorded during the Pops' regular season in Symphony Hall, Evening at Pops.\n\nAfter Fiedler's death in 1979, the conductorship of the Boston Pops was taken over by Academy Award-winning composer John Williams in 1980. Williams continued the Pops' tradition of bringing classical music to a wider audiences, initiating the annual \"Pops-on-the-Heights\" concerts at Boston College and adding his own considerable library of well-known movie soundtracks (including the Star Wars and Indiana Jones movies) to its repertoire.\n\nKeith Lockhart assumed the post of principal Pops conductor in 1995. Lockhart continues to conduct the Boston Pops today, adding a touch of flamboyance and a flair for the dramatic to his performances. Williams remains the Laureate Conductor of the Pops and conducts a week of Pops concerts most years. Lockhart brought in numerous pop-music acts to play with the orchestra, including Rockapella, Guster, My Morning Jacket, Aimee Mann and Elvis Costello. Read more on Last.fm. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.", 
            "genres": [
                "easy listening", 
                "soundtrack"
            ], 
            "id": "7CIcEIOiWaZcEH35cpsdZq", 
            "image_filepath": "./artist/images/7CIcEIOiWaZcEH35cpsdZq.jpg", 
            "image_url": "https://i.scdn.co/image/696b6875207ef9dcb1325aa6c284047ea380b887", 
            "name": "Boston Pops Orchestra"
        }, 
        {
            "bio": "Rhiannon Giddens is a singer, voice coach, multi-instrumentalist, dance caller, graphic artist. . . in short a talented performer of great versatility. She is equally at home crooning torch songs in a smoky bar, accompanying herself on banjo, or singing opera in a sumptuous production. She has performed music from Native American Powwows, Appalachian ballads, and hip-hop, all to great acclaim. Rhiannon performs with Sankola Strings the Carolina Chocolate Drops and others. Read more on Last.fm. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.", 
            "genres": [
                "folk", 
                "new americana", 
                "progressive bluegrass"
            ], 
            "id": "1EI0NtLHoh9KBziYCeN1vM", 
            "image_filepath": "./artist/images/1EI0NtLHoh9KBziYCeN1vM.jpg", 
            "image_url": "https://i.scdn.co/image/56d6c5fe49a4a8561ae93738675780c930ac9d50", 
            "name": "Rhiannon Giddens"
        }
    ]
}