{
    "artists": [
        {
            "bio": "Weezer is an American rock band. Formed in 1992, they have released eight full length albums, six EPs, and a DVD. Their latest album, titled 'Weezer (White Album)', came out on April 1st, 2016. They've sold over nine million records in the United States to date. Playing music influenced by alternative bands and power pop artists among others, they're sometimes viewed as a part of the 90s indie movement.\n\nWeezer started in Los Angeles, California when Rivers Cuomo joined with Patrick Wilson, Matt Sharp, and Jason Cropper, who was later replaced by Brian Bell. Five weeks after forming, they had their first gig, opening for Dogstar at Raji's Bar and Ribshack on Hollywood Boulevard. Weezer began playing clubs to small audiences around L.A. and recording homemade demos. The group soon received attention from various A&R reps, and the guys were signed on June 26, 1993 by Todd Sullivan, an A&R rep from Geffen Records. The band became a part of the DGC label (which later turned into Interscope).\n\nCreating \"The Blue Album\" (1993-1994)\n\nThe self-titled debut, 'Weezer', commonly referred to as 'The Blue Album', came out on May 10, 1994. It picked up considerable acclaim. Tracks \"Undone (The Sweater Song)\" (also known as \"Undone - The Sweater Song\"), \"Buddy Holly\", and \"Say It Ain't So” were released as singles. The album was produced by former The Cars frontman Ric Ocasek. During the recording of the Blue Album, Jason Cropper left the band to take care of his future wife, who was pregnant with their first child. Jason was replaced by Brian Bell, a then bassist from a band called Carnival Art.\n\nThe first single, \"Undone - The Sweater Song\", garnered attention given that Spike Jonze directed the music video for the track. In a single, unbroken take, that video featured Weezer performing the song on a sound stage with various amusing studio antics, including a pack of dogs swarming the set. Jonze also later directed the band's second video, which was made for the single \"Buddy Holly\".\n\nNamed after the famous 50s rock star, the \"Buddy Holly\" music video featured footage of the television sitcom Happy Days spliced with the band performing in a remade \"Arnold's Diner\", a setting from the series. The video had heavy rotation on MTV. It went on to win Jonze and the band four MTV Video Music Awards (including Breakthrough Video and Best Alternative Music Video) and two Billboard Music Video Awards. This video was also included as a bonus on the Microsoft Windows 95 CD. The success of the video arguably served as the key for pushing the band into the mainstream rock spotlight.\n\nThe video for Weezer's third single, \"Say It Ain't So\", was directed by Sophie Muller. It featured the bandmates playing hacky-sack and performing in the band's original rehearsal space in California. A photo of what the band calls the \"Garage\" is featured on the inside cover of the album.\n\n'The Blue Album' is currently certified three times platinum, making it Weezer's all-time best seller and one of the most popular rock albums of the early 90s. It was re-released and repackaged in 2004 as a \"Deluxe Edition\". That version of the album included a second disc of B-sides along with other previously unreleased rarities.\n\nKiller Record: Pinkerton(1995-1997)\n\nIn late December 1994, Weezer took a break from touring for the Christmas holidays. Cuomo traveled back east to his home state of Connecticut. Using an eight-track recorder, he began piecing together demo material for Weezer's next album. Cuomo's original concept for Weezer's sophomore effort was to be a space-themed rock opera, with him mulling over the title 'Songs from the Black Hole'.\n\nThe album was intended to feature songs that flowed together seamlessly, and it was planned to end with a special coda that briefly revisited the major musical elements of the piece (something reminiscent of progressive rock works from the 70s). The band began demoing and working on Cuomo's concept through intermittent recording sessions in the spring and summer of 1995. Ultimately, the 'Songs from the Black Hole' album concept was dropped. The album that actually came out would instead feature some old tunes made from before their first album (which had briefly been incorporated into the space-opera) as well as some new ones written while Cuomo was at Harvard.\n\nAfter the multi-platinum success of their debut album, Weezer's sophomore album was finally released on September 24, 1996. Titled 'Pinkerton', the work peaked at #19 in the U.S. upon its release. It didn't sell as many copies as its predecessor, probably due to its darker, more abrasive nature. Pinkerton was labeled \"one of the worst albums of 1996\" by a Rolling Stone reader poll. Eventually, the album grew into a cult classic, and is viewed by some fans as Weezer's greatest album. In fact, in 2004, the magazine changed their rating to a 5-star rating and inducted it into The Rolling Stone Hall Of Fame. This article can be found in the Reviews sections of the 500 Greatest Songs Of All Time issue.\n\nThree singles were taken from the album: \"El Scorcho\", \"The Good Life\" and \"Pink Triangle\". The video for \"El Scorcho\" featured the band inside a darkened room, sitting in a circle, that would be lit differently throughout parts of the song; it was directed by Mark Romanek. The video for \"The Good Life\" was directed by the team of Jonathan Dayton and Valerie Faris (though no known video was made for \"Pink Triangle\"). However, the singles did not receive as much airtime as the singles from their debut album.\n\nThe title of the album comes from the character Lieutenant Pinkerton in Giacomo Puccini's opera Madame Butterfly. The entire album is heavily influenced by the opera's story line. Madame Butterfly is mentioned under her real name, Cio-Cio San, in \"El Scorcho.\" The song \"Butterfly\" is written from Pinkerton's point of view at the end of the opera.\n\nThe album's title was the source of a legal challenge. Pinkerton Securities of Encino, Calif., filed a temporary restraining order against the band and its Geffen record label for copyright infringement two days before the album was to be released on September 24, 1996. A judge ruled against the security company and the album was finally released.\n\nWeezer completed their touring for Pinkerton in the summer of 1997. The members of the band took a break, with drummer Patrick Wilson returning to his home in Portland, Oregon to work on his side project, The Special Goodness, Matt Sharp left to complete the follow-up album for his group The Rentals, and Brian Bell went to work on his group, Space Twins.\n\nRivers Cuomo returned to Boston, Massachusetts, but dropped out of Harvard to focus on songwriting. He eventually went into seclusion. He painted his walls black, disconnected his phone, and didn't communicate with anyone. Later, he formed a solo group, The Rivers Cuomo Band. Cuomo used the group to try out unreleased material, including possible new songs for the next Weezer album. The band played their first show at T.T. the Bear's on October 8, 1997. Future Weezer bassist Mikey Welsh was part of the solo band's lineup. The Boston songs were later abandoned and not used on the next Weezer album, but live recordings of the Boston shows are openly traded on the internet. In February of 1998, Rivers left Boston and Harvard academia behind and returned to Los Angeles.\n\nPat Wilson and Brian Bell joined Cuomo in L.A. to start work on the next album. Matt Sharp did not rejoin the band and officially left the group in April of 1998. The group decided on Mikey Welsh as Sharp's replacement. Weezer continued rehearsal and cut demos until the fall of 1998. Frustration and creative disagreements led to a decline in rehearsals, and in late fall of 1998, drummer Pat Wilson left for his home in Portland pending renewed productivity from Cuomo.\n\nThe band would not reunite until April of 2000, when the Fuji Festival in Japan offered Weezer a high-paying gig to play in August 2000. The festival served as a catalyst for Weezer's productivity, and from April to May, 2000, the band rehearsed and demoed new songs in Los Angeles. The band returned to live shows in June 2000, but without the Weezer name. Instead the shows featured the group's first use of the pseudonym Goat Punishment.\n\nOn June 23, 2000, the band, now back under the Weezer name, joined the Warped Tour for eight planned dates. Weezer was received well at the festival, leading the band to book more tour dates for the summer.\n\nSS2K - The Summer Sessions (2000)\n\nIn the summer of 2000, Weezer (now consisting of Rivers Cuomo, Mikey Welsh, Pat Wilson, and Brian Bell) went on tour. Weezer's setlist consisted of 14 new songs that fans have labeled the Summer Songs of 2000 (commonly abbreviated, SS2K). When 13 of these songs did not appear on Weezer's next album, fans of the songs started a petition demanding the release of studio demos. Eventually, mp3s were made available on the band's official website for download. Three SS2K songs, \"Hash Pipe\", \"Dope Nose\" and \"Slob,\" have appeared on studio albums (\"Hash Pipe\" on the Green Album and \"Dope Nose\" and \"Slob\" appearing on Maladroit).\n\nGreen Album & Maladroit (2001-2003)\n\nEventually, the band went back into the studio to produce a third album. Weezer (2001) chose to repeat the self-titled name of their first release. This album quickly became known as The Green Album due to its distinctive bright green coloring. Shortly after the release of The Green Album, Weezer went on another American tour. They attracted a new generation of fans thanks to heavy MTV rotation for the videos of their hit singles \"Hash Pipe\" and \"Island in the Sun.\"\n\nThe video for \"Hash Pipe,\" directed by Marcos Siega featured sumo wrestlers and was nominated for Best Rock Video at the 2001 MTV Video Music Awards, but lost out to Limp Bizkit's \"Rollin.\" Two videos were recorded for \"Island in the Sun.\" Marcos Siega directed the first, which focused on a Mexican wedding, and Spike Jonze directed the second, which involved Weezer with animals in a wildlife reserve. Their video for \"Photograph\" was shot and put together by Weezer friend and unofficial \"5th member\" Karl Koch.\n\nAs reported on August 16th, 2001, by MTV, bassist Mikey Welsh was checked into a psychiatric hospital. His whereabouts were previously unknown, as he mysteriously went missing before their second filming of the \"Island in the Sun\" music video, featuring the band with various animals. Weezer was prompted to find a temporary replacement for Welsh. Through a mutual friend, Cuomo received Scott Shriner's number and asked if he was interested to fill in for Welsh. Shriner, at first believing it was a prank phone call, accepted.\n\nMuch to the ire of their recording label, Weezer decided to forgo the industry-preferred waiting period of 2 to 3 years between albums and began recording demos for their fourth album. The band took an experimental approach for the recording process by allowing fans to download the demos from their official website in return for feedback. After the release of the album, the band subsequently stated that the process was somewhat of a failure, as the fans did not supply them with cohesive constructive advice. Only the song \"Slob\" was included on the album due to general fan advice.\n\nThe fourth album, Maladroit, was released in 2002 with Scott Shriner replacing Mikey Welsh on the bass. The album served as a harder-edged version of their trademark catchy pop-influenced music. Although met with generally positive critical reviews (including making many \"Best of '02\" lists), its sales were not as strong as The Green Album and remains their worst-selling album to date.\n\nTwo singles were released from the album. The \"Dope Nose\" music video featured a Japanese motorcycle gang, and was put into regular rotation. The music video for \"Keep Fishin'\" combined Weezer with The Muppets, and had heavy rotation on MTV. Both videos were directed by Marcos Siega.\n\nAs soon as Maladroit had wrapped up, the band immediately began work on their fifth album, recording numerous demos between tours for Maladroit (often recording as many as 24 songs in a day). These songs were eventually scrapped, and Weezer took a break after the release of two albums in quick succession.\n\nMake Believe (2003-2005)\n\nIn March of 2004, Weezer released their first DVD. Titled Video Capture Device, the DVD contains all of their then-current music videos. It also included live concerts and homemade movies. The DVD was certified \"gold\" on November 8, 2004.\n\nFrom December 2003 to the summer and early fall of 2004, the members of Weezer recorded a large amount of material intended for a new album to be released in the spring of 2005 with producer Rick Rubin. The band's early recording efforts became available to the public through the band's website. The demos, entitled the Album Five Demos (or album 4.5), were a big hit with fans but only one song, \"Hold Me\", would be included on the finished album. That album, entitled Make Believe, was released on May 10, 2005. The album was very well received by the public. However, long-time Weezer fans often consider it as a decline from their earlier albums, and has received mixed reviews.\n\nThe album's first single, \"Beverly Hills,\" became a hit in the U.S. and worldwide, staying on the charts for several months after its release. The video for \"Beverly Hills\", directed by Marcos Siega, featured the band and a select choice of fans interacting with Playboy Bunnies and Hugh Hefner at the Playboy Mansion. It became the first Weezer song to hit #1 on the Billboard Modern Rock chart. The song was nominated for Best Rock Song at the 48th Annual Grammy Awards, the first ever Grammy nomination for the band. The video for the song was also nominated for Best Rock Video at the 2005 MTV Video Music Awards.\n\nDuring the \"Make Believe\" tour of 2005, Cuomo allowed other members of the band to step into the spotlight of certain songs:\n\n    * Brian Bell: \"Getchoo\" and \"Why Bother?\" (from Pinkerton), \"Smile\" (from \"The Green Album\"), and \"Keep Fishin'\" (from Maladroit)\n    * Scott Shriner: \"Fall Together\", and \"Dope Nose\", and \"In the Garage\" (from \"The Blue Album\")\n    * Patrick Wilson: \"Photograph\" (from \"The Green Album\"), \"Song 2\" (Blur cover, whilst playing lead guitar)\n\nIn late August 2005, Weezer performed with the rock band The Pixies, which was one of Rivers' influences, at Summerfest and other dates.\n\nFrom September 8 to October 28, 2005, Weezer set out on a tour with the Foo Fighters, which, to many, was simply called Foozer. The Foozer tour was awarded \"Most Creative Tour Package\" at The 17th Annual Concert Industry Awards.\n\nOn December 13th, 2005, Winter Weezerland EP was released on iTunes. The EP was essentially a re-release of the 2000 Weezer christmas CD which featured \"The Christmas Song\" and \"Christmas Celebration\".\n\nAlso, in late 2005 the band released the second single off Make Believe, called \"We Are All on Drugs\" (for family-oriented purposes, some releases of the song were renamed \"We Are All in Love\"), and the music video was directed by Justin Francis. It didn't do well as a single, and many weezer fans hated it.\n\nIn early 2006, it was announced that Make Believe was certified platinum, and \"Beverly Hills\" was the second most popular download on iTunes for 2005.\n\nAlso in early 2006, Make Believe's third single, \"Perfect Situation\", spent four weeks in a row at the #1 spot on the Billboard Modern Rock chart, a personal record for Weezer. The Perfect Situation video starred Elisha Cuthbert and was directed by Marc Webb. The only other Weezer track to hit #1 was \"Beverly Hills,\" for one week. \"This is Such a Pity\" is the band's fourth single from the album, but no music video was made for its release.\n\nAs of January, 2006, Bell and Wilson are set to portray Velvet Underground members Lou Reed and John Cale in Factory Girl, an upcoming film about the life of Andy Warhol cohort Edie Sedgwick.\n\nRivers Cuomo announced a new song called \"Piece of the Pie\" while onstage during the band's October 7th, 2005 show in Detroit (but did not perform it). Cuomo has mentioned other song ideas recently, dropping titles and ideas such as \"East Coast or West Coast,\" \"Pig\" and new songs with lyrics he described as \"bloggy\".\n\nRivers has commented on his myspace blog that his recent comments to mtv.com were 'misquoted' and said that what he meant \"was that the soccer song, \"Our Time will Come\", certainly won't be on a Weezer album.\" and said \"The rest of the songs, though, are definite contenders for a Weezer record.\" A strong hint that the band are in fact only on a break and that a sixth album is on the card.\n\nIn late 2006, Brian Bell began work on a new project called The Relationship which fans can follow on the band's myspace page. Pat Wilson told Keifer Wells and Martin Michalek in a radio interview for Andover High School that he and Scott Shriner had been creating songs together and are trying to get Rivers to sing for when the band has jam sessions. Pat has also been creating a few Special Goodness songs, but said little more on the subject. Fans can currently follow the news of the band at Rivers Cuomo's myspace page and the official Weezer website.\n\nWeezer's sixth studio album will be released on June 3, 2008, just over three years after their latest release, Make Believe. Rick Rubin produced the album[30] and Rich Costey provided the mixing[31] for what Weezer fans are calling \"Album Six\".[32] The record is being described as \"experimental\", and according to Cuomo, includes longer and non-traditional songs, TR-808 drum machines, synthesizers, Southern rap, baroque counterpoint, and band members other than Cuomo writing, singing, and switching instruments.[33]\n\nLead singer Rivers Cuomo released a demo-compilation album entitled Alone: The Home Recordings of Rivers Cuomo on December 18, 2007. The album contains demos of Cuomo's that span from 1992 to 2007, including songs from Weezer's abandoned second album, Songs from the Black Hole. Also included in Alone is a song intended for Weezer's upcoming 6th studio album, entitled \"This is the Way\". The booklet of Alone tells of the band wanting the song for the album, but ultimately choosing \"an epic, 6-minute, symphonic type of art song\" entitled \"Daydreamer\" instead.\n\nWeezer's \"Weezer\" (also referred to as \"The Red Album\") was released in June 2008. Rick Rubin produced the album and Rich Costey mixed it. The record is being described as \"experimental\", and according to Cuomo, includes longer and non-traditional songs, TR-808 drum machines, synthesizers, Southern rap, baroque counterpoint, and band members other than Cuomo writing, singing, and switching instruments. Pat Wilson said that the album cost about a million dollars to make, contrasting it with the $150,000 budget of \"The Blue Album\". The album's singles were produced by Jacknife Lee. Its lead single, \"Pork and Beans\", topped the Billboard Modern Rock Tracks charts for 11 weeks, and its music video won a Grammy for Best Short Form Music Video. The album's second single, \"Troublemaker\", debuted at #39 on the Billboard Hot Modern Rock Tracks chart and peaked at #2. In October 2008, the group announced that the third single would be \"The Greatest Man That Ever Lived (Variations on a Shaker Hymn)\".\n\nIn 2009, the band announced their next album, \"Raditude\", would be released on November 3, 2009, where it debuted as the seventh best-selling album of the week on the Billboard 200 chart. The band scheduled tour dates in December 2009 extending into early 2010 to coincide with the new album's release. On December 6, 2009, Weezer frontman Rivers Cuomo was injured when his tour bus crashed in upstate New York due to black ice. Cuomo suffered three broken ribs, and his assistant broke two ribs. His wife, baby daughter, and their nanny were also on the bus; however, they escaped injury. Weezer cancelled tour dates the following day. The band resumed touring on January 20, 2010.\n\nIn December 2009, it was revealed that the band was no longer with Geffen Records. The band stated that they would still release new material, but they are unsure of the means, whether it be self-released, released online, or getting signed by another label. Eventually, the band was signed to the independent label Epitaph.\n\nThe album \"Hurley\" was released in September 2010 through Epitaph Records. The name comes from the character Hugo \"Hurley\" Reyes from the television show \"Lost\". Jorge Garcia, the actor who portrayed Hurley, stated that being featured on the album cover is \"one of the biggest honors of [his] career.\" Weezer used internet streaming service YouTube as a way to promote the album. Weezer loaned itself to 15 amateur online video producers, \"going along with whatever plans the creator could execute in about 30 minutes.\" They have used many of the popular channels to promote themselves, such as Barely Political, Ray William Johnson and Fred Figglehorn. The Gregory Brothers solicited musical and vocal contributions from the band on one of its compositions built around speeches by Rep. Charles Rangel and President Barack Obama. Weezer calls the promotion \"The YouTube Invasion\"\n\nOn November 2, 2010, Weezer released another studio album called \"Death to False Metal\". This album was composed of newly re-recorded versions of unused recordings spanning the band's career.\n\nOn October 9, 2011, the band announced on their website that former bassist Mikey Welsh had died.\n\nEverything Will Be Alright in the End and the White Album (2014–2016)\nIn January 2014, the band started to record its ninth studio album with producer Ric Ocasek, who previously worked with the band on its first two self-titled albums. A clip of a new song was posted on the band's official YouTube account on March 19, 2014, which confirmed previous rumors of the band being in the studio. On June 12, 2014, it was revealed that the album title would be Everything Will Be Alright in the End. It was released on October 7, 2014 to generally favorable reviews, becoming the band's best-reviewed release since Pinkerton.\n\nOn October 26, 2015, the band released a new single, \"Thank God for Girls\", through Apple Music and to radio the same day. The following week, the band released a second single, \"Do You Wanna Get High?\". Cuomo claimed in an interview with Zane Lowe, that the band was not working on a new album. Later, on January 14, 2016, Weezer released a third single, \"King of the World\", and announced that the band's fourth self-titled album, also known as the White Album, which continued the critical success of the band's previous release. In support of the album, the band performed on the Weezer & Panic! at the Disco Summer Tour 2016 with Panic! at the Disco in 2016. The band later signed to Atlantic Records as part of a joint venture between Warner Music Group and Crush Management.\n\nPacific Daydream (2017–present)\nSoon after the release of the White Album, Cuomo discussed plans for Weezer's next album, provisionally titled the Black Album: \"It’s going to maybe be like Beach Boys gone bad [...] I’m thinking of swearing, which is something I’ve never done in songs.” Cuomo also said the album would tackle “more mature topics” and be “less summer day and more winter night”. He suggested the band could return to the recording studio as soon as October 2016. Weezer delayed recording after Cuomo felt his new material was more \"like reveries from a beach at the end of the world [... as if] the Beach Boys and the Clash fell in love by the ocean and had one hell of an amazing baby\".\n\nOn March 16, 2017, the band released a new song titled \"Feels Like Summer\", later revealed to be the lead single of an upcoming album. The song drew a mixed reaction from fans but became their biggest hit on Alternative radio in a decade. \"Feels Like Summer\" was heard on The Weather Channel's local forecast segments on July 4, 2017, and again on August 18, 2017. It was also heard on some of the network's promos that summer. \n\nOn August 16, the band revealed the album title, Pacific Daydream, and scheduled for October 27. The next day, the a promotional single from the album, \"Mexican Fender\", was released. The following months, \"Beach Boys\" was released, and the month after, they released \"Weekend Woman\" to positive reception.\n\nThe band currently consists of the following members:\n\n    * Brian Bell — guitar, backing vocals\n    * Rivers Cuomo — vocals, guitar\n    * Scott Shriner — bass guitar, backing vocals (2002-present) (plays on Maladroit and Make Believe)\n    * Patrick Wilson — drums\n\nFormer members:\n\n    * Jason Cropper — Guitar, left the band in September 1993 (believed to have been fired by Cuomo, although it is not clear as Cropper is forbidden from discussing the issue)\n    * Matt Sharp — bass guitar, backing vocals (1992-1997) (plays on The Blue Album and Pinkerton)\n    * Mikey Welsh — bass guitar, backing vocals (1998-2001) (plays on The Green Album) Read more on Last.fm. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.", 
            "genres": [
                "alternative metal", 
                "alternative rock", 
                "garage rock", 
                "indie christmas", 
                "indie pop", 
                "indie rock", 
                "modern rock", 
                "permanent wave", 
                "pop christmas", 
                "pop punk", 
                "pop rock", 
                "post-grunge", 
                "punk christmas", 
                "rock"
            ], 
            "id": "3jOstUTkEu2JkjvRdBA5Gu", 
            "image_filepath": "./artist/images/3jOstUTkEu2JkjvRdBA5Gu.jpg", 
            "image_url": "https://i.scdn.co/image/2d9c08427ea2ffd4ae8a16ad5f0c39fd4d91c0be", 
            "name": "Weezer"
        }, 
        {
            "bio": "Courtney Barnett is an Australian singer/songwriter originally from Sydney, New South Wales; later moving to Hobart where she began performing music in 2006 before relocating to Melbourne in 2010.\n\nCourtney puts a lot of effort into sounding effortless. Her songs are wild and wooly and wordy, her lyrics plainspoken and delivered like she’s making them up on the spot. \n\nCourt’s debut album, Sometimes I Sit and Think, and Sometimes I Just Sit (2015), is out now! And can be ordered here on official site: www.courtneybarnett.com.au.\n\nBarnett was originally a part of several bands, including Immigrant Union and The Olivettes before focusing on her solo work. In 2012, Courtney started her own record label, Milk! Records, and recorded her debut EP I've Got A Friend Called Emily Ferris in a friend's lounge room and released it later that year. Late 2012 also saw the release of a new single, \"History Eraser,\" which was backed with Jen Cloher's \"Mount Beauty\" for a split seven-inch release.\n\nIn 2013, Barnett released her second EP, How to Carve a Carrot Into a Rose. Along with \"History Eraser,\" the EP spawned a second single, \"Avant Gardener.\" Her second EP received international acclaim, taking her and the band, Dave Mudie (drums), Bones Sloane (bass) and Dan Luscombe (guitar) all around the world.\n\nBarnett would later combine those two EP releases into one for The Double EP: A Sea of Split Peas, which was released internationally on 20 May 2013 via House Anxiety/Marathon Artists. It was named the album of the week by Stereogum. Read more on Last.fm. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.", 
            "genres": [
                "alternative rock", 
                "anti-folk", 
                "chamber pop", 
                "folk-pop", 
                "freak folk", 
                "garage rock", 
                "indie folk", 
                "indie pop", 
                "indie rock", 
                "modern rock", 
                "neo-psychedelic", 
                "preverb"
            ], 
            "id": "4OOlG5eBXSkSAAEeKjJb5Y", 
            "image_filepath": "./artist/images/4OOlG5eBXSkSAAEeKjJb5Y.jpg", 
            "image_url": "https://i.scdn.co/image/b49aaefb3dcc3e22a0eca23e7fca340aafa12ef9", 
            "name": "Courtney Barnett"
        }, 
        {
            "bio": "Kurt Vile (born 1980 in Philadelphia) is an American guitarist and singer. Previously the lead guitarist in the band The War on Drugs, he began his solo career in 2008.\n\nVile began his musical career in 2003 creating lo-fi home recordings with frequent collaborator Adam Granduciel. The duo subsequently formed the indie rock band The War on Drugs in 2005. Vile departed following the release of their debut studio album, Wagonwheel Blues, in 2008.\n\nVile's music has been likened to Bruce Springsteen, Bob Seger, and Tom Petty. His first album for Matador, titled Childish Prodigy was released in October 2009. Prior to signing with Matador, Vile released two albums, God Is Saying This To You and Constant Hitmaker, on Mexican Summer and Woodsist, respectively. He plays both solo shows as well as shows with a backing band called The Violators.\n\nSmoke Ring For My Halo, released in March of 2011, is Kurt Vile's fourth album and second official release for Matador Records. Uncut placed the album at number 14 on its list of \"Top 50 albums of 2011\" and garnered Vile the iTunes #Rewind2011 Singer/Songwriter Album of the Year. Vile followed up the widely acclaimed album with the six-song EP release, So Outta Reach, in November of the same year. The EP was composed of tracks originating from the same sessions that birthed Smoke Ring for My Halo. So Outta Reach includes the single 'The Creature', acknowledged as one of Vile's best, and a driving rock cover of Bruce Springsteen's 'Downbound Train'.  Read more on Last.fm. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.", 
            "genres": [
                "alternative rock", 
                "chamber pop", 
                "chillwave", 
                "dream pop", 
                "folk-pop", 
                "freak folk", 
                "garage rock", 
                "indie folk", 
                "indie pop", 
                "indie rock", 
                "indietronica", 
                "lo-fi", 
                "modern rock", 
                "neo-psychedelic", 
                "noise pop", 
                "nu gaze", 
                "roots rock", 
                "singer-songwriter", 
                "slow core", 
                "stomp and holler"
            ], 
            "id": "5gspAQIAH8nJUrMYgXjCJ2", 
            "image_filepath": "./artist/images/5gspAQIAH8nJUrMYgXjCJ2.jpg", 
            "image_url": "https://i.scdn.co/image/bcf02cddd3f3b917c22f90825292481d80890cd8", 
            "name": "Kurt Vile"
        }, 
        {
            "bio": "Alvvays is a dreampop band formed in Toronto, Canada in 2011.\n\nReverb-drenched and bittersweet, Alvvays members Molly Rankin and Kerri MacLellan were childhood friends, who began playing music with Alec O'Hanley while in high school.  Lead vocalist Molly Rankin is the daughter of John Morris Rankin from the popular Canadian folk family group the Rankin Family. Molly Rankin released a solo EP titled \"She EP\" in 2010 and then in 2011 formed Alvvays with MacLellan, O'Hanley, and new members Brian Murphy and Phil MacIsaac.\n\nFollowing tours with The Pains of Being Pure at Heart and Peter Bjorn and John, the group recorded a full-length album, Alvvays, which was released by Royal Mountain Records (Canada), Polyvinyl Records (US), and Transgressive Records (Europe) in July 2014.  Chad VanGaalen, John Agnello, and Graham Walsh of Holy Fuck all contributed to the album's production.  Simon Vozick-Levinson, writing in Rolling Stone, called the eponymous album an \"indie-pop wonder\".  Alvvays went to #1 on US college charts on August 5, 2014.\n Read more on Last.fm. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.", 
            "genres": [
                "chamber pop", 
                "chamber psych", 
                "chillwave", 
                "dream pop", 
                "folk-pop", 
                "freak folk", 
                "garage psych", 
                "indie folk", 
                "indie garage rock", 
                "indie pop", 
                "indie psych-rock", 
                "indie rock", 
                "indietronica", 
                "lo-fi", 
                "modern rock", 
                "neo-psychedelic", 
                "noise pop", 
                "preverb", 
                "shimmer pop", 
                "synthpop"
            ], 
            "id": "3kzwYV3OCB010YfXMF0Avt", 
            "image_filepath": "./artist/images/3kzwYV3OCB010YfXMF0Avt.jpg", 
            "image_url": "https://i.scdn.co/image/098b97354be95aa4e5f3cabfd66870f8252984fa", 
            "name": "Alvvays"
        }, 
        {
            "bio": "The National is a Brooklyn-based alternative rock band formed in 1999, by friends from Cincinnati, Ohio, USA. The band's lyrics are written and sung by Matt Berninger in a distinctive, deep baritone. The rest of the band is composed of two pairs of brothers: Aaron Dessner (guitar, bass, keyboards), Bryce Dessner (guitar), Scott Devendorf (bass, guitar) and Bryan Devendorf (drums). \n\nTheir self-titled debut album\"The National\" (Brassland 2001) was recorded and released before they had played even a single show. They cut the album with engineer Nick Lloyd and formed a label with writer Alec Bemis, so those recordings could be released. Kerrang! magazine gave it four Ks, calling it \"the stuff underground legends are made of.\"\n\nThe National made a second album, \"Sad Songs for Dirty Lovers\" (Brassland/Talitres 2003). The staff was the same, though Peter Katis, who produced \"Turn on The Bright Lights\" and \"Antics\" by Interpol, helped produce and mix, and Australian composer Padma Newsome from Clogs collaborated on arrangements and strings.\n\nFollowing the first session of several for Bernard Lenoir on France's Radio Inter, an in-between EP was released, Cherry Tree, containing what would become the blueprint for the sound on their next record and the session of Sad Song's standout Murder Me Rachael. After these accolades and being impressed by their live show, Roger Trust signed them to Beggars Banquet.\n\nA show at their favorite bar became a van ride to neighboring cities, became a plane ride to Europe, became two summers overseas. Their ties to those good jobs slackened. And they continue on their own path, moving out even further out in Brooklyn to Ditmas Park, where there is space and familiar suburban streets and even Geese on Beverly Road. Their album, \"Alligator\", much of which was recorded at their homes in Ditmas Park, was engineered by Paul Mahajan, who has worked with the Yeah Yeah Yeahs and TV on the Radio. Padma Newsome camped out for a month with the band, and Peter Katis added more production and mixed the record at his house in Bridgeport, Connecticut.\n\nBerninger's potent baritone still intones about matters fraught and funny and sad; about record collections, missing persons and medium-sized American hearts. But the record's not simply gothic or miserablist -- more like the plays of Tennessee Williams, it's full of peculiar intimacies and awkward grace. Alligator's heroes are reckless and possessed seducers, but they are apologetic ones. In The National's imaginings, in songs alternately lush and spare, there is something twighlit and dreamy worked out in the basement of our brains.\n\n\"Abel,\" \"Secret Meeting,\" and \"Lit Up\" were released as singles.\n\nOn May 22, 2007, The National released their follow-up to Alligator, Boxer, on Beggars Banquet. Taking advantage of the fact that nobody had heard their first album and earliest demos, Matt proceeded to steal lyrics and melodies from them and give them the attention they deserved while keeping the intimacy that made them special. They even managed to convince new friend Sufjan Stevens to lay down some piano tracks for them, and recorded the album in a scant 6 months after coming off the long post-Alligator road.\n\n\"Mistaken for Strangers\", \"Fake Empire\" and \"Apartment Story\" have been released as singles. The band have just finished touring North America and are on a large European autumn/winter tour after playing high slots at several large festivals. In their Dec. 07/Jan. 08 issue, Paste magazine named Boxer best record of 2007.\n\nThe band's fifth album, High Violet, was released on May 10, 2010 by 4AD Records. \"Bloodbuzz Ohio\", \"Anyone's Ghost\" and \"Terrible Love\" were released as singles.\n\nIn 2013 their sixth studio record Trouble Will Find Me was released and named \"Best New Music\" by Pitchfork. The album contained the single \"I Need My Girl\". In 2015, the album outtake \"Sunshine On My Back\"  was released.\n\nFour years after Trouble Will Find Me, marking the longest timespan between albums in their career so far, they released their seventh album Sleep Well Beast on September 8th, 2017 and were yet again met with great critical success.\n\nThe National homepage: http://www.americanmary.com/\nThe National blog http://tntl.tumblr.com\nThe National on Twitter http://twitter.com/The_National\nBrassland homepage: http://brassland.org/\nBeggars Banquet homepage: http://www.beggars.com/ Read more on Last.fm. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.", 
            "genres": [
                "alternative rock", 
                "chamber pop", 
                "folk-pop", 
                "indie folk", 
                "indie pop", 
                "indie rock", 
                "modern rock", 
                "stomp and holler"
            ], 
            "id": "2cCUtGK9sDU2EoElnk0GNB", 
            "image_filepath": "./artist/images/2cCUtGK9sDU2EoElnk0GNB.jpg", 
            "image_url": "https://i.scdn.co/image/7249cc6ecd94aebd2dfa5cefb6db057a84790d40", 
            "name": "The National"
        }, 
        {
            "bio": "Sleater-Kinney is a rock band which formed in 1994 in Olympia, Washington, United States. The band's lineup is Corin Tucker (vocals, guitar), Carrie Brownstein (vocals, guitar) and Janet Weiss (drums). Before Weiss, the band had a succession of drummers, including Lora Macfarlane, Misty Farrell and Toni Gogin.\n\nThe group's name is derived from Sleater Kinney Road, Interstate 5 off ramp #108 in Lacey, Washington, the location of one of their early practice spaces. They formed in and were a vital part of the riot grrrl and punk scenes in Washington, although they later relocated to Portland, Oregon. Throughout its existence the band was often noted by critics for its \"anthemic\" feminist message, its willingness to reinvent the musical palette of punk rock, and its consistency in producing highly acclaimed albums.\n\nCorin Tucker had previously been a member of Heavens to Besty (and would form the side project Cadallaca while a member of Sleater-Kinney), and Brownstein had been a member Excuse 17 (and, like Tucker, formed a side project, The Spells, while still a member of Sleater-Kinney). Weiss, a member of Quasi, and later Motorgoat and Stephen Malkmus and the Jicks, became the band's drummer in 1996. The band released seven albums, \"Sleater-Kinney\" (1995), \"Call the Doctor\" (1996), \"Dig Me Out\" (1997), \"The Hot Rock\" (1999), \"All Hands on the Bad One\" (2000), \"One Beat\" (2002) and \"The Woods\" (2005) before disbanding in 2006, with the members going on to pursue other projects. \n\nCorin Tucker formed Corin Tucker Band in 2010, and provided backing vocals to Eddie Vedder's \"Into the Wild\" soundtrack album in 2008. Brownstein, who had written for \"The Believer\" and \"Slate\" while still in the band, became a writer for NPR. Her blog, Monitor Mix, was active from 2007 to 2010. Brownstein also formed the band Wild Flag in 2010 and created, co-wrote and co-starred in the sketch comedy series \"Portlandia\" which began airing on IFC in early 2011.\n\nOn October 20, 2014, the band announced a full reunion and released details of their forthcoming eighth album, \"No Cities To Love\" (2015). Read more on Last.fm. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.", 
            "genres": [
                "alternative pop", 
                "alternative rock", 
                "anti-folk", 
                "electroclash", 
                "escape room", 
                "folk-pop", 
                "garage rock", 
                "indie folk", 
                "indie pop", 
                "indie punk", 
                "indie rock", 
                "lilith", 
                "lo-fi", 
                "modern rock", 
                "noise pop", 
                "noise rock", 
                "preverb", 
                "riot grrrl"
            ], 
            "id": "4wLIbcoqmqI4WZHDiBxeCB", 
            "image_filepath": "./artist/images/4wLIbcoqmqI4WZHDiBxeCB.jpg", 
            "image_url": "https://i.scdn.co/image/2ff829de85b2b35a0aeabdb49bcbe2f616b0c63a", 
            "name": "Sleater-Kinney"
        }, 
        {
            "bio": "Imagine Dragons is a Grammy award-winning alternative rock band which formed in 2008 in Las Vegas, Nevada, United States. The band consists of Dan Reynolds (vocals), Wayne Sermon (guitar), Ben McKee (bass) and Daniel Platzman (drums). The band released four EPs - \"Imagine Dragons\" (2009), \"Hell and Silence\" (2010), \"It's Time\" (2011) and \"Continued Silence\" (2012) - before releasing their debut full length album \"Night Visions\" on 4 September 2012.\n\nThe band's single \"It's Time\", which previously appeared on the \"It's Time\" and \"Continued Silence\" EPs in addition to appearing on \"Night Visions\", is the group's biggest hit, reaching #33 on the Billboard Hot 100.\n\nIn a dark kitchen in the middle of a sweaty night in Las Vegas, all 6’4” of Dan Reynolds is hunched over a laptop, slapping beats on the table and crooning lyrics into a tiny microphone.  Before long, he and the other three members of indie rock band Imagine Dragons would be playing “It’s Time,” that same laptop-demo-turned-supersized-anthem, from the roof of a parking garage to a wave of thousands of screaming fans.  This song title to the single from their 2012 debut KidInaKorner/Interscope release “Continued Silence EP” is an all too apt descriptor of the band’s hard-earned success—but it’s also emblematic of the deep-seated anxiety Reynolds and the rest of the band experienced leaving behind any realistic expectation of a normal job to do the thing they love most. \n\nA third-generation Las Vegas native, Reynolds is no stranger to the adage “the house always wins,” choosing to pave his musical career with a near obsessive work ethic and hundreds of unused demos rather than roll the dice with the first songs that sprung from his mouth.  It’s no surprise, then, that he was drawn to guitarist Wayne Sermon, another founding member of Imagine Dragons.  Having practically grown up in a recording studio and graduated Berklee College of Music, Wayne had been practicing his guitar through meals and other socially inappropriate situations as long as he could remember; he challenged Dan in a way that was both uncomfortable and exactly what they both needed.  When they began writing songs together and recognized something special was happening, Wayne called up his Berklee friend Ben McKee, who promptly dropped out of school with only a few credits left, moving across the country to play bass for the band.  This sort of reckless/genius behavior is typical for Ben, who has an uncanny penchant for spicy food and a suitcase full of unbelievable road stories.  More recently, the band was joined by drummer Daniel Platzman, another Bostonian schoolmate who seems way too nice to be playing rock and roll until you actually see him in action.\n\nSeveral tours and three self-released EPs later, Imagine Dragons had made a serious name for itself, particularly in the west coast circuit.  Although their songs vary from nearly whimsical and light to brooding and powerful, listeners are drawn to the inherent honesty in the music.  The only rule of thumb for the band, it seems, is to write from a true place; the result is songs that literally run the spectrum of human emotion.  Attend a concert, and it becomes clear that the live performance of deeply personal songs has a real effect on people.  And the band itself is not immune, as demonstrated when Dan literally passed out into the drum set during a finale song, sending cymbals and drum stands crashing while the rest of the band played on until the close.\n\nGreat songwriting is bound to be noticed eventually.  As proof that the harder you work, the luckier you get, one of those people who noticed was Grammy winning producer Alex da Kid (Eminem, Rihanna).  Alex and Dan began collaborating on projects, and soon the band had developed a relationship with Alex and his team.  The alchemy resulting from Alex’s hip hop sensibilities and Imagine Dragons’ anthemic rock is nothing short of explosive.  The byproduct of this creative collision is “Continued Silence,” a six song in-your-face sonic grenade that breaks musical boundaries and yet is strangely relatable by its improbably diverse audience. \n\nDespite it all, on any given day when they aren’t on the road playing shows, you can still find Imagine Dragons huddled away in a rehearsal room somewhere, banging out song after song in search of the next perfect track.  Like most things in Vegas, the band is angled at going big or going bust.  For the sake of those who love great music, we hope it’s the former.\n Read more on Last.fm. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.", 
            "genres": [
                "modern rock", 
                "pop", 
                "vegas indie"
            ], 
            "id": "53XhwfbYqKCa1cC15pYq2q", 
            "image_filepath": "./artist/images/53XhwfbYqKCa1cC15pYq2q.jpg", 
            "image_url": "https://i.scdn.co/image/de3c2c4f4e822edab6fd8c2103102413502635ea", 
            "name": "Imagine Dragons"
        }, 
        {
            "bio": "OneRepublic is an American, self-proclaimed \"genreless\", band formed in Colorado Springs in 2002 by Ryan Tedder and Zach Filkins. After a few years of moderate success, they have since drawn mainstream attention with the release of their single \"Apologize,\" which has sold in excess of 7 million singles worldwide.  The song, according to SoundScan Data, is one of only two songs that have reached 3 million legal downloads in history.  A remix of \"Apologize\" was featured on Timbaland's Shock Value and the band's debut album, Dreaming Out Loud, produced by Greg Wells. Their debut album was released in the United States on November 20, 2007, with international release dates staggered throughout early 2008. As of June 14, 2008, Dreaming Out Loud had sold 761,298 copies in the U.S. with the bands total album sales coming to over 1.5 million worldwide so far.  The band's second single, \"Stop and Stare,\" has also crossed the 2 million mark in terms of worldwide single sales. Their third single, \"Say (All I Need)\", has been released in the UK and in the U.S.\n\nOneRepublic's song \"Apologize\", written by Ryan Tedder, was released in its original version on the band's debut album Dreaming Out Loud. The song was also prominently featured as a remix on Timbaland's 2007 release of Shock Value. The single, as featured on Shock Value, has gone 3x Platinum (marking three million copies sold in the U.S) and 5 million copies worldwide. It peaked at number three on the U.K. Official Top 40 Week on November 11, 2007. The week of November 10, 2007, \"Apologize\" was the biggest radio airplay hit in the history of Top 40 radio in North America, racking up an astounding 10,331 spins in one week.  The song held the #1 position for five months before the record was broken by \"Bleeding Love\", a song co-written and produced by Tedder.\n\nThe band performed \"Apologize\" live on Fox's So You Think You Can Dance on August 2, 2007, and with Timbaland on an episode of One Life to Live in October 2007. It was also played at the end of four television shows-- Cold Case episode \"Sabotage,\" Smallville's \"Hero,\" Hollyoaks and Gossip Girl episode \"Hi, Society.\" The follow-up single to \"Apologize\" is \"Stop and Stare\". They performed \"Stop and Stare\" and \"Mercy\" live on the Smallville episode, \"Hero,\" which aired March 13, 2008. They also performed \"Stop and Stare\" on the Australian version of So You Think You Can Dance on April 7, 2008. On May 21, 2008, the band appeared on the American Idol (season 7) finale performing a duet of \"Apologize\" with finalist David Archuleta. They returned to Fox's So You Think You Can Dance on July 3, 2008 with a live performance of their third single \"Say (All I Need)\"\n\nTheir fourth single and follow up to \"Say (All I Need)\" is \"Mercy\" and was released in the autumn of 2008.\n\nThey released a second album, Waking Up, in 2010. From this album, they released four singles: All the Right Moves, Secrets, Marchin' On and Good Life. Their album peaked at No. 21 on Billboard and has sold 300,000 copies worldwide.  Read more on Last.fm. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.", 
            "genres": [
                "dance pop", 
                "piano rock", 
                "pop", 
                "pop christmas", 
                "pop rock"
            ], 
            "id": "5Pwc4xIPtQLFEnJriah9YJ", 
            "image_filepath": "./artist/images/5Pwc4xIPtQLFEnJriah9YJ.jpg", 
            "image_url": "https://i.scdn.co/image/0249fd0808ae0176c6a4108821a4f1bc79aae6bb", 
            "name": "OneRepublic"
        }, 
        {
            "bio": "Sia Kate Isobelle Furler (/ˈsiːə/; born 18 December 1975) is an Australian singer-songwriter, record producer and music video director. She started her career as a singer in the local Adelaide acid jazz band Crisp in the mid-1990s. In 1997, when Crisp disbanded, she released her debut studio album titled OnlySee in Australia. She then moved to London, England, and provided lead vocals for the British duo Zero 7.\n\nIn 2000, Sia signed to Sony Music's sub-label Dance Pool and released her second studio album, Healing Is Difficult, the following year. Displeased with the promotion of the record, she signed to Go! Beat and released her third studio album, Colour the Small One, in 2004. The project struggled to connect with a mainstream audience, and so Sia relocated to New York City in 2005 and began touring across the United States. She released her fourth and fifth studio releases, Some People Have Real Problems and We Are Born, in 2008 and 2010, respectively. She then took a hiatus from performing, during which she focused on songwriting for other artists. Her catalogue includes the successful collaborations \"Titanium\" (with David Guetta), \"Diamonds\" (with Rihanna) and \"Wild Ones\" (with Flo Rida).\n\nIn 2014, Sia released her sixth studio album 1000 Forms of Fear, which debuted at No 1 in the U.S. Billboard 200 and generated the top-ten breakthrough single \"Chandelier\" and a trilogy of music videos starring child dancer Maddie Ziegler. In 2016, she released her seventh studio album This Is Acting, which spawned her first Hot 100 number one single, \"Cheap Thrills\". The same year, Sia gave her Nostalgic for the Present Tour, which incorporated performance art elements. Sia has received an array of accolades, including ARIA Awards and an MTV Video Music Award. Read more on Last.fm. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.", 
            "genres": [
                "australian dance", 
                "dance pop", 
                "pop"
            ], 
            "id": "5WUlDfRSoLAfcVSX1WnrxN", 
            "image_filepath": "./artist/images/5WUlDfRSoLAfcVSX1WnrxN.jpg", 
            "image_url": "https://i.scdn.co/image/0520ee75579d30a6019f6eb7f486cec78115999b", 
            "name": "Sia"
        }, 
        {
            "bio": "This is an incorrect tag for Jason Derülo. If you have last.fm Autocorrection turned on, your scrobbles will automatically redirect to the correct artist name. Otherwise, please fix your artist ID3 tags. Read more on Last.fm. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.", 
            "genres": [
                "dance pop", 
                "pop", 
                "pop rap", 
                "post-teen pop"
            ], 
            "id": "07YZf4WDAMNwqr4jfgOZ8y", 
            "image_filepath": "./artist/images/07YZf4WDAMNwqr4jfgOZ8y.jpg", 
            "image_url": "https://i.scdn.co/image/50e885b04dbe6f9691428b0e1661e489cdc7603a", 
            "name": "Jason Derulo"
        }, 
        {
            "bio": "Stefani Joanne Angelina Germanotta (born March 28, 1986), who performs under the stage name Lady Gaga, is a singer, songwriter and musician from New York City, New York, United States. \n\nBefore Gaga adopted her stage name she was in a band called Stefani Germanotta Band. She released her first EP, “Red and Blue\", in early 2006. The following year, music producer Rob Fusari dubbed her Lady Gaga, inspired by the Queen song \"Radio Gaga\". After this, she recorded her first two songs as Lady Gaga (Fever  and Wonderful) on Def Jam records, but was later let go.\n\nShe began her career as a songwriter for some of pop music's biggest stars, including Fergie, Pussycat Dolls, Britney Spears and New Kids on the Block, as well as American singer and producer Akon. After Akon recognized that Gaga also had vocal talent, he signed her to a joint deal with his own label, Kon Live Distribution, and then she started to work on her own new material for her debut album.\n\nGaga released \"The Fame\" in 2008, which she explained was \"about how anyone can feel famous.\" To date, the album has spawned the international number one hit singles “Just Dance\" (nominated for Best Dance Recording at the 51st Grammy Awards) and \"Poker Face. The Fame then went Diamond in February 2010, selling over 12 million copies worldwide.\n\nShe then continued to release a new album 1 year later, \"The Fame Monster\", which she wasn't intending to make at first. She released “Bad Romance\" as the first single, and has been nominated for dozens of awards all over the world. After The Fame Monster was released she released two more singles \"Telephone (feat. Beyoncé)\" and \"Alejandro\". She released \"Dance in the Dark\" as a promotional single, but only released it in Australia, New Zealand, and France. She undertook a large scale tour since \"The Fame Monster\" was released, and referred to her shows as The Monster Ball.\n\nLady Gaga announced her new album name, \"Born This Way\" at the 2010 MTV VMAs and it was released on May 23. 2011, and debuted at number 1 on the Billboard 200. It was her second studio album and received generally positive reviews from music critics, who praised its range of different styles and her vocals. “Born This Way” received three Grammy Award nominations, including Lady Gaga’s third consecutive for Album of the Year. The accompanying tour, entitled “Born This Way Ball”, kicked off in April 2012 with over 100 shows scheduled worldwide. Due to a hip injury, Lady Gaga canceled the remainder of the tour in February 2013. \n\nOn November 6, 2013, Lady Gaga released her third studio album entitled “Artpop”, with featured guest appearances from T.I., Too Short, Twista and R. Kelly. “Artpop” is a synthpop album, infused with urban, R&B, techno, rock and electronic beats. The album received mixed reviews from critics with some praising Lady Gaga’s vocals, with others criticizing its perceived lack of maturity. Following a 2-day release event – “ArtRave” – the album debuted at number 1 in the US, and charted in the top 10 in over 20 countries.\n\nApplause was serviced as the lead single from Artpop on August 12, 2013, and was a critical and commercial success, charting within the top ten of more than twenty countries worldwide, peaking at number four on the U.S. Billboard Hot 100. The second single Do What U Want was released on October 21, and peaked at number 13 in the United States. It was followed by promotional singles Venus and Dope shortly before the album's release. The album later produced the single G.U.Y. Gaga promoted Artpop with several television appearances and performances, including her second Thanksgiving Day special, Lady Gaga and the Muppets' Holiday Spectacular.\n\nOn February 5, 2017, Gaga performed at the half time show at 2017's Super Bowl at Houston's NRG Stadium.\n Read more on Last.fm. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.", 
            "genres": [
                "dance pop", 
                "pop", 
                "pop christmas", 
                "post-teen pop"
            ], 
            "id": "1HY2Jd0NmPuamShAr6KMms", 
            "image_filepath": "./artist/images/1HY2Jd0NmPuamShAr6KMms.jpg", 
            "image_url": "https://i.scdn.co/image/5210a7fa24a58b3bc8109082fa7292afe437458f", 
            "name": "Lady Gaga"
        }, 
        {
            "bio": "Taylor Alison Swift (born December 13, 1989 in Wyomissing, Pennsylvania) is an American pop singer-songwriter and actress. Swift is a 10-time Grammy winner with a total of 23 nominations (Feb 2016). \n\nIn 2006, she released her debut single \"Tim McGraw\", then her self-titled debut album, which was subsequently certified multi-platinum by the Recording Industry Association of America.\n\nIn November 2008, Swift released her second album, Fearless, which featured a number of more pop oriented songs such as \"You Belong With Me\" and \"Love Story\". Fearless was the best-selling album in 2009 in the USA and was awarded with 4 Grammy's.\n\nSwift's third and fourth albums, 2010's \"Speak Now\" and 2012's \"Red\", both sold over one million copies within the first week of their US release. “Speak Now” won two Grammy Awards, while “Red’s” singles \" We Are Never Ever Getting Back Together \" and \" I Knew You Were Trouble\" were worldwide hits.\n\nThe 1989 was released on October 27, 2014. It marked a move away from her earlier country sounds and fully into pop. Both the title (\"1989\") and the overall sound of the album - synth pop - were a nod to her birth year and nostalgia with the 1980s. It became the best-selling album of 2014, selling 3.66m copies in USA, and as of April 2015, it had sold 4.5m copies in the US (9m worldwide).  The first single from the album was \"Shake It Off\" (released on August 18, 2014), which reached number one on the Billboard Hot 100.\n\nOn February 15, 2016, Taylor Swift won \"album of the year\" at the 58th Grammy Awards for \"1989\".\nhttp://taylorswift.com\n\nThe reputation was released on November 10, 2017. Read more on Last.fm. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.", 
            "genres": [
                "dance pop", 
                "pop", 
                "pop christmas", 
                "post-teen pop"
            ], 
            "id": "06HL4z0CvFAxyc27GXpf02", 
            "image_filepath": "./artist/images/06HL4z0CvFAxyc27GXpf02.jpg", 
            "image_url": "https://i.scdn.co/image/bdaeccb035a8af87b7a70b62217ff5c633ba6c7c", 
            "name": "Taylor Swift"
        }, 
        {
            "bio": "Miley Ray Cyrus (born Destiny Hope Cyrus; November 23, 1992 in Nashville, Tennessee, United States) is an American actress and pop singer. She gained fame for her role as Miley Stewart/Hannah Montana on the Disney Channel sitcom Hannah Montana, which began in 2006 and ended in 2010. Cyrus recorded music for the soundtracks Hannah Montana (2006) and Hannah Montana 2/Meet Miley Cyrus (2007), released by Walt Disney Records, which helped establish her as a teen idol. In 2007, Cyrus signed to Hollywood Records for a solo career. She went on the Best of Both Worlds Tour the same year; the tour was eventually turned into a high-grossing concert film entitled Hannah Montana & Miley Cyrus: Best of Both Worlds Concert (2008).\nIn April 2008, Cyrus released her first solo album, Breakout (2008), which experienced international success and she was included in Time magazine's 2008 Top 100. She began her foray into films by providing the voice of \"Penny\" in the animated film Bolt (2008) and by reprising the role of Miley in Hannah Montana: The Movie (2009). Bolt's theme song, \"I Thought I Lost You\", earned her a nomination for the Golden Globe Award for Best Original Song. Hannah Montana: The Movie' soundtrack introduced her to new audiences within country and adult contemporary markets.\nShe began to cultivate an adult image in 2009 with the release of The Time of Our Lives (2009), an extended play which presented a more mainstream pop sound, and by filming The Last Song (2010), a coming-of-age drama film. The former included Cyrus's best-selling single, \"Party in the U.S.A.\" (2009). Cyrus ranked number twenty-nine on Forbes' 2009 Celebrity 100. An upcoming studio album titled Can't Be Tamed will be released in 2010 and presents a new dance-pop sound. The music video and lyrics of the album's lead single, \"Can't Be Tamed\", portrays a more sexualized image for the entertainer. Cyrus has stated that she intends to focus on acting rather than singing in the future. Read more on Last.fm. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.", 
            "genres": [
                "dance pop", 
                "pop", 
                "pop christmas", 
                "post-teen pop"
            ], 
            "id": "5YGY8feqx7naU7z4HrwZM6", 
            "image_filepath": "./artist/images/5YGY8feqx7naU7z4HrwZM6.jpg", 
            "image_url": "https://i.scdn.co/image/ae71f02aececa87c716a4e0abe39f703c9054d59", 
            "name": "Miley Cyrus"
        }, 
        {
            "bio": "Fifth Harmony (commonly initialized as 5H) is four-member American girl group formed on the second season of The X Factor in 2012. The group are from Miami, Florida, United States and consist of Ally Brooke, Normani Kordei, Dinah Jane and Lauren Jauregui. Camila Cabello left the group on the 18th of December 2016. \n\nThey signed a joint deal with Syco Music, owned by Simon Cowell, and Epic Records, L.A. Reid's record label, after finishing in third place behind Tate Stevens and Carly Rose Sonenclar on the show.\n\nFifth Harmony won MTV's Artist To Watch award at the 2014 MTV Video Music Awards. In 2014, Fifth Harmony was labeled as the #1 most 'Influential' X Factor USA contestant of all-time by FoxWeekly. Their debut EP, \"Better Together\" was released in 2013 with a first week position of No. 6 on the Billboard 200. Their debut studio album, \"Reflection\" was released on January 30, 2015, going to #5 on the US Billboard 200. The album included the song Worth It (feat. Kid Ink) which became their biggest hit, peaking at #12.\n\nFifth Harmony is composed of five singers who all successfully auditioned as soloists on The X Factor, but failed to progress individually to the Judges' Houses stage of the competition. They were later formed as a group at the end of bootcamp by Simon Cowell, thus qualifying for the \"Groups\" category. Originally, the group's name was \"LYLAS\" (acronym for Love You Like a Sister), but another group called \"The Lylas\" (which consists of four of Bruno Mars' sisters) claimed that the show stole their name. Thereafter, LYLAS changed their name to \"1432\" (which stands for I Love You Too), which was announced on the first live show on October 31, 2012, during which 1432 performed \"We Are Never Ever Getting Back Together\" by Taylor Swift. Simon Cowell and L.A. Reid were critical of the new name, and Cowell suggested that the group be renamed again. During the first live results show on November 1, 2012, 1432 performed \"Skyscraper\" by Demi Lovato in a sing-off with Sister C. Cowell decided to send 1432 through to the Top 12 and he announced that they would be renamed by the viewers online. The name chosen by the public was announced: \"Fifth Harmony\".\n\nFollowing their exit from The X Factor, they released their debut single \"Miss Movin' On\", which was certified gold by the RIAA. Its music video won the group the MTV Video Music Award for Artist to Watch. Their debut EP, Better Together (2013), had a first week position of number six on the U.S. Billboard 200. The group released their debut studio album Reflection in 2015, debuting at number five on the Billboard 200 and receiving a gold certification from the RIAA. The album included the platinum singles \"Boss\", \"Sledgehammer\" and \"Worth It\". The latter achieved triple platinum certification in the U.S. and reached the top 10 in thirteen countries. \"Work from Home\", the lead single from their sophomore album 7/27 (2016), became the group's first top 10 single on the U.S. Billboard Hot 100[4] and the first top 5 by a girl group in a decade in that chart.\n\nTheir accolades include an iHeartRadio Music Award, three MTV Europe Music Awards, three MTV Video Music Award, an American Music Award, a Billboard Women in Music award and seven Teen Choice Awards. With 10 million certified records (sales plus streaming-equivalent units) in the United States, Fifth Harmony has emerged as the most successful alumni from the X Factor U.S. franchise.\n\nFifth Harmony was named by Billboard the \"hottest young stars\" under 21 for 2016. On December 18, 2016, the group announced that Cabello had left the group \"via her representatives\". Read more on Last.fm. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.", 
            "genres": [
                "dance pop", 
                "pop", 
                "post-teen pop", 
                "talent show"
            ], 
            "id": "1l8Fu6IkuTP0U5QetQJ5Xt", 
            "image_filepath": "./artist/images/1l8Fu6IkuTP0U5QetQJ5Xt.jpg", 
            "image_url": "https://i.scdn.co/image/c5e2e813755c107d8f4b068ec1001ea0f91409f1", 
            "name": "Fifth Harmony"
        }, 
        {
            "bio": "Dolly Rebecca Parton (born January 19, 1946 in  Sevierville, Tennessee, U.S.) is an American country singer, songwriter, composer, producer, entrepreneur, author and actress.\n\nParton began performing as a child, singing on local radio and television in East Tennessee. At age 12 she was appearing on Knoxville TV, and at 13, she was recording on a small label and appearing at the Grand Ole Opry in Nashville. When she graduated from high school in 1964 she moved to Nashville, taking many traditional elements of folklore and popular music from East Tennessee with her.\n\nParton's initial success came as a songwriter, with her songs being covered by Kitty Wells, Hank Williams, Jr., Skeeter Davis, and a number of others. She signed with Monument Records in late 1965, where she was initially pitched as a bubblegum pop singer, earning only one national chart single, \"Happy, Happy Birthday Baby,\" which did not crack the Billboard Top 100. Additional pop singles also failed to chart.\n\nThe label agreed to have Parton sing country music after her composition \"Put It Off Until Tomorrow\" as recorded by Bill Phillips (and with Parton, uncredited, on harmony) went to No. 6 on the country charts in 1966. Her first country single, \"Dumb Blonde\" (one of the few songs during this era that she recorded but didn't write), reached No. 24 country 1967, followed later the same year with \"Something Fishy,\" which went to No. 17. The two songs anchored her first full-length album, Hello I'm Dolly, that same year.\n\nIn 1967, Parton was asked to join the weekly syndicated country music TV program hosted by Porter Wagoner, replacing Norma Jean. She also signed with RCA Records, Wagoner's label, during this period, where she would remain for the next two decades. Wagoner and Parton immediately began a hugely successful career as a vocal duet in addition to their solo work and their first single together, a cover of Tom Paxton's \"The Last Thing on My Mind,\" reached the top ten on the U.S. country charts in late 1967, and was the first of over a dozen duet singles to chart for them during the next several years.\n\nParton is a hugely successful songwriter, having begun by writing country songs with strong elements of folk music in them based upon her upbringing in humble mountain surroundings. Her songs \"Coat of Many Colors\" and \"Jolene\" have become classics in the field, as have a number of others. As a composer, she is also regarded as one of country music's most gifted storytellers, with many of her narrative songs based on persons and events from her childhood.\n\nIn 1982 Dolly Parton sang her song \"I Will Always Love You\", for the movie \"The Best Little Whorehouse in Texas\", starring Parton and Burt Reynolds. The song - originally composed around 1974 - made few ripples, but it wasn't until Whitney Houston re-recorded it for \"The Bodyguard\" a decade later, that the song made yet another international hit for Dolly Parton. She later put out her own version on the 1996 album of the same name.\n\nIn 1987, Parton left her longtime label, RCA, and signed with Columbia Records, where her recording career continued to prosper, but by the mid 1990s, Parton, along with many other performers of her generation, found that her new music was not welcome on country radio playlists. She recorded a series of critically acclaimed bluegrass albums, beginning with \"The Grass is Blue\" (1999) and \"Little Sparrow\" (2001), both of which won Grammy Awards. Her 2002 album \"Halos and Horns\" included a bluegrass version of the Led Zeppelin classic Stairway to Heaven. In 2005, Parton released Those Were The Days, her interpretation of hits from the folk-rock era of the late 1960s through early 1970s. The CD featured such classics as John Lennon's \"Imagine,\" Cat Stevens' \"Where Do The Children Play,\" Tommy James' \"Crimson & Clover,\" and the folk classic \"Where Have All The Flowers Gone\", as well as the title track.\n\nIn 2007, Dolly paved new musical ground by forming her own record label, Dolly Records. The label's first release - Backwoods Barbie - debuted at #2 on the Billboard country albums charts and marks Parton's first mainstream country album in 17 years. Parton is touring North America and Europe throughout 2008 in support of her latest release.\n\n1955 Read more on Last.fm. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.", 
            "genres": [
                "country", 
                "country christmas", 
                "country dawn", 
                "traditional country"
            ], 
            "id": "32vWCbZh0xZ4o9gkz4PsEU", 
            "image_filepath": "./artist/images/32vWCbZh0xZ4o9gkz4PsEU.jpg", 
            "image_url": "https://i.scdn.co/image/fe6a6334ee656d6cdd8f447e93b9758cd6584073", 
            "name": "Dolly Parton"
        }, 
        {
            "bio": "Porter Wayne Wagoner (August 12, 1927 – October 28, 2007) was an American country music singer. Famous for his flashy Nudie suits and blond pompadour, Wagoner introduced a young Dolly Parton to his long-running television show. Together, \"Porter and Dolly\" were a well-known duet team for many years. Parton wrote the song \"I Will Always Love You\" after Wagoner suggested she shift from story songs to focus on love songs.\n\nHis first band, The Blue Ridge Boys, performed on radio station KWPM from a butcher shop in his native West Plains, Missouri where Wagoner cut meat. Wagoner's big break came in 1951, when he was hired as a performer by station KWTO in Springfield, Missouri. This led to a contract with RCA Records. With lagging sales, Wagoner and his trio played schoolhouses for the gate proceeds.\n\nIn 1953, his song entitled \"Trademark\" became a hit for Carl Smith, followed by a few hits of his own on RCA. He was a featured performer on ABC's Ozark Jubilee and moved to Nashville and joined the Grand Ole Opry in 1957.\n\nWagoner was elected to the Country Music Hall of Fame in 2002. His 81 charted records include \"Satisfied Mind\" (#1, 1955), “Misery Loves Company” (#1, 1962), “I've Enjoyed As Much of This As I Can Stand” (#7, 1962–1963), “Sorrow on the Rocks” (#5, 1964), “Green, Green Grass of Home” (#4, 1965), “Skid Row Joe” (#3, 1965–1966), “The Cold Hard Facts of Life” (#2, 1967), and “The Carroll County Accident” (#2, 1968–1969). Among his hit duets with Dolly Parton were a cover of Tom Paxton's \"The Last Thing on My Mind\" (1967), \"We'll Get Ahead Someday\" (1968), \"Just Someone I Used To Know\" (1969), \"Better Move it on Home\" (1971), \"Please Don't Stop Loving Me\" (#1, 1974) and \"Making Plans\" (#2, 1980). He also won three Grammy Awards for gospel recordings.\n\nThe Porter Wagoner Show ran on syndicated television from 1960 to 1981. There were 686 thirty minute episodes filmed, the first 104 being shot in black and white, the remainder in color. At its peak, it was featured in over 100 markets, with an average viewership of over three million. Reruns of the program currently air on the rural cable network RFD-TV.\n\nWagoner brought James Brown to the Grand Ole Opry, produced a rhythm & blues album for Joe Simon, and appeared in the Clint Eastwood film Honkytonk Man. [1] During the mid 1980s, Wagoner formed an all girl group called The Right Combination which was named after one of Porter and Dolly Parton's hit records. He also hosted \"Opry Backstage\" during the 1990s on The Nashville Network where he interviewed guests. Though Parton's departure caused some animosity on both sides, the two reconciled in the late 1980s and have appeared together a number of times in the years since; Parton inducted Wagoner into the Country Music Hall of Fame in 2002.\n\nWagoner made a guest appearance on the HBO comedy series Da Ali G Show, being interviewed by the fictional character Borat, in its second season.\n\nOn July 14, 2006, Wagoner was hospitalized and underwent surgery for an abdominal aneurysm.\n\nWagoner was honored on May 19, 2007 at the Grand Ole Opry for both his fifty years of membership and his 80th birthday. This was telecast on GAC's Grand Ole Opry Live that day with artists such as Stuart, Parton, and Patty Loveless. Grand Ole Opry Live host Nan Kelley was part of the birthday celebration as well.\n\nOn June 05, 2007, Wagoner released his final album called Wagonmaster. The album was produced by Marty Stuart for the Anti-label. This album received the best reviews ever in Porter's career and briefly charted on the country charts.\n\nWagoner also toured during the summer of 2007 to promote the album. One of these was opening for the rock group The White Stripes at a sold-out concert at Madison Square Garden in New York City.\n\nWagoner's publicist Darlene Bieber announced on October 19, 2007 that the singer had been hospitalized and was in very serious condition. WSMV-TV reported that Wagoner was admitted earlier that week for observation from an illness. Bieber gave no further information but said that the country star was asking for prayers from his family and fans.\n\nOn October 21, 2007, his publicist confirmed that Wagoner had been diagnosed with lung cancer.\n\nOn October 26, 2007, Porter was released into hospice care. He died two days later in Nashville, Tennessee. Wagoner's funeral was held on November 1, 2007 at the Grand Ole Opry House followed by interrment at the Woodlawn Memorial Park Cemetery in Nashville.\n\nUp until his illness and death, he appeared regularly on the Grand Ole Opry and toured actively.\n\nFrom Wikipedia, the free encyclopedia\n  Read more on Last.fm. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.", 
            "genres": [
                "country", 
                "country christmas", 
                "country gospel", 
                "cowboy western", 
                "nashville sound", 
                "outlaw country", 
                "traditional country", 
                "western swing"
            ], 
            "id": "4PcLkq6IefIYiRWLXOfwKA", 
            "image_filepath": "./artist/images/4PcLkq6IefIYiRWLXOfwKA.jpg", 
            "image_url": "https://i.scdn.co/image/b5175308a2ee7572c4874aa67af58672fc8459ef", 
            "name": "Porter Wagoner"
        }, 
        {
            "bio": "Johnny Cash (born J.R. Cash, February 26, 1932 – September 12, 2003) was a Grammy Award-winning American country singer and songwriter. \n\nCash is widely considered to be one of the most influential American musicians of the 20th century.  Although primarily remembered as a country music icon, his genre-spanning songs and sound embraced rock and roll, rockabilly, blues, folk, and gospel. This crossover appeal won Cash the rare honor of multiple induction in the Country Music, Rock and Roll, and Gospel Music Halls of Fame.\n\nCash was known for his deep, distinctive voice, the boom-chick-a-boom or \"freight train\" sound of his  backing band (Tennessee Two / Tennessee Three), his demeanor, and his dark clothing, which earned him the nickname \"The Man in Black\". He traditionally started his concerts with the introduction \"Hello, I'm Johnny Cash.\"\n\nMuch of Cash's music, especially that of his later career, echoed themes of sorrow, moral tribulation, and redemption. His signature songs include \"I Walk the Line\", \"Folsom Prison Blues\", \"Ring of Fire\", \"That Old Wheel\" (a duet with Hank Williams Jr.), \"Cocaine Blues\", and \"Man in Black\". He also recorded several humorous songs, such as \"One Piece at a Time\", \"The One on the Right Is on the Left\", \"Dirty Old Egg-Sucking Dog\" and \"A Boy Named Sue\"; rock-and-roll numbers such as \"Get Rhythm\"; and various railroad songs, such as \"Rock Island Line\" and \"Orange Blossom Special\".\n\nHe sold over 90 million albums in his nearly fifty-year career and came to occupy a \"commanding position in music history\".\n\nEarly life\nJohnny Cash was born J. R. Cash in Kingsland, Arkansas, United States, to Ray and Carrie Cash, and raised in Dyess, Arkansas. He was reportedly given the name \"J. R.\" because his parents could not agree on a name, only on initials. Giving children initials-only names, or a first name and middle initial only, was a common practice at the time. When he enlisted in the United States Air Force, the military would not accept initials as his name, so he adopted John R. Cash as his legal name. Then when signing with Sun Records in 1955, he took Johnny Cash as his stage name. His friends and in-laws generally called him John, while his blood relatives often continued to call him by his birth name, J. R.\n\nCash was one of seven children: Reba Hancock, Jack, Joanne Cash-Yates, Tommy, Roy, and Louise Cash Garrett. His younger brother Tommy Cash also became a successful country artist. By age five, J.R. was working in the cotton fields, singing along with his family as they worked.\n\nThe family farm was flooded on at least one occasion, which later inspired him to write the song Five Feet High And Rising. His family's economic and personal struggles during the Depression shaped him as a person and inspired many of his songs, especially those about other people facing similar difficulties.\n\nCash was very close to his brother Jack, who was two years older. In 1944, Jack was pulled into a whirling table saw in the mill where he worked, and cut almost in two. He suffered for over a week before he died. There was some talk that Jack's death might not have been accidental; a local bully was seen running from the shop with blood on his shirt, shortly before Jack was found. However, Cash did not discuss that theory in his autobiography, nor the report in some circles that Cash made investigation of the incident a personal obsession. Cash often spoke of the horrible guilt he felt over this incident. According to Cash: The Autobiography, his father was away that morning, but he and his mother, and Jack himself, all had premonitions or a sense of foreboding about that day, and his mother urged Jack to skip work and go fishing with his brother. Jack insisted on working, as the family needed the money. On his deathbed, Jack said he had visions of Heaven and angels. Decades later, Cash spoke of looking forward to meeting his brother in Heaven. He wrote that he had seen his brother many times in his dreams, and that Jack always looked two years older than whatever age Cash himself was at that moment. It is widely thought that the dark side of his world view was shaped by this traumatic event.\n\nCash's early memories were dominated by gospel music and radio. Taught by his mother and a childhood friend, Johnny began playing guitar and writing songs as a young boy. In high school he sang on a local radio station. Decades later, he would release an album of traditional gospel songs, called My Mother's Hymn Book. Traditional Irish music that he heard weekly on the Jack Benny radio program, performed by Dennis Day, influenced him greatly.\n\nCash enlisted in the United States Air Force. After basic training at Lackland Air Force Base and technical training at Brooks Air Force Base, both in San Antonio, Texas, Cash was assigned to a U.S. Air Force Security Service unit at Landsberg, Germany. Assigned as a morse code decoder on Russian Army transmissions, Cash was the first American to discover that Josef Stalin had died.\n\n\nFirst marriage\nWhile in Air Force training in 1950, Cash met Vivian Liberto. A month after his discharge, on August 7, 1954, he and Vivian were married. They had four daughters: Rosanne (1955), Kathleen (1956), Cindy (1959), and Tara (1961). However, his constant touring and drug use put intense strain on his marriage, and they divorced in 1966.\n\n\nEarly career\nIn 1954, the couple moved to Memphis, Tennessee, where he sold appliances, while studying to be a radio announcer. At night, he played with guitarist Luther Perkins and bassist Marshall Grant. Perkins and Grant were known as the Tennessee Two. Cash worked up the courage to visit the Sun Records studio, hoping to get a recording contract. After auditioning for Sam Phillips, singing mostly gospel songs, Phillips told him to \"go home and sin, then come back with a song I can sell.\" Cash eventually won over Phillips with new songs delivered in his early frenetic style. His first recordings at Sun, \"Hey Porter\" and \"Cry Cry Cry,\" were released in 1955 and met with reasonable success on the country hit parade.\n\nCash's next record, Folsom Prison Blues, made the country Top 5, and \"I Walk the Line\" became No. 1 on the country charts, also making it into the pop charts Top 20. Following \"I Walk the Line\" was Johnny Cash's \"Home of the Blues,\" recorded in July 1957. In 1957, Cash became the first Sun artist to release a long-playing album. Although he was Sun's most consistently best-selling and prolific artist at that time, Cash felt constrained by his contract with the small label. Elvis Presley had already left Sun, and Phillips was focusing most of his attention and promotion on Jerry Lee Lewis. The following year, Cash left the label to sign a lucrative offer with Columbia Records, where his single \"Don't Take Your Guns to Town\" would become one of his biggest hits.\n\nIn the early 60s, Cash toured with the Carter Family, which by this time regularly included Mother Maybelle's daughters, Anita, June and Helen. June later recalled admiring Johnny from afar, during these tours.\n\n\nOutlaw Image\nAs his career was taking off in the early 1960s, Cash started drinking heavily and became addicted to amphetamines and barbiturates. For a brief time, he shared an apartment in Nashville with Waylon Jennings, who was heavily addicted to amphetamines. Cash used the uppers to stay awake during tours. Friends joked about his \"nervousness\" and erratic behavior, many ignoring the warning signs of his worsening drug addiction.\n\n \nAlthough in many ways spiraling out of control, Cash's frenetic creativity was still delivering hits. His rendition of \"Ring of Fire\" was a crossover hit, reaching No. 1 on the country charts and entering the Top 20 on the pop charts. The song was written by June Carter and Merle Kilgore and originally performed by Carter's sister, but the signature mariachi-style horn arrangement was provided by Cash, who said that it had come to him in a dream. The song describes the personal hell Carter went through as she wrestled with her forbidden love for Cash (they were both married to other people at the time) and as she dealt with Cash's personal \"ring of fire\" (drug dependency and alcoholism).\n\nCash sometimes spoke of his erratic, drug-induced behavior with some degree of bemused detachment. In June 1965, his truck caught fire due to an overheated wheel bearing, triggering a forest fire that burnt several hundred acres in Los Padres National Forest in California. When the judge asked Cash why he did it, Cash said in his characteristically flippant style at the time, \"I didn't do it, my truck did, and it's dead, so you can't question it.\" The fire destroyed 508 acres (2.06 km²), burning the foliage off three mountains and killing 49 of the refuge's 53 endangered condors. Cash was unrepentant: \"I don't care about your damn yellow buzzards.\" The federal government sued him and was awarded $125,127. Johnny eventually settled the case and paid $82,001. Cash said he was the only person ever sued by the government for starting a forest fire.\n\nAlthough Cash carefully cultivated a romantic outlaw image, he never served a prison sentence. Despite landing in jail seven times for misdemeanors, each stay lasted only a single night. His most infamous run-in with the law occurred while on tour in 1965, when he was arrested by a narcotics squad in El Paso, Texas. The officers suspected that he was smuggling heroin from Mexico, but it was prescription narcotics and amphetamines that the singer had hidden inside his guitar case. Because they were prescription drugs rather than illegal narcotics, he received a suspended sentence.\n\n \nJohnny Cash and his second wife, JuneCash was also arrested on May 11, 1965, in Starkville, Mississippi, for trespassing late at night onto private property to pick flowers. (This incident gave the spark for the song \"Starkville City Jail\", which he spoke about on his live At San Quentin prison album.)\n\nThe mid 1960s saw Cash release a number of concept albums, including Ballads Of The True West (1965), an experimental double record mixing authentic frontier songs with Cash's spoken narration, and Bitter Tears (1964), with songs highlighting the plight of the Native Americans. His drug addiction was at its worst at this point, however, and his destructive behavior led to a divorce from his first wife and cancelled performances.\n\nIn 1967, Cash's duet with Carter, \"Jackson\", won a Grammy Award.\n\nCash quit using drugs in 1968, after a spiritual epiphany in the Nickajack Cave. June, Maybelle, and Eck Carter moved into Cash's mansion for a month to help him defeat his addiction. Cash proposed onstage to Carter at a concert at the London Gardens in London, Ontario on February 22, 1968; the couple married a week later in Franklin, Kentucky. June had agreed to marry Cash after he had 'cleaned up'.  Rediscovering his Christian faith, taking an \"altar call\" in Evangel Temple, a small church in the Nashville area, Cash chose this church over many larger, celebrity churches in the Nashville area because he said that there he was treated like just another parishioner and not a celebrity.\n\n\nFolsom Prison Blues\nWhile an airman in West Germany, Cash saw the B movie Inside the Walls of Folsom Prison (1951), which inspired him to write an early draft of one of his most famous songs, \"Folsom Prison Blues\".\n\nCash felt great compassion for prisoners. He began performing concerts at various prisons starting in the late 1950s. These performances led to a pair of highly successful live albums, Johnny Cash at Folsom Prison (1968) and Johnny Cash at San Quentin (1969).\n\nThe Folsom Prison record was introduced by a rendition of his classic \"Folsom Prison Blues,\" while the San Quentin record included the crossover hit single \"A Boy Named Sue,\" a Shel Silverstein-penned novelty song that reached No. 1 on the country charts and No. 2 on the U.S. Top Ten pop charts. The AM versions of the latter contained a couple of profanities which were edited out. The modern CD versions are unedited and uncensored and thus also longer than the original vinyl albums, though they still retain the audience reaction overdubs of the originals.\n\nApart from his performances at Folsom Prison and San Quentin and various other U.S. correctional facilities, Cash also performed at the Österåker Prison in Sweden in 1972. The live album På Österåker (\"At Österåker\") was released in 1973. Between the songs, Cash can be heard speaking Swedish, which was greatly appreciated by the inmates.\n\n\n\"The Man in Black\"\n \nCash advocated prison reform at his July 1972 meeting with U.S. president Richard NixonFrom 1969 to 1971, Cash starred in his own television show, The Johnny Cash Show, on the ABC network. The singing group The Statler Brothers opened up for him in every episode. Other notable artists who appeared on his show included Neil Young, Louis Armstrong, James Taylor, Ray Charles and Bob Dylan.\n\nCash had met with Dylan in the mid 1960s and became closer friends when they were neighbors in the late 1960s in Woodstock, New York. Cash was enthusiastic about reintroducing the reclusive Dylan to his audience. Cash sang a duet with Dylan on Dylan's country album Nashville Skyline and also wrote the album's Grammy-winning liner notes.\n\nAnother artist who received a major career boost from The Johnny Cash Show was songwriter Kris Kristofferson. During a live performance of Kristofferson's \"Sunday Mornin' Comin' Down,\" Cash made headlines when he refused to change the lyrics to suit network executives, singing the song with its references to marijuana intact: \"On the Sunday morning sidewalks / Wishin', Lord, that I was stoned.\"\n\nBy the early 1970s, he had crystallized his public image as \"The Man in Black.\" He regularly performed dressed all in black, wearing a long black knee-length coat. This outfit stood in contrast to the costumes worn by most of the major country acts in his day: rhinestone suit and cowboy boots. In 1971, Cash wrote the song \"Man in Black\" to help explain his dress code: \"We're doing mighty fine I do suppose/In our streak of lightning cars and fancy clothes/But just so we're reminded of the ones who are held back/Up front there ought to be a man in black.\"\n\nHe and his band had initially worn black shirts because that was the only matching color they had among their various outfits. He wore other colors on stage early in his career, but he claimed to like wearing black both on and off stage. He stated that, political reasons aside, he simply liked black as his on-stage color. To this day, the United States Navy's winter blue service uniform is referred to by sailors as \"Johnny Cashes,\" as the uniform's shirt, tie, and trousers are actually solid black in color.\n\nIn the mid 1970s, Cash's popularity and number of hit songs began to decline, but his autobiography (the first of two), titled Man in Black, was published in 1975 and sold 1.3 million copies. A second, Cash: The Autobiography, appeared in 1997. His friendship with Billy Graham led to the production of a movie about the life of Jesus, The Gospel Road, which Cash co-wrote and narrated. The decade saw his religious conviction deepening, and he made many public appearances in an evangelical capacity.\n\nHe also continued to appear on television, hosting an annual Christmas special on CBS throughout the 1970s. Later television appearances included a role in an episode of Columbo. He also appeared with his wife on an episode of Little House on the Prairie entitled \"The Collection\" and gave a performance as John Brown in the 1985 Civil War television mini-series North and South.\n\nHe was friendly with every U.S. President starting with Richard Nixon. He was probably closest with Jimmy Carter, who became a very close friend. None of these friendships were about politics (although he supported the Democratic Party). He stated that he found all of them personally charming, noting the fact that it was probably essential to getting oneself elected.\n\nWhen invited to perform at the White House for the first time in 1972, President Richard Nixon's office requested that he play \"Okie from Muskogee\" (a Merle Haggard satirical song about the people who disrespected the youthful drug users and war protesters) and \"Welfare Cadillac\" (a Guy Drake song that derides the integrity of welfare recipients). Cash declined to play either song and instead played a series of more left-leaning, politically charged songs, including \"The Ballad of Ira Hayes\" (about a brave Native-American World War II veteran who was racially mistreated upon his return to Arizona), and his own compositions, \"What is Truth?\" and \"Man in Black.\" Cash claimed that the reasons for denying Nixon's song choices were not knowing them and having fairly short notice to rehearse them, rather than any political reason.\n\n\nHighwaymen\n \nFrom left to right Kris Kristofferson, Johnny Cash, Waylon Jennings, Willie Nelson, who formed the country music supergroup, The HighwaymenIn 1980, Cash became the Country Music Hall of Fame's youngest living inductee at age forty-eight, but during the 1980s his records failed to make a major impact on the country charts, although he continued to tour successfully. In the mid 1980s, he recorded and toured with Waylon Jennings, Willie Nelson, and Kris Kristofferson as The Highwaymen, making two hit albums.\n\nDuring this period, Cash appeared as an actor in a number of television films. In 1981, he starred in The Pride of Jesse Hallam. Cash won fine reviews for his work in this film that called attention to adult illiteracy. In 1983, Cash also appeared as a heroic sheriff in Murder In Coweta County, which co-starred Andy Griffith as his nemesis. This film was based on a real-life Georgia murder case. Cash had tried for years to make the film, for which he won acclaim.\n\nCash relapsed into addiction after a serious abdominal injury in 1983 caused by an unusual incident in which he was kicked and critically wounded by an ostrich he kept on his farm. He was administered painkillers as part of the recovery process, which led to a return to substance abuse.\n\nAt a hospital visit in 1988, this time to watch over Waylon Jennings (who was recovering from a heart attack), Jennings suggested that Cash have himself checked into the hospital for his own heart condition. Doctors recommended preventive heart surgery, and Cash underwent double bypass surgery in the same hospital. Both recovered, although Cash refused to use any prescription painkillers, fearing a relapse into dependency. Cash later claimed that during his operation, he had what is called a \"near death experience\". He said he had visions of Heaven that were so beautiful that he was angry when he woke up alive.\n\nCash's recording career and his general relationship with the Nashville establishment were at an all-time low in the 1980s. He realized that his record label of nearly 30 years, Columbia, was growing indifferent to him and wasn't properly marketing him (he was \"invisible\" during that time, as he said in his autobiography). Cash recorded an intentionally awful song to protest, a self-parody. \"Chicken in Black\" was about Johnny's brain being transplanted into a chicken. Ironically, the song turned out to be a larger commercial success than any of his other recent material. Nevertheless, he was hoping to kill the relationship with the label before they did, and it was not long after \"Chicken in Black\" that Columbia and Cash parted ways.\n\nIn 1986, Cash returned to Sun Studios in Memphis to team up with Roy Orbison, Jerry Lee Lewis, and Carl Perkins to create the album Class of '55. This was not the first time he had teamed up with Lewis and Perkins at Sun Studios. On December 4, 1956, Elvis Presley dropped in on Phillips to pay a social visit while Perkins was in the studio cutting new tracks, with Lewis backing him on piano. Cash was also in the studio and the four started an impromptu jam session. Phillips left the tapes running and the recordings, almost half of which were gospel songs, survived and have been released on CD under the title Million Dollar Quartet. Tracks also include Chuck Berry's \"Brown Eyed Handsome Man\", Pat Boone's \"Don't Forbid Me\", and Elvis doing an impersonation of Jackie Wilson (who was then with Billy Ward and the Dominoes) singing \"Don't Be Cruel\".\n\nIn 1986, Cash published his only novel, Man in White, a book about Saul and his conversion to become the Apostle Paul. He also recorded Johnny Cash Reads The Complete New Testament in 1990.\n\n\nAmerican Recordings\n \nAfter Columbia Records dropped Cash from his recording contract, he had a short and unsuccessful stint with Mercury Records from 1987 to 1991 (see Johnny Cash discography).\n\nIn 1991, Cash sang lead vocals on a cover version of \"Man in Black\" for the Christian punk band One Bad Pig's album I Scream Sunday.\n\nHis career was rejuvenated in the 1990s, leading to popularity among a younger audience not traditionally interested in country music. In 1993, he sang the vocal on U2's \"The Wanderer\" for their album Zooropa. Although he was no longer sought after by major labels, Cash was approached by producer Rick Rubin and offered a contract with Rubin's American Recordings label, better known for rap and hard rock.\n\nUnder Rubin's supervision, he recorded the album American Recordings (1994) in his living room, accompanied only by his guitar. The album featured several covers of contemporary artists selected by Rubin and saw much critical and commercial success, winning a Grammy for Best Contemporary Folk Album. Cash wrote that his reception at the 1994 Glastonbury Festival was one of the highlights of his career. This was the beginning of a decade of music industry accolades and surprising commercial success.\n\nCash and his wife appeared on a number of episodes of the popular television series Dr. Quinn, Medicine Woman starring Jane Seymour. The actress thought so highly of Cash that she later named one of her twin sons after him. He did a cameo in an episode of The Simpsons, playing the voice of a coyote that guides Homer on a spiritual quest. In 1996, Cash released a sequel to American Recordings, Unchained, and enlisted the accompaniment of Tom Petty and the Heartbreakers, which won a Grammy for Best Country Album. Cash, believing he did not explain enough of himself in his 1975 autobiography Man in Black, wrote another autobiography in 1997 entitled Cash: The Autobiography.\n\n\nIllness and death\nIn 1997, Cash was diagnosed with the neurodegenerative disease Shy-Drager syndrome. The diagnosis was later altered to autonomic neuropathy associated with diabetes. This illness forced Cash to curtail his touring. He was hospitalized in 1998 with severe pneumonia, which damaged his lungs. The albums American III: Solitary Man (2000) and American IV: The Man Comes Around (2002) contained Cash's response to his illness in the form of songs of a slightly more somber tone than the first two American albums. The video for \"Hurt\", generally recognized as 'his epitaph', from American IV received particular critical and popular acclaim.\n\nJune Carter Cash died of complications following heart valve replacement surgery on May 15, 2003, at the age of seventy-three. June had told Cash to keep working, so he continued to record and even performed a couple of surprise shows at the Carter Family Fold outside Bristol, Virginia. (The July 5, 2003, concert was his final public appearance.) At the June 21, 2003, concert, before singing \"Ring of Fire\", Cash read a statement about his late wife that he had written shortly before taking the stage. He spoke of how June's spirit was watching over him and how she had come to visit him before going on stage. He barely made it through the song. Despite his health issues, he spoke of looking forward to the day when he could walk again and toss his wheelchair into the river near his home.\n\nLess than four months after his wife's death, Johnny Cash died on September 12, 2003, while hospitalized at Baptist Hospital in Nashville, Tennessee. He was 71. He was interred next to his wife in Hendersonville Memory Gardens near his home in Hendersonville, Tennessee. Cash is survived by his children and 16 grandchildren.\n\nOn May 24, 2005, Vivian Liberto, Cash's first wife and the mother of Rosanne Cash, died from surgery to remove lung cancer. It was Rosanne Cash's fiftieth birthday.\n\nIn June 2005, his lakeside home on Caudill Drive in Hendersonville, Tennessee, went up for sale by the Cash estate. In January 2006, the house was sold to Bee Gees vocalist Barry Gibb and wife Linda Gibb and titled in their Florida limited liability company for $2.3 million. The listing agent was Cash's younger brother, Tommy Cash. The home was destroyed by fire on April 10, 2007.\n\nOne of Johnny Cash's final collaborations with producer Rick Rubin, entitled American V: A Hundred Highways, was released posthumously on July 4, 2006. The album debuted in the #1 position on Billboard Magazine's Top 200 album chart the week ending July 22, 2006. The vocal parts of the track were recorded before Cash's death, but the other instruments were not recorded until about 2005. American VI, an expected final release, has yet to be issued.\n\n\nLegacy\nFrom his early days as a pioneer of rockabilly and rock and roll in the 1950s, to his decades as an international representative of country music, to his resurgence to fame in the 1990s as a living legend and an alternative country icon, Cash influenced countless artists and left a large body of work. Upon his death, Cash was revered by the greatest popular musicians of his time.\n\nAmong Johnny Cash's children, his daughter Rosanne Cash (by first wife Vivian Liberto) and his son John Carter Cash (by June Carter Cash) are notable country-music musicians in their own right.\n\nCash nurtured and defended artists on the fringes of what was acceptable in country music even while serving as the country music establishment's most visible symbol. At an all-star TNT concert in 1999, a diverse group of artists paid him tribute, including Bob Dylan, Chris Isaak, Wyclef Jean, Norah Jones, Kris Kristofferson, Willie Nelson, and U2. Cash himself appeared at the end and performed for the first time in more than a year. Two tribute albums were released shortly before his death; Kindred Spirits contains works from established artists, while Dressed in Black contains works from many lesser-known artists.\n\nIn total, he wrote over a thousand songs and released dozens of albums. A box set titled Unearthed was issued posthumously. It included four CDs of unreleased material recorded with Rubin as well as a Best of Cash on American retrospective CD.\n\nIn recognition of his lifelong support of SOS Children's Villages, his family invited friends and fans to donate to that charity in his memory. He had a personal link with the SOS village in Diessen, at the Ammersee-Lake in Southern Germany, near where he was stationed as a GI, and also with the SOS village in Barrett Town, by Montego Bay near his holiday home in Jamaica. The Johnny Cash Memorial Fund was founded and contributions can be made here.\n\nIn 1999, Cash received the Grammy Lifetime Achievement Award. In 2004, Rolling Stone Magazine ranked Johnny Cash #31 on their list of the 100 Greatest Artists of All Time.\n\nIn a tribute to Cash after his death, country music superstar Gary Allan included the song \"Nickajack Cave (Johnny Cash's Redemption)\" on his 2005 album entitled Tough All Over. The song chronicles Cash hitting rock bottom and subsequently resurrecting his life and career.\n\nFor a period of time, there was a museum called the \"House of Cash\", but it is no longer in operation. Highway 31E, Hendersonville's Main Street, is known as \"Johnny Cash Parkway\".\n\nOn November 2 – November 4, 2007 the Johnny Cash Flower Pickin' Festival was held in Starkville, Mississippi, the city where Cash had been arrested over 40 years earlier and held overnight at the city jail on May 11, 1965, inspiring Cash to write the song \"Starkville City Jail\". The festival, where he was offered a symbolic posthumous pardon, honored Cash's life and music, and is expected to become an annual event.\n\n\nPortrayals\nIn 1998, country singer Mark Collie portrayed Cash for the first time in a short film, \"I Still Miss Someone\". Shot mostly in black and white, it attempts to capture a moment in time for Cash during his darkest years, the mid 1960s.\n\nWalk the Line, an Academy Award-winning biopic about Johnny Cash's lifetime starring Joaquin Phoenix as Johnny Cash and Reese Witherspoon as June Carter Cash (for which she won the 2005 Best Actress Oscar), was released in the U.S. on November 18, 2005 to considerable commercial success and great critical acclaim. Both Phoenix and Witherspoon have won various other awards for their roles, including the Golden Globe for Best Actor in a Musical or Comedy and Best Actress in a Musical or Comedy, respectively. They both performed their own vocals in the film, and Phoenix learned to play guitar for his role as Johnny Cash. Phoenix received the Grammy Award for his contributions to the Walk the Line soundtrack.\n\nRing of Fire, a jukebox musical of the Cash oeuvre, debuted on Broadway on March 12, 2006 at the Ethel Barrymore Theatre, but closed due to harsh reviews and disappointing sales on April 30, 2006.\n\nWalk Hard: The Dewey Cox Story, a comedy film parodying biopic films such as Walk the Line and Ray, is a close parody of Cash's life and the way he was portrayed in Walk the Line.\n\n\nHeritage\nCash was completely of Scottish heritage, but he learned this only upon researching his ancestry. After a chance meeting with former Falkland laird, Major Michael Crichton-Stuart, he traced the Cash family tree to eleventh century Fife, Scotland.\n\nHe had believed in his younger days that he was mainly Irish and partially Native American (he had been told he was one-quarter Cherokee). Even after learning he had no Native American ancestry, Cash's empathy and compassion for Native Americans was unabated. These feelings were expressed in several of his songs, including Apache Tears and The Ballad of Ira Hayes, and on his album, Bitter Tears.\n\n\nLists of accomplishments\n\nCash received multiple Country Music Awards, Grammys, and other awards, in categories ranging from vocal and spoken performances to album notes and videos.\n\nIn a career that spanned almost five decades, Cash was the personification of country music to many people around the world. Cash was a musician who was not tied to a single genre. He recorded songs that could be considered rock and roll, blues, rockabilly, folk, and gospel, and exerted an influence on each of those genres. Moreover, he had the unique distinction among country artists of having \"crossed over\" late in his career to become popular with an unexpected demographic, young indie and alternative rock fans. His diversity was evidenced by his presence in three major music halls of fame: the Nashville Songwriters Hall of Fame (1977), the Country Music Hall of Fame (1980), and the Rock and Roll Hall of Fame (1992). Only thirteen performers are in both of the last two, and only Hank Williams Sr., Jimmie Rodgers, and Bill Monroe share the honor with Cash of being in all three. However, only Cash was inducted into the Rock and Roll Hall of Fame in the regular manner, unlike the other country members, who were inducted as \"early influences.\" His pioneering contribution to the genre has also been recognized by the Rockabilly Hall of Fame. He received the Kennedy Center Honors in 1996. Cash stated that his induction into the Country Music Hall of Fame in 1980 was his greatest professional achievement.\n\nIn 2007 Johnny Cash was inducted into the Hit Parade Hall of Fame. Read more on Last.fm. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.", 
            "genres": [
                "country christmas", 
                "outlaw country", 
                "singer-songwriter", 
                "traditional country"
            ], 
            "id": "6kACVPfCOnqzgfEF5ryl0x", 
            "image_filepath": "./artist/images/6kACVPfCOnqzgfEF5ryl0x.jpg", 
            "image_url": "https://i.scdn.co/image/bb60b07b069c05bb03753ae6dd5891105411623a", 
            "name": "Johnny Cash"
        }, 
        {
            "bio": "Carrie Marie Underwood, born March 10, 1983, is an American  country pop  singer-songwriter from Checotah, Oklahoma. She rose to fame after winning the 4th season of American Idol in 2005. \n\nUnderwood has since sold over 14 million albums and over 20 million singles worldwide, won several Grammy Awards, including the coveted Grammy for Best New Artist in 2007, multiple American Music Awards, including Artist of the Year in 2007, and several Billboard Music Awards, including the 2006 Album of the Year for Some Hearts. In additional, she's won multiple Academy of Country Music (ACM) and Country Music Association (CMA) Awards and has become the first and only woman in History to win the coveted ACM Entertainer of the Year award twice (2009/2010). She's also, as of May 2011,  the most successful American Idol winner in the US, having sold over 12.3 million albums and over 18.5 million album tracks in the country.\n\nHer debut album, entitled Some Hearts, hit store shelves on November 15, 2005. It was the largest selling album in 2005 and 2006 on any of the US charts. It was also the best selling debut album by a solo female country music artist in history and the best selling album by an American Idol contestant in the United States. It debuted straight to #1 on the Country music charts,  peaking also at #2 on the Billboard 200, going 7x Platinum to date. It has sold over 7 million copies in the US to date. Her first single, Inside Your Heaven, debuted straight at #1 on the Billboard Hot 100, the Billboard Pop 100 and the Canadian singles chart. The second single, Jesus, Take The Wheel, was released in October 2005 and reached #1 on the Country charts and #20 on the Billboard Hot 100. Some Hearts, the third single, was released, also in October 2005, for adult contemporary radio. It reached #12 on the Hot Adult Contemporary Radio chart. The fourth single, Don't Forget To Remember Me was released in March 2006 and peaked at #2 on the Country chart, also peaked #49 on the Billboard Hot 100. In August 2006, Before He Cheats was released, peaking in the top 10 in 12 charts across the US and Canada including #1 on the Country charts in both the US and Canada, #4 on the Canadian Hot 100 and #8 on the Billboard Hot 100. Wasted was the sixth and final single from Some Hearts. It was released on February 6th 2007 and reached #1 on the Country charts in the US and Canada, and made it to #35 on the Canadian Hot 100 and #37 on the US Billboard Hot 100.\n\nIn April 2007, Underwood recorded I'll Stand By You as a charity single for the show Idol Gives Back. It sold 124,000 on the first days of it's release, taking it to #6 on the Billboard Hot 100.\n\nCarrie's second studio album, entitled Carnival Ride, was released October 23rd 2007 and debuted on the Billboard 200 at #1, selling 527,000 copies, giving Underwood her first #1 album. It also peaked at #1 on the Candian and American Country album charts and on the Canadian album chart. It has sold over 3 million copies in the US to date and was certified triple Platinum. The first single, So Small, was released on August 14th and made it to #1 on the US Country singles chart. It also made it to #17 on the Billboard Hot 100 and #14 on the Canadian Hot 100. The second single, All-American Girl, was released on December 18th 2007 and went to #1 on both American and Candian country charts. It also reached #27 on the Billboard Hot 100. Last Name was released on April 8th 2008 and it also went to #1 on the US country chart and #19 on the Billboard Hot 100, making it her 6th top 20 hit on the Billboard. In April 2008, Underwood recorded Praying For Time for the show Idol Gives Back, which reached #10 on the Hot Digital Songs chart and peaked at #27 on the Billboard Hot 100. The fourth single from Carnival Ride was Just A Dream and was released on July 21st 2008. It went to #1 on the Country chart in the US and #2 on the Canadian country chart. It also peaked at #29 on the Billboard Hot 100. The fifth and final single, I Told You So, was released on February 2nd 2009 and peaked at #2 on the US country charts. It reached #1 on the Canadian country charts and #9 on the Billboard Hot 100.\n\nCarrie recorded a cover version of Home Sweet Home by Mötley Crüe. It was released on iTunes, where it went straight to #1. It also debuted on the Billboard Hot 100 at #21.\n\nCowboy Casanova is the lead-off single to Underwood's third studio album, Play On. The single was released on September 14th 2009. It reached #1 on the US Billboard Hot Country Songs, #2 on the Canadian Radio & Record Country Singles, #11 on the US Billboard Hot 100 and #16 on the Canadian Hot 100. The second single, Temporary Home, was released as a single on December 14th 2009 and has peaked at #21 on the Country Radio & Record Singles in the US and #37 in Canada. Play On was released on November 3rd 2009. It peaked at #1 on the US Billboard 200, US Billboard Top Country Albums and Canadian Top Country Albums charts, while just missing the top spot at #2 in the Canadian Albums chart. Play On also made a surprising entrance to the UK album charts, at #93. To date, the album has sold over 2 million copies in the US (double Platinum) and over 2.5 million copies worldwide.\n\n\"Good Girl,\" the first single from Carrie Underwood's fourth studio album was co-penned by the American Idol winner with Chris DeStefano and Ashley Gorley. It will be released to country radio on February 23, 2012.\nSee Good Girl Songfacts for more. Read more on Last.fm. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.", 
            "genres": [
                "contemporary country", 
                "country", 
                "country christmas", 
                "country dawn", 
                "country road", 
                "dance pop", 
                "neo mellow", 
                "pop", 
                "pop christmas", 
                "post-teen pop"
            ], 
            "id": "4xFUf1FHVy696Q1JQZMTRj", 
            "image_filepath": "./artist/images/4xFUf1FHVy696Q1JQZMTRj.jpg", 
            "image_url": "https://i.scdn.co/image/fc3aa1a65377f2637d99a053ccf8927952fd1128", 
            "name": "Carrie Underwood"
        }, 
        {
            "bio": "Toby Keith Covel (born July 8, 1961 in Clinton, Oklahoma, United States) is an American country music singer and songwriter. His family moved to Moore, Oklahoma (a suburb of Oklahoma City) when Keith was young. His grandmother owned a supper club and Keith became interested in the musicians who came there to play. He got his first guitar at the age of 8. Keith attended Moore High School where he played on the football team.\n\nKeith graduated from Moore High School and, in 1979, went to work as a derrick hand in the booming oil fields of Oklahoma. He worked his way up to become an operation manager. At the age of 20, he formed the Easy Money band and they played local bars as he continued to work in the oil industry. At times, he would have to leave in the middle of a gig if he was paged to work in the oil field.\n\nIn 1982, the oil industry in Oklahoma began a rapid decline and Keith soon found himself unemployed. He fell back on his football training and played defensive end with the semi-pro Oklahoma City Drillers while continuing to perform with his band. (The Drillers were an unofficial farm club of the USFL's Oklahoma Outlaws; Keith tried out for the Outlaws but did not make the team.) After two years with the Drillers, Keith decided to try music full time. His family and friends were doubtful he would succeed, but in 1984, Easy Money began playing the honky tonk circuit in Oklahoma and Texas. The band cut a single titled Blue Moon and the song received some airplay on local radio stations in Oklahoma.\n\nIn  1993 , Keith went to Nashville, Tennessee. Keith hung out and busked on Music Row and at a place called Houndogs. He distributed copies of a demo tape the band had made to the many record companies in the city. There was no interest by any of the record labels and Keith returned home feeling depressed. Keith had promised himself to have a recording contract by the time he was 30 years old or give up on music as a career. He had already passed that age without any prospects for a recording contract.\n\nFortunately for Keith, a fan of his, who was a flight attendant, gave a copy of Keith's demo tape to Harold Shedd, a Mercury Records executive, while he was traveling on a flight she was working. Shedd liked what he heard, went to see Keith perform live and then signed him to a recording contract with Mercury. His debut single, \"Should've Been a Cowboy\" (1993), went to number 1 on the Billboard country singles chart, and his self-titled debut album was certified platinum. Other hit singles included \"A Little Less Talk And A Lot More Action\" and \"Wish I Didn't Know Now.\"\n\nKeith moved briefly to Polydor Records and released his next two albums Boomtown (1994) and Blue Moon (1996). The albums went gold and platinum respectively. In 1996, Keith was also featured on the Beach Boys' now out-of-print 1996 album \"Stars and Stripes Vol. 1\" performing a cover of their 1963 hit \"Be True to Your School\" with the Beach Boys themselves providing the harmonies and backing vocals.\n\nPolydor folded and Keith moved back to Mercury Records, now called Mercury Nashville, and released his fourth album, Dream Walkin' (1997). Sting (Gordon Sumner) is featured on Dream Walkin' as additional vocals on a cover of Sting's song \"I'm So Happy I Can't Stop Crying.\"\n\nKeith began work on his next album How Do You Like Me Now (1999) at Mercury but purchased the rights to the album and moved to Dreamworks Nashville because of creative differences with Mercury. The title song \"How Do You Like Me Now\" was a number 1 single for 5 weeks and the album went double platinum.\n\nKeith also began doing a series of television advertisements for Telecom USA for their discount long distance telephone service 10-10-220. Because of the ads and his latest hit album, Keith became a superstar and household name. He also starred in Ford commercials, singing original songs such as \"Ford Truck Man\" and \"Look Again\", while driving Ford cars.\n\nKeith made an appearance at the very first Total Nonstop Action Wrestling (then NWA-TNA) weekly pay-per-view on June 19, 2002, where his playing of \"Courtesy of the Red, White and Blue\" was interrupted by Jeff Jarrett. He would later enter the Gauntlet for the Gold main event specifically to eliminate Jarrett from the match. He would appear the next week, on June 26, and help Scott Hall defeat Jarrett in singles action.\n\nKeith was the subject of the January 2005 issue of Playboy Magazine's Playboy Interview. That year, Keith toured with rock guitarist Ted Nugent, whom Keith met in Iraq while they were both performing in USO-sponsored shows for the coalition troops.\n\nOn August 31, 2005, Keith parted ways with Universal Music Group- which had since bought Dreamworks- and launched his own record label called Show Dog Nashville. Its first release was Keith's album White Trash With Money\n\nIn the autumn of 2005, he filmed \"Broken Bridges,\" written by Cherie Bennett and Jeff Gottesfeld, and directed by Steven Goldmann. This feature film from Paramount is slated for release in the second half of 2006. Keith plays Bo Porter, a country musician whose career has seen better times. The movie also stars Kelly Preston, Burt Reynolds, and Tess Harper.\n\nBig Dog Daddy followed in 2007, with Keith serving as sole producer. Its singles were \"High Maintenance Woman\", \"Love Me If You Can\", and \"Get My Drink On\". \"Love Me If You Can\" became Keith's first number 1 hit since \"As Good as I Once Was\" more than two years prior. A two-disc Christmas album, A Classic Christmas, followed later in 2007. In 2008, Keith completed his Biggest and Baddest Tour. On May 6, 2008, he released 35 Biggest Hits, a two-disc compilation featuring most of his singles to date, as well as the new song \"She's a Hottie\", which peaked at number 13.\n\nKeith released \"She Never Cried in Front of Me\", which went to number 1 in 2008. Its corresponding album, That Don't Make Me a Bad Guy, followed on October 28, 2008. It was followed by \"God Love Her\", also a number 1 hit, and \"Lost You Anyway\". American Ride, in 2009, produced another number 1 in its title track. It was followed by the Top 10 hit \"Cryin' for Me (Wayman's Song)\", a tribute to basketball player and jazz bassist Wayman Tisdale, a friend of Keith's who died in May 2009. The album's final single was \"Every Dog Has Its Day\".\n\nBullets in the Gun was released on October 5, 2010. This was Keith's first album not to produce a Top 10 hit, with \"Trailerhood\" reaching number 19, followed by the title track and \"Somewhere Else\" both at number 12. Keith produced the album with session guitarist Kenny Greenberg and Mills Logan.\n\nOn October 23, 2011, Clancy's Tavern was released. The album included the single \"Made in America\", written by Keith along with Bobby Pinson and Scott Reeves, which went to number 1. Following it was \"Red Solo Cup\", which had previously been made into a music video which became viral. Upon release as a single, \"Red Solo Cup\" became Keith's best-peaking crossover, reaching number 15 on the Hot 100. The album's final single was \"Beers Ago\" at number 6 in 2012. In December 2011, Keith was named \"Artist of the Decade\" by the American Country Awards.\n\nKeith's sixteenth album, Hope on the Rocks, was released in late 2012. It produced only two singles, both of which are top 20 hits: \"I Like Girls That Drink Beer\" reached at number 17 and the title track peaked at number 18.\n\nIn mid-2013, he entered the charts with \"Drinks After Work\", the first single from his seventeenth album, also titled Drinks After Work. The album's second single is \"Shut Up and Hold On\".\n\nPersonal convictions and controversy\n\nOn March 24, 2001, Keith’s father, H.K. Covel, was killed in a car accident. That event and the September 11, 2001 attacks prompted Keith to write the song \"Courtesy of the Red, White, & Blue (The Angry American)\", a song about his father’s patriotism and faith in the USA. At first, Keith refused to record the song and only sang it live at his concerts for military personnel. The reaction was so strong that the Commandant of the Marine Corps James L. Jones told Keith it was his duty as an American citizen to record the song. As the lead single from the album Unleashed (2002), \"Courtesy of the Red, White, & Blue\" peaked at number 1 over the weekend of July 4.\n\nABC invited Keith to sing \"Courtesy of the Red, White, & Blue\" on a patriotic special it was producing. However, the host of the show, newsman Peter Jennings, requested Keith soften the lyrics of the song or choose another song to sing. Keith refused both requests and did not appear on the special. The rift gave the song a considerable amount of publicity, which led to many national interviews and public performances of the song.\n\nKeith also had a public feud with the Dixie Chicks over the song, as well as comments they made from the stage about President George W. Bush. The lead singer of the Dixie Chicks, Natalie Maines, publicly stated that the song was \"ignorant, and it makes country music sound ignorant.\"[1] Keith responded by belittling Maines' songwriting skills, and by displaying a backdrop at his concerts showing a doctored photo of Maines with Iraqi dictator Saddam Hussein.[2] On May 21, 2003, Maines wore a T-shirt with the letters FUTK on the front at the Academy of Country Music Awards. [3] While a spokesperson for the Dixie Chicks said that the acronym stood for \"Friends United in Truth and Kindness\", many including host Vince Gill took it to be a shot at Keith. In August 2003, Keith publically declared he was done feuding with Maines 'because he's realized there are far more important things to concentrate on'.[4]\n\nKeith considers himself \"a conservative Democrat who is sometimes embarrassed for his party.\" He endorsed the re-election of President George W. Bush in 2004 and performed at a Dallas rally on the night before the election. Keith also endorsed Democrat Dan Boren in his successful run in Oklahoma's 2nd congressional district and is good friends with Democratic New Mexico Governor Bill Richar Read more on Last.fm. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.", 
            "genres": [
                "contemporary country", 
                "country", 
                "country christmas", 
                "country road", 
                "pop christmas"
            ], 
            "id": "2bA6fzP0lMAQ4kz6CF61w8", 
            "image_filepath": "./artist/images/2bA6fzP0lMAQ4kz6CF61w8.jpg", 
            "image_url": "https://i.scdn.co/image/f7fa421e319432a08c0f1a13cdb03d6788f4a03e", 
            "name": "Toby Keith"
        }, 
        {
            "bio": "Shania Twain (born Eileen Regina Edwards) is a country pop singer from Windsor, Ontario, Canada. She released her self titled debut album Shania Twain in 1993. Her third album Come On Over is the best-selling album of all time by a female musician, Second overall by any musician of the SoundScan era and the best-selling album in the history of country music. \n\nSongfacts reports that Twain's first single in six years, Today Is Your Day  debuted on the June 12, 2011 series finale of her reality television show, Why Not? With Shania Twain, and the tune was sent directly to radio stations nationwide, and made available to fans via iTunes.\n\nShania Twain (Eilleen Regina Edwards) was born August 28, 1965 to Sharon and Clarence Edwards. She grew up as Eilleen Twain in Timmins, Ontario, after her parents separated when she was two and her mother remarried to Jerry Twain, a full-blooded member of the Ojibwa First Nation. She is a Canadian singer and songwriter who has been very successful in the country and pop music genres, setting several sales records for female artists and for country artists. Additionally, she is the only female artist to have three albums certified Diamond by the RIAA. She is also the recipient of five Grammy awards. Read more on Last.fm. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.", 
            "genres": [
                "canadian country", 
                "canadian pop", 
                "contemporary country", 
                "country", 
                "country dawn", 
                "dance pop", 
                "pop"
            ], 
            "id": "5e4Dhzv426EvQe3aDb64jL", 
            "image_filepath": "./artist/images/5e4Dhzv426EvQe3aDb64jL.jpg", 
            "image_url": "https://i.scdn.co/image/b4b62d9e9fb513f003e69e0a14af00f604b8708d", 
            "name": "Shania Twain"
        }, 
        {
            "bio": "Thomas Rhett Akins, Jr. (born in Valdosta, Georgia) is an American country music singer known professionally as Thomas Rhett. He is the son of singer-songwriter Rhett Akins.[1]\nHere is some background information on Thomas Rhett from the Something To Do With My Hands Songfacts. Thomas Rhett grew up in the music industry by means of his singer-songwriter father Rhett Akins. Whilst studying business and communications at Lipscomb University in Nashville, Rhett formed a cover band and began playing frat parties and other gigs they could get. His dad persuaded him to take the stage one night at a Nashville showcase, and EMI Music's Ben Vaughn, the same publisher who had signed his father many years earlier, offered Rhett a publishing deal. \nRhett co-wrote the song \"I Ain't Ready to Quit\" on Jason Aldean's 2010 album My Kinda Party and signed a recording contract with Big Machine Records' Valory Music Group division in 2011.[2] In early 2012, he released his debut single, \"Something to Do with My Hands\". The song received a positive review from Taste of Country writer Billy Dukes, who called it \"clever, but not so cheeky that the joke tires after a listen or three.\"[3] Read more on Last.fm. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.", 
            "genres": [
                "contemporary country", 
                "country road"
            ], 
            "id": "6x2LnllRG5uGarZMsD4iO8", 
            "image_filepath": "./artist/images/6x2LnllRG5uGarZMsD4iO8.jpg", 
            "image_url": "https://i.scdn.co/image/13b9671e7a7f063f13f8a02e9042be1eb8e4c4a0", 
            "name": "Thomas Rhett"
        }, 
        {
            "bio": "Blake Tollison Shelton (born June 18, 1976) is an American country music artist. In 2001, he made his debut with the single \"Austin\". Released as the lead-off single from his self-titled debut album, \"Austin\" went on to spend five weeks at Number One on the Billboard Hot Country Songs charts. This song was the first single from his gold-certified debut album, which also produced two more Top 20 hits. Although the album was released on Giant Records Nashville, Shelton was transferred to Warner Bros. Records Nashville after Giant closed in late 2001.\n\nHis second and third albums, 2003's The Dreamer (his first for Warner Bros. proper) and 2004's Blake Shelton's Barn & Grill, were each certified gold as well. Shelton's fourth album, Pure BS, was issued in 2007, and re-issued in 2008 with a cover of Michael Bublé's pop hit \"Home\" as one of the bonus tracks. This cover was also that album's third single. A fifth album, Startin' Fires, was released in November 2008. He is currently a vocal coach on the NBC reality talent show The Voice with Adam Levine, Christina Aguilera, and Cee Lo Green.\n\nOverall, Shelton has charted seventeen singles on the country charts, including nine Number One hits: \"Austin\" (2001), \"The Baby\" (2003), \"Some Beach\" (2004–2005), \"Home\" (2008), \"She Wouldn't Be Gone\" (2009), \"Hillbilly Bone\" (2010), a duet with Trace Adkins, \"All About Tonight\" (2010), \"Who Are You When I'm Not Looking\" (2011), and \"Honey Bee\" (2011). Additionally, three more of his singles have reached Top Ten: a cover version of Conway Twitty's \"Goodbye Time\", \"Nobody but Me\", and \"I'll Just Hold On.\" Read more on Last.fm. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.", 
            "genres": [
                "contemporary country", 
                "country", 
                "country christmas", 
                "country road", 
                "modern country rock", 
                "pop christmas"
            ], 
            "id": "1UTPBmNbXNTittyMJrNkvw", 
            "image_filepath": "./artist/images/1UTPBmNbXNTittyMJrNkvw.jpg", 
            "image_url": "https://i.scdn.co/image/7b484c0e5dc706eda31f26ab4ca4e3431ecd0748", 
            "name": "Blake Shelton"
        }, 
        {
            "bio": "Foo Fighters are an American rock band formed by singer/guitarist/drummer Dave Grohl in 1995 in Seattle, USA. Grohl formed the group as a one-man project after the dissolution of his previous band Nirvana in 1994. Prior to the release of Foo Fighters in 1995, Grohl drafted Nate Mendel (bass), William Goldsmith (drums) (both of Sunny Day Real Estate and The Fire Theft), and Pat Smear (guitar) (of The Germs) to complete the group. Goldsmith left during the recording of the group's second album The Colour and the Shape (1997), soon followed by Smear. They were replaced by Taylor Hawkins and Franz Stahl, respectively, although Stahl left prior to the recording of the group's third album, There Is Nothing Left to Lose (1999).\n\nChris Shiflett joined as the band's second guitarist after the completion of There Is Nothing Left to Lose. The band released its fourth album One by One in 2002. The group followed that release with the two-disc In Your Honor (2005), which was split between acoustic songs and harder-rocking material. Foo Fighters released its sixth album Echoes, Silence, Patience & Grace in 2007. Over the course of the band's career, three of its albums have won Grammy Awards for Best Rock Album, and all six have been nominated for Grammys. The band's seventh album Wasting Light was released in 2011 and peaked at #1 in several countries.\n\nFormation and debut album\nDave Grohl joined the band Nirvana as the group's drummer in 1990. In order to occupy himself during tours, he took a guitar with him and wrote songs. Grohl held back these songs from the band; he said in 1997, \"I was in awe of frontman Kurt Cobain's songs. And intimidated. I thought it was best that I keep my songs to myself.\" Instead, Grohl occasionally booked studio time to record demos, and even issued a cassette of some of those songs called Pocketwatch under the pseudonym \"Late!\" in 1992.\n\nCobain was found dead in his Seattle home on April 8, 1994, and Nirvana subsequently disbanded. Grohl received offers to work with various artists, and almost accepted a permanent position as the drummer in Tom Petty and the Heartbreakers. Ultimately Grohl declined and instead entered a studio in October 1994 to record twelve of the forty songs he had written. With the exception of a guitar part on \"X-Static\" by Greg Dulli of the Afghan Whigs, Grohl played every instrument and sang every vocal on the tracks. \"I was supposed to just join another band and be a drummer the rest of my life,\" Grohl later said. \"I thought that I would rather do what no-one expected me to do. I enjoy writing music and I enjoy trying to sing, and there's nothing anyone can really do to discourage me.\" Grohl completed an album's worth of material in five days and handed out cassette copies of the sessions to his friends for feedback.\n\nGrohl hoped to keep his anonymity and release the recordings in a limited run under the title \"Foo Fighters\", taken from the World War II term \"foo fighter\", used to refer to unidentified flying objects. According to Rope Songfacts, he was reading a book about military World War II sightings at the time and he wanted people to think it was a band. So he called it Foo Fighters as it was plural. However, the demo tape circulated in the music industry, creating interest among record labels. Grohl formed a band to support the album. Initially, Grohl talked to former Nirvana band mate Krist Novoselic about joining the group, but both decided against it. \"For Krist and I, it would have felt really natural and really great\", Grohl explained. \"But for everyone else, it would have been weird, and it would have left me in a really bad position. Then I really would have been under the microscope.\" Having heard about the disbanding of Seattle-based emo band Sunny Day Real Estate, Grohl drafted the group's bass player, Nate Mendel, and drummer, William Goldsmith. Grohl asked Pat Smear, who served touring guitarist for Nirvana after the release of its 1993 album In Utero, to join as the group's second guitarist. Grohl ultimately licensed the album to Capitol Records, releasing it on his new record label, Roswell Records.\n\nThe group played its debut show at a keg party in February 1995. Grohl refused to do interviews or tour large venues to promote the album. Foo Fighters undertook their first major tour in the spring of 1995, opening for Mike Watt. The band's first single \"This Is a Call\" was released in June 1995, and its debut album Foo Fighters was released the next month. \"I'll Stick Around\", \"For All The Cows\" and \"Big Me\" were released as subsequent singles. The band spent the following months on tour, including their first appearance at the Reading Festival in England in August.\n\nThe Colour and the Shape\nAfter touring through the spring of 1996, Foo Fighters entered a studio in Woodinville, Washington with producer Gil Norton to record its second album. While Grohl once again wrote all the songs, the rest of the band collaborated on the arrangements. With the sessions nearly complete, Grohl took the rough mixes with him to Los Angeles, intending to finish up his vocal and guitar parts. While there, Grohl realized that he wasn't happy with how the mixes were turning out, and the band \"basically re-recorded almost everything\". During the L.A. sessions, Grohl played drums on some of the songs. Goldsmith said Grohl did not tell him that he recorded new drum parts for the record and, feeling betrayed, left the band.\n\nIn need of a replacement for Goldsmith, Grohl contacted Alanis Morissette's touring drummer Taylor Hawkins to see if he could recommend anybody. Grohl was surprised when Hawkins volunteered his own services as drummer. Hawkins made his debut with the group in time for the release of its second album, The Colour and the Shape, in May 1997. The album spawned the singles \"Monkey Wrench\", \"My Hero\", and \"Everlong\".\n\nPat Smear announced to the rest of the group that he wanted to leave the band to pursue other interests. Four months later in September 1997 at the MTV Video Music Awards, Smear simultaneously publicly announced his departure from the band and introduced his replacement, Grohl's former Scream bandmate Franz Stahl. Stahl toured with the band for the next few months, and appeared on two tracks that the band recorded for movie soundtracks, a re-recording of \"Walking After You\" for The X-Files and \"A320\" for Godzilla.\n\nThere Is Nothing Left to Lose\nIn 1998, Foo Fighters traveled to Grohl's home state of Virginia to write music for its third album. However, Grohl and Stahl were unable to co-operate as songwriters; Grohl told Kerrang! in 1999, \"In those few weeks it just seemed like the three of us were moving in one direction and Franz wasn't\". Grohl was distraught about the decision to fire Stahl, as the two had been friends since childhood. The remaining trio of Grohl, Mendel, and Hawkins spent the next several months recording the band's third album, There Is Nothing Left to Lose, in Grohl's Virginia home studio. The album spawned several singles, including \"Learn to Fly\", the band's first single to reach the US Hot 100.\n\nBefore the release of the album, Capitol president Gary Gersh was forced out of the label. Given Grohl's history with Gersh, Foo Fighters' contract had included a \"key man clause\" that allowed them to leave the label upon Gersh's departure. They subsequently left Capitol and signed to RCA, who later acquired the rights to the band's Capitol albums.\nChris Shiflett joined Foo Fighters as a touring guitarist before becoming a full member\n\nAfter recording was completed, the band auditioned a number of potential guitarists, and eventually settled on Chris Shiflett, who previously performed with No Use for a Name and Me First and the Gimme Gimmes. Shiflett initially joined the band as touring guitarist, but achieved full-time status prior to the recording of the group's fourth album.\n\nThat same year, Foo Fighters established a relationship with rock band Queen, of whom the band (particularly Grohl and Hawkins) are fans. Guitarist Brian May added a guitar track to Foo Fighters' second cover of Pink Floyd's \"Have a Cigar\", which appeared on the soundtrack to the movie Mission Impossible 2. When Queen was inducted into the Rock and Roll Hall of Fame in March 2001, Grohl and Hawkins were invited to perform with the band on \"Tie Your Mother Down\", with Grohl filling in on vocals for Freddie Mercury. In 2002, guitarist May contributed guitar work to \"Tired of You\" and an outtake called \"Knucklehead\". The bands have performed together on several occasions since, including VH1 Rock Honors and Foo Fighters' headlining concert in Hyde Park.\n\nOne by One\nNear the end of 2001, the band reconvened to record their fourth album. After spending four months in a Los Angeles studio completing the album, Grohl spent some time helping Queens of the Stone Age complete their 2002 album Songs for the Deaf. Once the Queens of the Stone Age album was finished, Grohl, inspired by the sessions, decided to reconvene Foo Fighters to rework a few songs on their album. Instead, they re-recorded nearly all of the album (save \"Tired of You\") in a ten-day stretch at Grohl's studio in Virginia. The final album was released in October of 2002 under the title One by One. Singles from the album included \"All My Life\", \"Times Like These\", \"Low\", and \"Have It All\". The band later expressed displeasure with the album. Grohl told Rolling Stone in 2005, \"Four of the songs were good, and the other seven I never played again in my life. We rushed into it, and we rushed out of it.\"\n\nFor most of its history, the band chose to stay away from the political realm. However, in 2004 prior to donating 3 million dollars to the new Pittsburgh Penguins arena, upon learning that George W. Bush's presidential campaign was using \"Times Like These\" at rallies, Grohl decided to lend his public support to John Kerry's campaign. Grohl attended several Kerry rallies and occasionally performed solo acoustic sets. The entire band eventually joined Grohl for a performance in Arizona coinciding with one of the presidential debates.\n\nIn Your Honor and acoustic tour\nHaving spent a year and a half touring behind One By One, Grohl did not want to rush into recording another Foo Fighters record. Initially Grohl intended to write acoustic material by himself, but eventually the project involved the entire band. To record its fifth album, the band shifted to Los Angeles and built a recording studio, dubbed Studio 606 West. Grohl insisted that the album be divided into two discs–one full of rock songs, the other featuring acoustic tracks. In Your Honor was released in June 2005. The album's singles included \"Best of You\", \"DOA\", \"Resolve\", \"No Way Back\", and \"Miracle\".\n\nOn June 17, 2006, Foo Fighters performed their largest non-festival headlining concert to date at London's Hyde Park. The band was supported by Juliette and the Licks, Angels & Airwaves, Queens of the Stone Age, and Motörhead. Motörhead's Lemmy joined the band on stage to sing \"Shake Your Blood\" from Dave Grohl's Probot album. Also, as a surprise performance, Brian May and Roger Taylor of Queen jammed with Foo Fighters, playing part of \"We Will Rock You\" as a lead into \"Tie Your Mother Down\".\n\nIn further support of In Your Honor, the band decided to organize a short acoustic tour for the summer of 2006. The tour included former member Pat Smear, who rejoined the band as an extra guitarist, Petra Haden on violin and backup vocals, Drew Hester on percussion, and Rami Jaffee of The Wallflowers on keyboards/piano. While much of the setlist focused on In Your Honor's acoustic half, the band also used the opportunity to play lesser-known songs such as \"Ain't It The Life\", \"Floaty\", and \"See You\". The band also performed \"Marigold\", a Pocketwatch-era song that was best-known as a Nirvana B-side.\n\nIn November 2006, the band released their first ever live CD, Skin and Bones, featuring fifteen performances captured over a three-night stand in Los Angeles. An accompanying DVD was released, and featured tracks not available on the CD.\n\nEchoes, Silence, Patience & Grace\nFor the follow-up to In Your Honor, the band decided to call in The Colour and the Shape producer Gil Norton. Echoes, Silence, Patience & Grace was released in September 2007. The album's first single, \"The Pretender\", was issued to radio in early August. The second single, \"Long Road to Ruin\", was released in December 2007, supported by a music video directed by longtime collaborator Jesse Peretz (formerly of the Lemonheads).\n\nIn mid-to-late 2007 \"The Pretender\" topped the Modern Rock chart for a record 18 weeks, it also gave the band their third consecutive year at the top (a record), and made them the only artist besides Red Hot Chili Peppers to have 4 consecutive albums have songs reach the top (RHCPs have 5). When \"Long Road to Ruin\" reached the top it gave them their fourth consecutive year to have a song reach the top (breaking their own record). When the fourth single, \"Let It Die\", reached the top 20 it gave them 3 songs in the top 20, one of only four artists to do this. \"Let It Die\" is also the album's third Number One hit on the chart.\n\nNot long after completing the recording sessions for the album, the band participated in Live Earth at Wembley Stadium in London, England, performing the penultimate set of the night. Later that summer, the band headlined V Festival 2007, including a surprise acoustic set on the Channel 4 stage under the name 606. In October 2007, Foo Fighters started their world tour in support for Echoes, Silence, Patience & Grace. The band performed shows throughout the United States, Europe, Australia, Canada and Asia. The band finished its world tour in September 2008 at the Virgin Festival at Toronto Island Park in Canada.\n\nEchoes, Silence, Patience & Grace was nominated for 5 Grammys in 2008. The Foo Fighters went home with Best Rock Album and Best Hard Rock Performance (for \"The Pretender\"). The album was also nominated for Album of the Year, while \"The Pretender\" was also nominated for Record of the Year and Best Rock Song.\n\nOn 17 September 2008 Dave Grohl announced on The Chris Moyles Show that the band would be taking a long break from music so that they could return with a new sense of purpose, and also informed fans not to expect any new music for a while. \"We've never really taken a long break, I think it's time,\" Grohl commented. \"After doing Wembley, we shouldn't come back there for 10 years because we've played to everybody. We're over in the UK every year, every summer, so I think it's time to take a break and come back over when people really miss us.\"\n\n Wasting Light \n\nAfter taking a break from music, Foo Fighters returned in 2011 with the album Wasting Light. The album was recorded in Dave Grohl's garage, as opposed to Studio 606. Grohl addressed by stating \"There's poetry in being the band that can sell out Wembley but also makes a record in a garage.\" Wasting Light features many guest musicians, including Krist Novoselic, who had played with Grohl in Nirvana. \n\nFoo Fighters released a 30 second teaser on January 17th 2011 of the song \"Bridge Burning\", and on February 1st 2011 the announcement of the release date of the album, April 12th 2011, was accompanied by a 30 second teaser of \"Miss the Misery\". On February 12th, the music video for \"White Limo\" was released. And on February 23rd \"Rope\" was released for online streaming. \n\nOn March 1st \"Rope\" was released as the first single from the album. It peaked at number 1 in the US on the Rock, Alternative, and Mainstream Rock charts.\n\nOn April 9th the band appeared on Saturday Night Live (host Helen Miren). They played the song \"Rope\" for their first performance, and debuted the song \"Walk\" for their second. \n\nWasting Light peaked at number 1 on the Albums chart in 12 countries, including the US and UK. It has achieved platinum status in Australia and New Zeland. \n\nMusical style\nWhen Grohl first started the band, its music was often compared to that of his previous group, Nirvana. Grohl acknowledged that Nirvana singer/guitarist Kurt Cobain was a major influence on his songwriting. Grohl said, \"Through Kurt, I saw the beauty of minimalism and the importance of music that's stripped down.\" Foo Fighters also utilize the Pixies' technique of shifting between quiet verses and loud chorus, which Grohl said was influenced by the members of Nirvana \"liking the Knack, Bay City Rollers, The Beatles, and Abba as much as we liked Flipper and Black Flag, I suppose\". Writing and recording songs for the first Foo Fighters album by himself, Grohl wrote the guitar riffs to be as rhythmic as possible. He approached the guitar similar to how he approached playing a drumkit, assigning different drum parts to different strings on the instrument. This allowed him to piece together songs easily; he said, \"I could hear the song in my head before it was finished.\" Once Grohl assembled a full band, his bandmates assisted in song arrangements.\n\nThe members of Foo Fighters meld melodic elements with harder sounds. Grohl noted in 1997, \"We all love music, whether it's the Beatles or Queen or punk rock. I think the lure of punk rock was the energy and immediacy; the need to thrash stuff around. But at the same time, we're all suckers for a beautiful melody, you know? So it is just natural.\"\n\nCampaigning and activism\nIn 2000, the band generated controversy through their public support of Alive & Well, an organization that denies the link between HIV and AIDS, questions the validity of HIV tests, and advises against taking medication to counter the disease. Foo Fighter bassist Nate Mendel learned of Alive & Well through What If Everything You Thought You Knew about AIDS Was Wrong?, a self-published book written by Christine Maggiore, the organization's founder. Mendel passed the book around to the rest of the band, who supported his advocacy.\n\nIn January 2000, the band played a benefit concert for the organization, which Mendel helped to organize. The band also contributed songs to The Other Side of AIDS, a controversial documentary film by Maggiore's husband Robin Scovill, which questions whether HIV is the cause of AIDS. The band's position caused alarm in the medical community, as Alive & Well's advice ran contrary to established medical wisdom about HIV and AIDS. In a 2000 interview, Mendel spoke of using Foo Fighters' popularity to help spread the group's message and of holding more benefits for the organization. However, no further benefits have taken place, and the band has since removed the organization from its list of supported causes.\n\n\nNon-VEVO youtube channel: https://www.youtube.com/channel/UCi2KNss4Yx73NG0JARSFe0A Read more on Last.fm. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.", 
            "genres": [
                "alternative metal", 
                "alternative rock", 
                "modern rock", 
                "permanent wave", 
                "pop rock", 
                "post-grunge", 
                "rock"
            ], 
            "id": "7jy3rLJdDQY21OgRLCZ9sD", 
            "image_filepath": "./artist/images/7jy3rLJdDQY21OgRLCZ9sD.jpg", 
            "image_url": "https://i.scdn.co/image/c1a1b1ba6e7f40a1ac584481bdd6b3c2f305a35c", 
            "name": "Foo Fighters"
        }, 
        {
            "bio": "Green Day is an American punk rock band formed in 1986. The band consists of lead vocalist and guitarist Billie Joe Armstrong, bassist and backing vocalist Mike Dirnt, drummer Tré Cool and guitarist and backing vocalist Jason White, who became a full member after playing in the band as a session and touring guitarist for 13 years. Cool replaced former drummer John Kiffmeyer in 1990, prior to the recording of the band's second studio album, Kerplunk (1992).\n\nGreen Day was originally part of the punk scene at the DIY 924 Gilman Street club in Berkeley, California. The band's early releases were from the independent record label Lookout! Records. In 1994, its major label debut Dookie released through Reprise Records became a breakout success and eventually sold over 10 million copies in the U.S. Green Day was widely credited, alongside fellow California punk bands Sublime, Bad Religion, The Offspring and Rancid, with popularizing and reviving mainstream interest in punk rock in the United States.\n\nGreen Day's three follow-up albums, Insomniac (1995), Nimrod (1997), and Warning (2000) did not achieve the massive success of Dookie, though they were still successful, with Insomniac and Nimrod reaching double platinum and Warning reaching gold status. The band's rock opera, American Idiot (2004), reignited the band's popularity with a younger generation, selling five million copies in the United States. The band's eighth studio album, 21st Century Breakdown, was released in 2009 which achieved the band's best chart performance to date. 21st Century Breakdown was followed up by a trilogy of albums called ¡Uno!, ¡Dos!, and ¡Tré! released in September, November and December 2012 respectively.\n\nThey are one of the world's best-selling groups of all time, having sold more than 75 million albums and singles worldwide. The group has won five Grammy Awards: Best Alternative Album for Dookie, Best Rock Album for American Idiot, Record of the Year for \"Boulevard of Broken Dreams\", Best Rock Album for the second time for 21st Century Breakdown and Best Musical Show Album for American Idiot: The Original Broadway Cast Recording. In 2010, a stage adaptation of American Idiot debuted on Broadway. The musical was nominated for three Tony Awards: Best Musical, Best Scenic Design and Best Lighting Design, losing only the first. Also in 2010, Green Day were ranked number 91 in the VH1 list of the \"100 Greatest Artists of All Time\".\n\nIn 1987, friends Billie Joe Armstrong and Mike Dirnt, 15 years old at the time, formed a band called Sweet Children. Its first live performance took place on October 17, 1987 at Rod's Hickory Pit in Vallejo, California. In 1988, Armstrong and Dirnt began working with Sean Hughes and the former Isocracy drummer John Kiffmeyer, also known as \"Al Sobrante\". As said in the film Punk's Not Dead, Armstrong cites the band Operation Ivy (which featured Tim Armstrong and Matt Freeman of Rancid) as a major influence, and a group that inspired him to form a band.\n\nIn 1988, Larry Livermore, owner of Lookout! Records, saw the band play an early show and signed the group to his label. In 1989, the band recorded its debut extended play, 1,000 Hours. Before 1,000 Hours was released, the group dropped the name Sweet Children; according to Livermore, this was done to avoid confusion with another local band Sweet Baby. The band adopted the name Green Day, due to their fondness for marijuana.\n\nLookout! would release Green Day's debut studio album, 39/Smooth in early 1990. Green Day would record two extended plays later that year, Slappy and Sweet Children, the latter of which included older songs that the band had recorded for the Minneapolis independent record label Skene! Records. In 1991, Lookout! Records re-released 39/Smooth under the name 1,039/Smoothed Out Slappy Hours, and added the songs from the band's first two EPs, Slappy, and 1,000 Hours. In late 1990, shortly after the band's first nationwide tour, Sobrante left the East Bay area to attend college. The Lookouts drummer Tré Cool began filling in as a temporary replacement and later Cool's position as Green Day's drummer became permanent. The band went on tour for most of 1992 and 1993, and played a number of shows overseas in Europe. The band's second studio album Kerplunk sold 50,000 copies in the U.S.\n\nKerplunk's underground success led to a number of major record labels being interested in signing Green Day, and the band eventually left Lookout! and signed to Reprise Records after attracting the attention of producer Rob Cavallo. The group was impressed by his work with fellow Californian band The Muffs, and later remarked that Cavallo \"was the only person we could really talk to and connect with\". Reflecting on the period, Armstrong told Spin magazine in 1999, \"I couldn't go back to the punk scene, whether we were the biggest success in the world or the biggest failure ... The only thing I could do was get on my bike and go forward.\" After signing with Reprise, the band went to work on recording its major label debut, Dookie.\n\n\nRecorded in three weeks, and released in February 1994, Dookie became a commercial success, helped by extensive MTV airplay for the videos of the songs \"Longview\", \"Basket Case\", and \"When I Come Around\", all of which reached the number one position on the Modern Rock Tracks charts. At a September 9, 1994 performance at Hatch Memorial Shell in Boston, mayhem broke-out during the band's set (cut short to seven songs) and by the end of the rampage, 100 people were injured and 45 arrested. The band also joined the lineups of both the Lollapalooza festival and Woodstock '94, where they started an infamous mud fight. During the concert, a security guard mistook bassist Mike Dirnt for a stage-invading fan and punched out some of his teeth. Viewed by millions by pay-per-view television, the Woodstock 1994 performance further aided Green Day's growing publicity and recognition, and helped push its album to eventual diamond status. In 1995, Dookie won the Grammy Award for Best Alternative Album and the band was nominated for nine MTV Video Music Awards including Video of the Year.\n\nIn 1995, a new single for the Angus soundtrack was released, entitled \"J.A.R.\". The single debuted at number one on the Billboard Modern Rock Tracks chart. The song was followed by the band's fourth studio album, Insomniac, which was released in the fall of 1995. Insomniac was a much darker and heavier response to the band's newfound popularity, compared to the more melodic Dookie. The album opened to a warm critical reception, earning 4 out of 5 stars from Rolling Stone, which said \"In punk, the good stuff actually unfolds and gains meaning as you listen without sacrificing any of its electric, haywire immediacy. And Green Day are as good as this stuff gets.\" The singles released from Insomniac were \"Geek Stink Breath\", \"Stuck with Me\", \"Brain Stew/Jaded\", and \"Walking Contradiction\".\n\nThough the album did not approach the success of Dookie, it sold two million copies in the United States. In addition, the album won the band award nominations for Favorite Artist, Favorite Hard Rock Artist, and Favorite Alternative Artist at the 1996 American Music Awards, and the video for \"Walking Contradiction\" got the band a Grammy nomination for Best Video, Short Form, in addition to a Best Special Effects nomination at the MTV Video Music Awards. After that, the band abruptly cancelled a European tour, citing exhaustion.\n\nAfter a brief hiatus in 1996, Green Day began to work on a new album in 1997. From the outset, both the band and Cavallo agreed that the album had to be different from its previous albums. The result was Nimrod, an experimental deviation from the band's standard pop-punk brand of music. The new album was released in October 1997. It provided a variety of music, from pop-punk, surf rock, and ska, to an acoustic ballad. Nimrod entered the charts at number 10. The success of \"Good Riddance (Time of Your Life)\" won the band an MTV Video Award for Best Alternative Video. The song was also used in the second \"clip show\" episode of Seinfeld and on two episodes of ER.\n\nThe other singles released from Nimrod were \"Nice Guys Finish Last\", \"Hitchin' a Ride\" and \"Redundant\". The band made a guest appearance in an episode of King of the Hill entitled \"The Man Who Shot Cane Skretteberg\", which aired in 1997. In late 1997 and most of 1998, Green Day embarked on a tour in support of Nimrod. In 1999, the guitarist Jason White began supporting the band on the concerts as rhythm guitarist.\n\nIn 2000, Green Day released its sixth studio album Warning. In support of the album, the band participated in the Warped Tour in 2000. The band also had an independent tour to support the album in 2001. Critics' reviews of the album were varied. Allmusic gave it 4.5/5 saying \"Warning may not be an innovative record per se, but it's tremendously satisfying.\" Rolling Stone was more critical, giving it 3/5, and saying \"Warning... invites the question: Who wants to listen to songs of faith, hope and social commentary from what used to be snot-core's biggest-selling band?\" Though it produced the hit \"Minority\" and a smaller hit with \"Warning\", some observers were coming to the conclusion that the band was losing relevance, and a decline in popularity followed. While all of Green Day's previous albums had reached a status of at least double platinum, Warning was only certified platinum.\n\nAt the 2001 California Music Awards, Green Day won all eight of the awards that it was nominated for. The group won the awards for Outstanding Album (Warning), Outstanding Punk Rock/Ska Album (Warning), Outstanding Group, Outstanding Male Vocalist, Outstanding Bassist, Outstanding Drummer, Outstanding Songwriter, and Outstanding Artist.\n\nThe release of two compilation albums, International Superhits! and Shenanigans, followed Warning. International Superhits and its companion collection of music videos, International Supervideos!. Shenanigans contained some of the band's b-sides, including \"Espionage\", which was featured in the film Austin Powers: The Spy Who Shagged Me and was nominated for a Grammy Award for Best Rock Instrumental Performance.\n\nIn the spring of 2002, Green Day co-headlined the Pop Disaster Tour with Blink-182 which was documented on the DVD Riding in Vans with Boys.\n\nIn the summer of 2003, the band went into a studio to write and record new material for a new album, tentatively titled Cigarettes and Valentines. After completing 20 tracks, the master recordings were stolen from the studio. Instead of re-recording the stolen tracks, the band decided to abandon the entire project and start over, considering the taken material to be unrepresentative of the band's best work. It was then revealed that a band called The Network was signed to Armstrong's record label Adeline Records with little fanfare and information. After the mysterious band released an album called Money Money 2020, it was rumored that The Network was a Green Day side project, due to the similarities in the bands' sounds. However, these rumors were never addressed by the band or Adeline Records, except for a statement on the Adeline website discussing an ongoing dispute between the two bands.\n\nGreen Day collaborated with Iggy Pop on two tracks for his album Skull Ring in November 2003. On February 1, 2004 a new song, a cover of \"I Fought the Law\" made its debut on a commercial for iTunes during NFL Super Bowl XXXVIII.\n\n\n\nThe resulting album, American Idiot (2004), debuted at number one on the Billboard charts, the band's first album to reach number one, backed by the success of the album's first single, \"American Idiot\". The album was labeled as a punk rock opera which follows the journey of the fictitious \"Jesus of Suburbia\". The album depicts the modern American life under the control from an idiot ruler who let people be misinformed by media as well as inserted \"redneck agenda\". It gives different angles on an everyman, modern icons, and leaders on the topic. Released two months before U.S. President George W. Bush was reelected, the album became protest art. American Idiot won the 2005 Grammy for Best Rock Album. The band also won a total of seven awards out of eight awards for which they were nominated, including the Viewer's Choice Award in MTV Video Music Awards 2005.\n\nThrough 2005, the band toured in support of the album with nearly 150 dates (Longest tour in their career) visiting Japan, Australia, South America and the United Kingdom. While touring for American Idiot, they filmed and recorded the two concerts at the Milton Keynes National Bowl in England, which was voted 'The Best Show On Earth' in a Kerrang! Magazine Poll. These recordings were released as a live CD and DVD called Bullet in a Bible on November 15, 2005. This CD/DVD featured songs from American Idiot as well as songs from all its previous albums, except Kerplunk and 1,039/Smoothed Out Slappy Hours. The DVD featured behind-the-scenes footage of the band, and showed how the band prepared to put on the show. The final shows of its 2005 world tour were in Sydney and Melbourne in Australia, on December 14 and 17 respectively.\n\nOn August 1, 2005 Green Day announced that it had rescinded the master rights to its pre-Dookie material from Lookout! Records, citing a continuing breach of contract regarding unpaid royalties, a complaint shared with other Lookout! bands.\n\nOn January 10, 2006 the band was awarded with a People's Choice Award as favorite musical group or band.\n\nGreen Day engaged in a number of other smaller projects in the time following the success of American Idiot. The group released an album under the name Foxboro Hot Tubs entitled Stop Drop and Roll!!! In 2008, the Foxboro Hot Tubs went on a mini-tour to promote the record, hitting tiny Bay Area venues including the Stork Club in Oakland and Toot's Tavern in Crockett, California.\n\nIn an interview with Carson Daly, Garbage lead singer Shirley Manson revealed that Butch Vig would be producing Green Day's forthcoming album. The span of nearly five years between American Idiot and 21st Century Breakdown was the longest gap between studio albums in Green Day's career. The band had been working on new material since January 2006. By October 2007, Armstrong had 45 songs written, but the band showed no further signs of progress until October 2008, when two videos showing the band recording in the studio with producer Butch Vig were posted on YouTube. The writing and recording process, spanning three years and four recording studios, was finally finished in April 2009.\n\n21st Century Breakdown, was released on May 15, 2009. The album received a mainly positive reception from critics, getting an average rating between 3 and 4 stars. After the release, the album reached number one in fourteen countries, being certified gold or platinum in each. 21st Century Breakdown achieved Green Day's best chart performance to date. The band started playing shows in California in April and early May. It was their first live show in about three years. Green Day went on a world tour that started in North America in July 2009 and continuing around the world throughout the rest of 2009 and early 2010.\n\nWal-Mart refused to carry the album as it contains a Parental Advisory sticker and requested that Green Day release a censored edition. The band members did not wish to change any lyrics on the album and responded by stating, \"There's nothing dirty about our record... They want artists to censor their records in order to be carried in there. We just said no. We've never done it before. You feel like you're in 1953 or something.\"\n\nIn 2009, the band met with award-winning director Michael Mayer and many cast and crew members of the Tony Award-winning musical Spring Awakening to create a stage version of the album American Idiot. American Idiot: The Musical opened in the Berkeley Repertory Theatre during the end of 2009. The show features an expanded story of the original album, with new characters such as Will, Extraordinary Girl, and Favorite Son. On April 20, 2010, American Idiot: The Musical opened on Broadway, and Green Day released the soundtrack to the musical, featuring a new song by Green Day entitled \"When It's Time\". In June 2010 the iTunes received the single \"When It's Time\".\n\nDuring the Spike TV Video Game Awards 2009, it was announced that Green Day was set to have its own Rock Band video game titled as Green Day: Rock Band, as a follow-up to the last band specific Rock Band game, The Beatles: Rock Band. The game features the full albums of Dookie, American Idiot, and 21st Century Breakdown as well as select songs from the rest of Green Day's discography.\n\nDuring the second leg of the 21st Century Breakdown World Tour the band had said that they are writing new material. In an interview with Kerrang! magazine, Armstrong spoke about the possible new album: \"We did some demos in Berlin, some in Stockholm, some just outside of Glasgow and some in Amsterdam. We wanted get [the songs] down in some early form.\" The band also stated that they were recording a live album during the entire tour on the last date of the tour in Mountain View, California, also before playing the song \"Cigarettes and Valentines\". In October 2010, Dirnt was interviewed by Radio W, mentioning that they have completed the writing process of the ninth studio album. In the interview, Dirnt also mentioned that a new live album will \"most likely\" be released. The live CD/DVD and CD/Blu-ray entitled Awesome as Fuck was released on March 22, 2011.\n\nDuring the end of 2011, the band played several secret shows (under the name Foxboro Hot Tubs) whose setlists consisted almost entirely of previously unheard songs. Green Day entered the studio and began recording new material in February 2012, later announcing a trilogy of albums titled ¡Uno!, ¡Dos!, and ¡Tré! which would be released in the fall of 2012. The trilogy marked longtime touring guitarist Jason White's induction as the fourth member of the band. That summer Green Day played several festivals and promotional shows including the Rock en Seine festival in France, the Rock am See festival in Germany, and the Reading Festival in the United Kingdom.\n\n¡Uno!, ¡Dos!, and ¡Tré! were released on September 21, November 9, and December 7, 2012 respectively and were met with generally positive reviews. On January 22, 2013 the band announced that ¡Cuatro!, a documentary about the making of ¡Uno!, ¡Dos! and ¡Tré!, would premiere on January 26 in Aspen, Colorado as part of the X Games FILM showcase, and would be released on DVD April 9, 2013. Another documentary was announced called Broadway Idiot which focuses on the creation on the American Idiot musical and Armstrong's run as playing the character of St. Jimmy. On March 10, 2013, Green Day began their 99 Revolutions Tour to support the trilogy. In June, Green Day broke Emirates Stadium attendance record with 60,000 tickets sold, in the United Kingdom. The band played Dookie from start to finish on several dates on their European leg, including during Reading Festival 2013 headline show.\n\nDemolicious, a compilation that album contains alternate versions and demos of songs from ¡Uno!, ¡Dos! and ¡Tré! recorded during the studio sessions of these albums, was released on April 19, 2014, for Record Store Day. It also contains a previously unreleased song called \"State of Shock\" and an acoustic version of \"Stay the Night\", from ¡Uno!.\n\nSince 1991, members of the band have branched out past Green Day and have started other projects with other musicians. Notable related projects of Green Day include Billie Joe Armstrong's Pinhead Gunpowder (which also features Green Day's guitarist Jason White), The Frustrators in which Mike Dirnt plays bass, and The Network, a collaboration between Green Day and members of the band, Devo in which all members play under fake stage names. Green Day has also released an album titled Stop Drop and Roll!!! on May 20, 2008, under the name Foxboro Hot Tubs, they currently use this name to book secret shows. In late December 2011, Armstrong formed a new side band called The Boo along his wife Adrienne and their two sons.\n\nIn September 2006, Green Day collaborated with U2 and producer Rick Rubin to record a cover of the song \"The Saints Are Coming\", originally recorded by The Skids, with an accompanying video. The song was recorded to benefit Music Rising, an organization to help raise money for musicians' instruments lost during Hurricane Katrina, and to bring awareness on the eve of the one-year anniversary of the disaster.\n\nIn December 2006, Green Day and NRDC opened a web site in partnership to raise awareness on America's dependency on oil.\n\nGreen Day released a cover of the John Lennon song \"Working Class Hero\", which was featured on the album Instant Karma: The Amnesty International Campaign to Save Darfur. The band performed the song on the season finale of American Idol. The song was nominated for a Grammy Award in 2008 but lost to The White Stripes' \"Icky Thump\". That summer, the band appeared in a cameo role in The Simpsons Movie, where they perform the show's theme song. Their version was released as a single on July 24, 2007.\n\nIn 2009, the band collaborated with theatre director Michael Mayer to adapt their rock opera American Idiot into a one-act stage musical that premiered at the Berkeley Rep on September 15, 2009. The show then moved to Broadway on April 20, 2010.\n\nThe reviews of American Idiot: The Musical have been positive to mixed. Charles Isherwood of The New York Times wrote an enthusiastic review for the Broadway production. He called the show \"a pulsating portrait of wasted youth that invokes all the standard genre conventions ... only to transcend them through the power of its music and the artistry of its execution, the show is as invigorating and ultimately as moving as anything I’ve seen on Broadway this season. Or maybe for a few seasons past.\" Jed Gottlieb of the Boston Herald enjoyed the premise of the show but found that \"the music and message suffer in a setting where the audience is politely, soberly seated\".\n\nMichael Kuchiwara of the Associated Press found the show to be \"visually striking [and] musically adventurous\", but noted that \"the show has the barest wisp of a story and minimal character development\". Paul Kolnik in USA Today enjoyed the contradiction that Green Day's \"massively popular, starkly disenchanted album ... would be the feel-good musical of the season\". Time magazine's Richard Zoglin opined that the score \"is as pure a specimen of contemporary punk rock as Broadway has yet encountered [yet] there's enough variety. ... Where the show fall short is as a fully developed narrative.\" He concluded that \"American Idiot, despite its earnest huffing and puffing, remains little more than an annotated rock concert. ... Still, [it] deserves at least two cheers – for its irresistible musical energy and for opening fresh vistas for that odd couple, rock and Broadway.\" Peter Travers from Rolling Stone, in his review of American Idiot, wrote \"Though American Idiot carries echoes of such rock musicals as Tommy, Hair, Rent and Spring Awakening, it cuts its own path to the heart. You won’t know what hit you. American Idiot knows no limits—it's a global knockout.\" The musical has been nominated for three Tony Awards, including Best Musical and Best Scenic Design. It was also nominated for a number of Drama Desk Awards and Outer Critics Circle Awards.\n\nIn October 2009, a Green Day art project was exhibited at StolenSpace Gallery in London. The exhibition showed artworks created for each of the songs on 21st Century Breakdown, was supported by the band, and led by their manager Pat Magnarella. He explained in an interview that \"[Artists are] basically like rock bands. Most are creating their art, but don't know how to promote it.\" For Billie Joe Armstrong, \"Many of the artists... show their work on the street, and we feel a strong connection to that type of creative expression.\"\n\nOn April 13, 2011, a film version of American Idiot was confirmed. Michael Mayer, director of the Broadway musical, will be directing the film. It will be produced by Green Day, Pat Magnarella (Green Day's manager who also produced Bullet in a Bible, Awesome as Fuck, and Heart Like a Hand Grenade), Playtone (Tom Hanks and Gary Goetzman) and Tom Hulce.\n\nOn January 23, 2013, it was announced that a documentary showing Armstrong's journey from punk rock to Broadway was to be released. Called Broadway Idiot and showing a lot of behind-the-scenes of the American Idiot musical production, the movie was directed by Doug Hamilton, veteran television journalist for CBS News' 60 Minutes and PBS documentaries such as Nova, Frontline and American Masters. A trailer was released on January 30, 2013. The documentary premiered at the South by Southwest Film Festival on March 15, 2013.\n\nThe band has generated controversy over whether the band's musical style and major-label status constitutes as \"true punk\". In reaction to both the style of music and the background of the band, John Lydon, former front man of the 1970s punk band the Sex Pistols commented:\n\n\"So there we are fending off all that and it pisses me off that years later a wank outfit like Green Day hop in and nick all that and attach it to themselves. They didn't earn their wings to do that and if they were true punk they wouldn't look anything like they do.\"\n\nArmstrong himself has discussed the group's status of being a punk band on a major record label, saying \"Sometimes I think we've become totally redundant because we're this big band now, we've made a lot of money – we're not punk rock any more. But then I think about it and just say, 'You can take us out of a punk rock environment, but you can't take the punk rock out of us.'\"\n\nOn September 21, 2012, while Green Day was performing at the iHeartRadio music festival, lead vocalist/guitarist Billie Joe Armstrong stopped while performing Basket Case, because he believed their time was being shortened, possibly in order to extend R&B artist Usher's performance. Angered, Armstrong began ranting while a screen in the rear of the audience was labeled \"1 Minutes Left\", saying \"You're not gonna give me one fucking minute? You've gotta be fucking kidding me!\". He also told the crowd he was not Justin Bieber and labeled the festival as a \"joke\". When the screen went blank, Armstrong smashed his guitar, while bassist Mike Dirnt smashed his bass. Armstrong then gave the finger, and declared that Green Day would be back before throwing his microphone down and walking off the stage. Two days later, the band's representative apologized for the incident on their behalf stating that \"Green Day would like everyone to know that their set was not cut short by Clear Channel and to apologize to those they offended at the iHeartRadio Festival in Las Vegas\" also adding that Armstrong will be headed to rehab, for abuse of alcohol and prescription pills for anxiety and insomnia. However Mike Dirnt would later say in an interview with Rolling Stone that he agreed with what Billie Joe meant by his rant\n\n Read more on Last.fm. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.", 
            "genres": [
                "alternative rock", 
                "modern rock", 
                "permanent wave", 
                "pop punk", 
                "pop rock", 
                "punk", 
                "rock"
            ], 
            "id": "7oPftvlwr6VrsViSDV7fJY", 
            "image_filepath": "./artist/images/7oPftvlwr6VrsViSDV7fJY.jpg", 
            "image_url": "https://i.scdn.co/image/b6a3f82183adb83b6e47cb22afc25724b241d038", 
            "name": "Green Day"
        }
    ]
}