{
    "artists": [
        {
            "bio": "Formed at the beginning of 2013, Royal Blood are a 2-piece band from Brighton, East Sussex, UK. Having known each other for years in different bands, Mike Kerr (Bassist/Vocalist) & Ben Thatcher (Drums) finally came together and went into the studio to record ‘Figure It Out’ – the first track that brought attention to the band. At the tail end of 2013, Royal Blood released ‘Out of The Black’, their debut single on Black Mammoth Records. \n\nThe band released their debut album ''Royal Blood’' on 22 August, 2014 which sold 66,000 copies in its first week. Read more on Last.fm. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.", 
            "genres": [
                "alternative rock", 
                "garage rock", 
                "indie rock", 
                "modern rock", 
                "rock"
            ], 
            "id": "2S5hlvw4CMtMGswFtfdK15", 
            "image_filepath": "./artist/images/2S5hlvw4CMtMGswFtfdK15.jpg", 
            "image_url": "https://i.scdn.co/image/32edab67a5aaa296a2e8bc76cd59e6e49f351f4f", 
            "name": "Royal Blood"
        }, 
        {
            "bio": "Metallica is an American metal band formed in 1981 in Los Angeles, California, United States when drummer Lars Ulrich posted an advertisement in The Recycler. Metallica’s line-up originally consisted of Ulrich, rhythm guitarist and vocalist James Hetfield, and lead guitarist Dave Mustaine. Mustaine was later fired due to problems with alcoholism and drug addiction - he went on to form the band Megadeth. Exodus guitarist Kirk Hammett took his place. Metallica has been through several bassists, including Ron McGovney, Cliff Burton (who died in a bus crash while the band was on tour), and Jason Newsted. The current bassist is Robert Trujillo, who joined in 2003.\n\nMetallica’s early releases included fast tempos, instrumentals, and aggressive musicianship that placed them as one of the “big four” of the thrash metal sub-genre alongside Slayer, Megadeth, and Anthrax. The band earned a growing fan base in the underground music community and critical acclaim, with the 1986 release Master of Puppets described as one of the most influential and “heavy” metal albums. The band achieved substantial commercial success with Metallica (1991), which debuted at number one on the Billboard 200. With this release the band expanded its musical direction resulting in an album that appealed to a more mainstream audience.\n\nIn 2000, Metallica was among several artists who filed a lawsuit against Napster for sharing the band’s copyright-protected material for free without the band members’ consent. A settlement was reached, and Napster became a pay-to-use service. Despite reaching number one on the Billboard 200, the release of St. Anger alienated many fans with the exclusion of guitar solos and the “steel-sounding” snare drum. A film titled Some Kind of Monster documented the recording process of St. Anger.\n\nMetallica has released nine studio albums, two live albums, two EPs, twenty-two music videos, and forty-four singles. The band has won nine Grammy Awards, and has had five consecutive albums debut at number one on the Billboard 200, making Metallica the only band ever to do so. The band’s 1991 album, Metallica, has sold over 15 million copies in the United States, and 22 million copies worldwide, which makes it the 25th-highest-selling album in the country. The band has sold an estimated 100 million records worldwide as of the release of their latest album Death Magnetic. As of September 2008, Metallica is the fourth highest-selling music artist since the SoundScan era began tracking sales on May 25, 1991, selling a total of 51,136,000 albums in the United States alone.\n\nMetallica was inducted into the Rock and Roll Hall of Fame in 2009. Metallica organised a brand new festival. They called it Sonishpere. Several cities in Europe were chosen by the band.\n\nOn June 15, 2011, Metallica announced that recording sessions with singer-songwriter Lou Reed had concluded. The album, titled Lulu, was recorded over several months, and resulted in ten songs based on Frank Wedekind's \"Lulu\" plays, Earth Spirit and Pandora's Box. The album was released on October 31, 2011. The recording of the album was problematic at times, with Lars Ulrich later stating Lou Reed challenged him to a \"street fight\". On October 16, 2011, Robert Trujillo confirmed that the band was back in the studio and writing new material, stating, \"The writing process for the new Metallica album has begun. We've been in the studio with Rick Rubin, working on a couple of things, and we're going to be recording during the most of next year.\"\n\nCurrent members:\n\nJames Hetfield – lead vocals, rhythm guitar (1981–present)\nLars Ulrich  – drums, percussion (1981–present)\nKirk Hammett  – lead guitar, backing vocals (1983–present)\nRobert Trujillo – bass, backing vocals (2003–present).\n\nFormer members:\n\nRon McGovney– bass (1982)\nDave Mustaine – lead guitar, backing vocals (1982–1983)\nCliff Burton – bass, backing vocals (1982–1986)\nJason Newsted – bass, backing vocals (1986–2001). Read more on Last.fm. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.", 
            "genres": [
                "alternative metal", 
                "alternative rock", 
                "hard rock", 
                "metal", 
                "nu metal", 
                "rock", 
                "speed metal", 
                "thrash metal"
            ], 
            "id": "2ye2Wgw4gimLv2eAKyk1NB", 
            "image_filepath": "./artist/images/2ye2Wgw4gimLv2eAKyk1NB.jpg", 
            "image_url": "https://i.scdn.co/image/5a06711d7fc48d5e0e3f9a3274ffed3f0af1bd91", 
            "name": "Metallica"
        }, 
        {
            "bio": "Lou Reed (March 2, 1942 - October 27, 2013) was an American rock artist originally from Brooklyn, New York, USA. Especially while a member of the The Velvet Underground in the 1960s, Reed broke new ground for the rock genre in several important dimensions, introducing more mature and intellectual themes to what was then considered a largely simplistic genre of music.\n\nIn 1964 Reed moved to New York City and began working as an in-house songwriter for Pickwick Records. In 1964 he scored a minor hit with the single \"The Ostrich\", a parody of popular dance songs of the time, which included lines such as \"put your head on the floor and have somebody step on it.\"\n\nReed first found prominence as the guitarist and principal singer-songwriter of The Velvet Underground. The band, which lasted from 1965 until 1973 (with Reed departing in late 1970 after the Loaded sessions), gained relatively little notice during its life but is often considered the seed from which most alternative and underground traditions of rock music sprang. As the Velvet's songwriter, Reed wrote about such taboo subjects as S&M (Venus in Furs), transvestites and transsexuals (Sister Ray, and Lady Godiva's Operation), prostitution (There She Goes Again), and drug addiction (I'm Waiting for the Man, White Light/White Heat, Heroin). \n\nAs a guitarist, he made innovative use of abrasive distortion, volume-driven feedback, and nonstandard tunings. Reed's flat, New York voice, stripped of superficial emotions and, like Bob Dylan's, flaunting its lack of conventional training, was no less important to the music's radical effect. One of rock's most volatile personalities, Reed made inconsistent albums that frustrated critics. The reputation he established more than forty years ago with The Velvet Underground has both haunted and elevated him to near-mythic stature.\n\nReed began a long and varied solo career in 1972. He scored a hit that year with Walk on the Wild Side off the Bowie-produced Transformer. For more than a decade he then seemed purposely to evade mainstream commercial success.  Transformer was followed by the dark and challenging Berlin, an album that shed his fan base just as he'd cultivated it. \n\nAlbums such as the one-take low-ball wonder Sally Can't Dance and Metal Machine Music continued his nose-thumbing at mainstream success and his label. Metal Machine Music, upon which Reed later commented, \"no one is supposed to be able to do a thing like that and survive.\", although considered a contract-fulfilling joke upon its release, has been widely recognized as the invention of \"noise music,\" and many artists, such as Japan's Merzbow have regarded it as a pioneering classic.\n\nDespite his best efforts, the 70's were not without artistically and commercially successful albums. He had a major success with the live Rock 'n Roll AnimalLP, recorded following the release of Transformer, which received vast FM airplay in the mid-to late '70s due in no small part to the superb guitar solos of Steve Hunter. Coney Island Baby contained some of the best written and performed songs in Reed's oeuvre and Street Hassle saw Reed brave new-wave stylings.\n\nRock and Rule, an animated film centered around rock music in a post - apocalyptic future, featured music by Reed and other similar artists.  His contribution vividly helped define the evil character Mok, and reflected his ongoing exploration of dark subjects.  Although released within a couple of years of another animation cult classic, Heavy Metal, the 1983 release of R&R was a commercial failure.  Despite the advanced animation, lack of marketing support by the parent company doomed it.  The movie was relegated to late - night cable TV, where it built a small but persistent fan base. \n\nDespite erratic turns, Reed's work won him wide recognition by the late 1980s  as an essential elder statesman of rock. For decades he has written about intense subjects including heroin, transexuals, and S&M - not to mention the horror stories on Berlin - which had never been presented in rock and roll before. The industry had matured, to the extent that his commercial position as an \"art rocker\" was secure.\n\nReed has lived in New York City for most of his life and much of his music evokes the city, earning the singer comparisons (which he has encouraged) to William Faulkner and James Joyce as writers of regional interest. He also cites the poet Delmore Schwartz as a great influence. Reed studied creative writing under Schwartz at Syracuse University in the early 60s. The song My House tells the story of a Ouija board which spells out Delmore, and how this event inspired Reed.\n\nIn May 2000, Reed performed before Pope John Paul II at the Great Jubilee Concert in Rome. In 2000, a new collaboration with Robert Wilson called \"Poe-Try\" was staged at the Thalia Theater in Germany. As with the previous collaboration \"Time Rocker,\" \"Poe-Try\" was also inspired by the works of a 19th century writer: Edgar Allan Poe. Reed became interested in Poe after producer and long-time friend Hal Willner suggested he read some of Poe's text at a Halloween benefit he was curating at St. Ann's Episcopal Church in Brooklyn.[24] For this new collaboration, Reed reworked and even rewrote some of Poe's text as well as included some new songs based on the theme explored in the texts. In 2001, Reed made a cameo appearance in the movie adaptation of Prozac Nation. On October 6, 2001, the New York Times published a Reed poem called Laurie Sadly Listening in which he reflects upon the 9/11 terrorist attacks.[25]\n\nIncorrect reports of Reed's death were broadcast by numerous U.S. radio stations in 2001, caused by a hoax email (purporting to be from Reuters) which said he had died of a drug overdose. In 2003, he released a 2-CD set, The Raven, based on \"Poe-Try.\" Besides Reed and his band, the album featured a wide range of actors and musicians including singers David Bowie, Laurie Anderson, Kate and Anna McGarrigle, The Blind Boys of Alabama and Antony Hegarty, saxophonist and long-time idol Ornette Coleman, and actors Elizabeth Ashley, Christopher Walken, Steve Buscemi, Willem Dafoe, Amanda Plummer, Fisher Stevens and Kate Valk. The album consisted of songs written by Reed and spoken-word performances of reworked and rewritten texts of Edgar Allan Poe by the actors, set to electronic music composed by Reed. At the same time a single disc CD version of the albums, focusing on the music, was also released.\n\nLou Reed teamed up with The Killers on the track Tranquilize for their new compilation album Sawdust, which was released on November 13, 2007.\n\nIn December 2006, Reed played a first series of show at St. Ann's Warehouse, Brooklyn, based on his 1973 Berlin song cycle. Reed was reunited on stage with guitarist Steve Hunter, who played on the original album as well as on Rock 'n' Roll Animal, as well as joined by singers Antony Hegarty and Sharon Jones, pianist Rupert Christie, a horn and string section and the Brooklyn Youth Chorus. The show was being produced by Bob Ezrin, who also produced the original album, and Hal Willner. The stage was designed by painter Julian Schnabel and a film about protagonist \"Caroline\" directed by his daughter, Lola Schnabel, was being projected to the stage. A live recording of these concerts was also published as a film (directed by Schnabel) which was released spring 2008. The show was also played at the Sydney Festival in January 2007 and throughout Europe during June and July 2007. The album version of the concert, entitled Berlin: Live At St. Ann's Warehouse, was released in 2008.\n\n On October 1, 2008, Reed joined Richard Barone via projected video on a spoken/sung duet of Reed's \"I'll Be Your Mirror,\" with cellist Jane Scarpantoni, in Barone's FRONTMAN: A Musical Reading at Carnegie Hall.\n\nOn October 2 and 3, 2008, he premiered his new group, which later was named Metal Machine Trio, at REDCAT (Walt Disney Concert Hall Complex, Los Angeles). The live recordings of the concerts were released under the title The Creation of the Universe. The Trio features Ulrich Krieger (saxophone) and Sarth Calhoun (electronics), and plays free improvised instrumental music inspired by Reed's 1975 album Metal Machine Music. The music ranges from ambient soundscapes to free rock to contemporary noise. The trio played further shows at New York's Gramercy Theater in April 2009, and appeared as part of Reed's band at the 2009 Lollapalooza, including a ten minute free trio improvisation. At Lollapalooza, held in Chicago's Grant Park, Reed played \"Sweet Jane\" and \"White Light/White Heat\" with Metallica at Madison Square Garden as part of the twenty-fifth anniversary celebration of the Rock and Roll Hall of Fame on October 30, 2009. Reed's recent activity in films include providing the voice of Maltazard, the villain in the forthcoming Luc Besson animated film, Arthur and the Vengeance of Maltazard, and playing the role of himself in Wim Wenders' movie Palermo Shooting (2008).\n\nIn 2009, Reed became an active member of the Jazz Foundation of America (JFA). He was a featured performer at the JFA's annual benefit \"A Great Night in Harlem\" in May 2009.\n\nReed has remained active doing benefits and composing music. He has contributed vocals on the third Gorillaz album, Plastic Beach, on the song \"Some Kind Of Nature\" and co-wrote and performed backup music for a Chen Style T'ai Chi instructional DVD. He has a co-production credit on Laurie Anderson's Homeland.\n\nLou Reed performed a cover of the Buddy Holly song \"Peggy Sue\" which is featured on the tribute album Rave On Buddy Holly.\n\nIn 2010, French/American underground electronic recording artist, Uffie used an instrumental sample of The Velvet Underground track \"Rock & Roll\" for her debut album's title track \"Sex Dreams and Denim Jeans\", written about her 2009 divorce to André Saraiva. Before the release of the album there was a contract-conflict between Uffie and Lou Reed as to who would be credited as the writer of the title track. The only way Lou Reed would allow her to use the sample was by calling \"Sex Dreams and Denim Jeans\" an \"adaptation\" of \"Rock & Roll\" as well as receiving the sole credit as the songwriter for the track. This dispute once again delayed the album by about six months and Uffie notoriously labeled Lou Reed as \"fucking difficult\" and when asked if he had heard the song, she stated \"yes he has, he had to clear it. And it was a very not nice experience dealing with him, I have to say. I don't know what this guy's problem is but on the credits I think it even says something like he wrote it. He gets everything.\"\n\nReed also began touring with the Metal Machine Trio, which was widely viewed as a return to his exploration of noise and sound. In 2011, heavy metal band Metallica recorded a full length collaboration with Lou Reed entitled Lulu, released November 1 in North America and October 31 everywhere else. After he initially refused Susan Boyle the right to perform \"Perfect Day\" on an American television special (\"America's Got Talent\"), he subsequently agreed to direct her video rendition.\n\nIn January, 2012, Reed and John Cale sued the Andy Warhol Foundation for the license to use the yellow banana image from Warhol's art for The Velvet Underground & Nico album.\n\nReed contributed vocals to the track \"The Wanderlust\" on Metric's 2012 album Synthetica.\n\nHe influenced a large list of artists such as David Bowie, Tom Waits, Ian Hunter, Talking Heads, Julian Thome, R.E.M., Nick Cave & the Bad Seeds, Sonic Youth and The Strokes. He died on October 27, 2013. Read more on Last.fm. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.", 
            "genres": [
                "album rock", 
                "alternative rock", 
                "art rock", 
                "classic rock", 
                "dance rock", 
                "glam rock", 
                "mellow gold", 
                "neo mellow", 
                "new wave", 
                "permanent wave", 
                "protopunk", 
                "psychedelic rock", 
                "rock", 
                "rock-and-roll", 
                "roots rock", 
                "singer-songwriter"
            ], 
            "id": "42TFhl7WlMRXiNqzSrnzPL", 
            "image_filepath": "./artist/images/42TFhl7WlMRXiNqzSrnzPL.jpg", 
            "image_url": "https://i.scdn.co/image/2e1e9a6fe696b536a1f9e6a27fc1ed23d2c97099", 
            "name": "Lou Reed"
        }, 
        {
            "bio": "Kings of Leon is an American rock band that formed in Nashville, Tennessee, United States in 1999, consisting of brothers Anthony \"Caleb\" Followill (lead vocals, rhythm guitar), Ivan \"Nathan\" Followill (drums, percussion, backing vocals) and Michael \"Jared\" Followill (bass guitar, backing vocals), with their cousin Cameron \"Matthew\" Followill (lead guitar, backing vocals). Each member of the family group is known by their middle name (second given name) as opposed to their first given name.\n\nThe band's early music was an upbeat blend of southern rock and blues influences but the band has gradually expanded their sound to include a variety of genres, including alternative rock.\n\nKings of Leon achieved initial success in the United Kingdom with nine Top 40 singles, two BRIT Awards in 2008, and all three of the band's albums at the time peaking in the top five of the UK Albums Chart. Their third album Because of the Times also reached the number one spot. After the release of Only by the Night in 2008 they finally achieved chart success in their native United States. The singles Sex on Fire, Use Somebody and Notion peaked at number one on the Hot Modern Rock Tracks, while the album itself was their first ever platinum-selling album in the US. \n\nEarly years (1999–2002)\nThe three Followill brothers spent much of their youth traveling around the Southern United States with their father, Ivan \"Leon\" Followill, a traveling Pentecostal Church preacher and their mother, Betty-Ann, who taught them when they were not in school. Caleb and Jared were both born in Mt. Juliet, Tennessee, while Nathan and Matthew were born in Oklahoma City, Oklahoma. According to Rolling Stone magazine, \"While Leon preached at churches and tent revivals throughout the Deep South, the boys attended services and were occasionally enlisted to bang on some drums. They were either home-schooled or enrolled in small parochial schools at this time. Except for a five-year period when they settled in Jackson, Tennessee, the Followill's childhoods were spent driving through the south in a purple 1988 Oldsmobile, decamping for a week or two wherever Leon was scheduled to preach.\"\n\nWhen the boys' father resigned from the church and divorced his wife in 1997, the boys relocated to Nashville and embraced the rock music and lifestyle they had previously been denied. While there, they met songwriter Angelo Petraglia, who helped the siblings hone their songwriting skills and introduced them to the musical influences of the Rolling Stones, The Clash, and Thin Lizzy in particular. Six months later, Nathan and Caleb signed with RCA Records, who insisted that the duo recruit more members for the band before launching their career. The band was formed when cousin Matthew and younger brother Jared were asked to join. They named themselves Kings of Leon in honor of Nathan, Caleb, and Jared's father and grandfather, who were both named Leon.\n\nIn an interview, Caleb admitted to \"kidnapping\" their cousin Matthew from his hometown in Mississippi in order for him to join the band. They told his mother that he was just staying for a week, but they consequently never allowed him to return home. Drummer Nathan added, \"When we signed the deal with RCA, it was just me and Caleb. The label told us they were going to put a band together, but we said, 'We're going to buy our little brother a bass, he's a freshman in high school. Caleb will teach himself the guitar. Our cousin Matthew played guitar when he was 10 and I'll play drums.' The record label agreed,\". \n\nYouth and Young Manhood and Aha Shake Heartbreak (2003 - 2005)\nTheir first record, the Holy Roller Novocaine EP was released on February 18, 2003. At this stage, Jared was only 16 years old and had not yet learned to play the bass guitar. The release of Holy Roller Novocaine gave the Kings of Leon a significant amount of exposure prior to the release of their debut album, Youth and Young Manhood, receiving a 4/5 star rating from Rolling Stone magazine. Four of the five songs would later be released on Youth and Young Manhood, however the versions of Wasted Time and California Waiting on the EP differ, with the first having a more tense riff and different vocal style than the same track off Youth and Young Manhood, and the latter being recorded in a rush to finish the record. The EP contains the B-side Wicker Chair while another track titled Andrea, was discarded prior to its release. All the songs released on the EP were co-written by Angelo Petraglia who also produced the record.\n\nThe band's debut studio album, Youth and Young Manhood was released in the UK in July 2003, and in the United States in August of the same year. The album was recorded between Sound City Studios in Los Angeles and Shangri-La Studios in Malibu, California, with producer Ethan Johns (son of producer Glyn Johns who most notably worked with the Rolling Stones and the Eagles). The album received some critical notice domestically, but became a sensation in the UK and Ireland, where NME declared it \"one of the best debut album of the last 10 years\". Following the release of the album, Kings of Leon was chosen to tour with fellow American rock band The Strokes and U2.\n\nThe band's second album Aha Shake Heartbreak was released in the UK in October 2004 and in the United States in February 2005. Building on the southern-infused garage rock of their first album, the album broadened the band's domestic and international audience. The album was again produced by Angelo Petraglia and Ethan Johns. The Bucket, Four Kicks, and King of the Rodeo were all released as singles, with the \"The Bucket\" rising into the Top 20 in Britain. Taper Jean Girl was also used in the 2007 movie Disturbia and the movie Cloverfield in 2008. The band garnered accolades from several of their rock peers, including Elvis Costello, and also toured with Bob Dylan and Pearl Jam during 2005 and 2006.\n\nBecause of the Times (2006–07)\nIn March 2006, Kings of Leon were back in the studio with their producers Angelo Petraglia and Ethan Johns, working on their third album. Guitarist Matthew told NME: \"Man, we're sitting on a bunch of songs right now that we wish we could let the world hear\". The band's third album was titled Because of the Times, which may be a reference to a church ministers conference of the same name held at The Pentecostals of Alexandria church in Alexandria, Louisiana that the brothers often attended. The album showed a clear evolution from Kings of Leon's previous work, as the band's trademark dirty, southern-fried swagger was replaced with a more polished, clean-cut sound.\n\nThe album was released on April 2, 2007 in the UK, and a day later in the United States, preceded by the single On Call, which became a hit in Britain and Ireland. It debuted at number one in Britain and Ireland and entered the European charts at number twenty-five, selling approximately 70,000 copies in its first week of release. NME said that the album \"cements Kings of Leon as one of the great American bands of our times.\" and Entertainment Weekly called Because of the Times \"an epic wide-screen movie of a CD and the band's best to date.\" However, some critics found the album inferior to their previous efforts. Stylus Magazine rated it a C- and noted \"If they wanted us to take them serious this time around, they'd at least try to be right honest about their ascent into minor celebrity and not keep on with the yokel façade. Without cautionary yarns regarding life on the tour bus or banging supermodels, the bright-eyed, legs-stretched mood of the music rings just as hollow.\" Dave Hood of Artrocker gave the album one star out of five, finding that \"Kings of Leon are experimenting, learning, and getting a bit lost.\" Pitchfork Media contended that \"Because of the Times sounds suspiciously like a counterattack on womankind, launched from somewhere in the mid-1990s, deep inside a bruised, stadium-sized ego.\"\n\nIn spite of the mixed recognition, the album spawned a number of hit singles in Europe, including Charmer and Fans, along with a number of crowd favorites such as Knocked Up and My Party.\n\nOnly by the Night (2008–09)\nAfter recording throughout most of 2008, \"the all American long haired rockers\" (The Times), released their fourth studio album Only by the Night on September 19, which subsequently entered the UK Albums Chart at number one and remained there for one more week. Only By The Night also had two single week stints as the UK #1 album in 2009, one directly after the BRIT Awards. In the United States, the album reached number 5 on the Billboard Charts. Reception to the album was the most polarized yet, with the British press granting the album glowing reviews. Q Magazine named Only by the Night \"Album of the Year\" for 2008. In the United States, reactions to the album were more mixed. Spin, Rolling Stone, and All Music Guide gave the album positive reviews, while Pitchfork Media gave the album a virtual equivalent of 2 stars. The album was officially named as the UK's third biggest selling album of 2008 and the biggest selling album of 2008 in Australia. Sex on Fire was the first single released for download in the UK on 8 September. The song became their most successful ever as it peaked at number one in the UK and in Ireland. It was also their first song to chart number one on the Billboard Hot Modern Rock chart. The second single to be released from the album on December 8, 2008 was Use Somebody which achieved worldwide chart success and consistency, such as peaking at number two in the UK Singles Chart, and also reaching top ten chart positions in Australia, Ireland, New Zealand and the United States. The album's popularity in Australia was confirmed with a total of four singles being voted into the world's largest online music poll, the \"Triple J Hottest 100\". The song Crawl came in at number 70, Closer was voted number 24 and \"Use Somebody\" finished number 3 in the poll. However, their biggest success from Only By The Night was \"Sex on Fire\" which was voted number 1 in the Hottest 100 poll for 2008 and number 90 in the Triple J Hottest 100 of All Time, 2009 poll. \"Sex on Fire\" also won the band a Grammy Award at the 51st Grammy Awards held at the Staples Center in Los Angeles on February 8, 2009. They won Best International Band and Best International Album at the Brit Awards in 2009, where they also performed \"Use Somebody\" live. Kings of Leon also performed on 14 March 2009 at Sound Relief, a benefit concert, for the Victorian Bushfire Crisis. The song \"Crawl\" from this album was released as a free download on the band's website on July 28. The third and fourth singles were Revelry, which peaked at number 19 in New Zealand and Notion, which peaked at number 24 in Belgian charts. Only By The Night was certified platinum in the United States by the RIAA for selling one million copies in less than a year after its release.\n\nIn 2009, the band headlined a number of music festivals, including Reading & Leeds, Rock Werchter, Oxegen, T In The Park, Gurtenfestival and Open'er Festival in Europe, along with Sasquatch, Lollapalooza, and Austin City Limits in the United States. That same year, the band won their first Grammy Award for the single \"Sex on Fire\", as well as two BRIT Awards for \"Best International Group\" and \"Best International Album.\" The album Only by the Night also won an NME Award for \"Album of the Year.\"\n\nFuture projects (2009-2011)\nThe band has announced the release of a live DVD on November 10, 2009 and a remix album due for release in the coming months, though the latter is untitled and unscheduled at the moment. The DVD was filmed at London's O2 Arena in July 2009. In an interview with Billboard.com drummer Nathan stated, \"England is really the first place we broke ... We figured what better place to make a live DVD than where the fans have been the craziest for the longest?\" The show featured some choice rarities, and Nathan continued by saying \"we just put the cameras in the back of our minds and acted like they weren't even there.\" The remix album came to life after Kings of Leon learned that other artists had started working on revisions of the band's songs. Mark Ronson, Kenna, Lykke Li with her cover of \"Knocked Up\", and Linkin Park are also contributing a remix to the album.\n\nOn October 17, 2009, the night of the final show of the US tour in Nashville, Tennessee, Nathan Followill posted \"Now it's time to start creating the next musical chapter in the novel that is Kings of Leon. Thanks again to all. Boomer fucking Sooner.\" on his personal Twitter page.\n\nMechanical Bull (2012-2013):\nThe band's sixth LP, \"Mechanical Bull\", was released on September 24, 2013. The album's first single, entitled \"Supersoaker\", was released on July 17, 2013.\n\nWalls (2016):\nOn Oct 14, 2016, Kings of Leon released their 7th studio album, \"Walls\", on the RCA Records label. It became the band's first number 1 on the Billboard 200 chart. The first single released from the album was \"Waste a Moment\".\n\nControversy\nKings of Leon caused controversy at the 2009 Reading Festival when Caleb Followill tried to get the crowd going by asking \"I thought this was supposed to be the loudest crowd in the world?\" Picking up on a perceived hostility towards the band, he announced \"we know you're sick of Kings of Leon, so for all those who don't give a fuck about us, I understand. But we've worked fucking hard to get here. So anyone that has anything to say to us, fuck you. We're the goddamn Kings of Leon.\" The band later smashed their guitars in anger and made rude gestures before leaving the stage. Nathan Followill further criticized the Reading crowd on his twitter page, declaring \"Zero love for the kings. I know it was cold but holy shit, y'all were frozen. I can only hope Leeds is in better form.\". At the Leeds Festival Caleb again bad-mouthed Reading while complimenting the Leeds crowd declaring \"We're only five songs in and you've blown Reading to hell\", while complimenting UK crowds in general stating \"It was the UK that made us feel like we could take on the world.\"\n\nDiscography\n\n    * Youth and Young Manhood (2003)\n    * Aha Shake Heartbreak (2004)\n    * Because of the Times (2007)\n    * Only by the Night (2008)\n    * Come Around Sundown (2010)\n    * Mechanical Bull (2013)\n    * Walls (2016) Read more on Last.fm. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.", 
            "genres": [
                "alternative rock", 
                "garage rock", 
                "indie pop", 
                "indie rock", 
                "modern rock", 
                "neo mellow", 
                "rock"
            ], 
            "id": "2qk9voo8llSGYcZ6xrBzKx", 
            "image_filepath": "./artist/images/2qk9voo8llSGYcZ6xrBzKx.jpg", 
            "image_url": "https://i.scdn.co/image/6c9f1c7f7d35c8a880dc520bfb24f7ebcaf0bc14", 
            "name": "Kings of Leon"
        }, 
        {
            "bio": "John Stephens (born December 28, 1978 in Springfield, Ohio), better known as John Legend, is a Grammy award winning R&B singer-songwriter, multi-instrumentalist, poet and actor signed to Kanye West's G.O.O.D. Music label. Prior to the release of his debut album Get Lifted in 2004, Legend's career gained momentum through a series of successful collaborations with multiple established artists such as Jay-Z, Alicia Keys and Lauryn Hill. He released his second album, Once Again in 2006, and his latest release, 2008's Evolver showcased a more experimental and upbeat side of Legend. He is the recipient of six Grammy Awards, and in 2007 he received the special Starlight award from the Songwriters Hall of Fame.\n\nLegend also played the piano on Lauryn Hill's 1998 song \"Everything is Everything\" and sang background vocals on Jay-Z's \"Encore\" and Alicia Keys' \"You Don't Know My Name\". Legend frequently cites gospel, R&B, and hip hop music as his main musical influences.\n\nLegend released his critically acclaimed and Billboard Top Ten second album, Once Again, in October 2006.  Produced by Raphael Saadiq, Kanye West and will.i.am, it is again a mixture of gospel and classic soul showcasing his extraordinary voice, particularly on \"Show Me\".\n\nGrammy Award Wins:\n*2005 Best New Artist\n*2005 Best Male R&B Vocal Performance: \"Ordinary People\"\n*2005 Best R&B Album- Get Lifted\n*2007 Best Male R&B Vocal Performance: Heaven\n*2007 Best R&B Performance by a Duo or Group: Family Affair\n\nNeo-soul singer and pianist John Legend combined the raw fervor of contemporaries Cody ChesnuTT and the burning precision of D'Angelo. Born John Stephens, Legend was a child prodigy who grew up in Ohio, where he began singing gospel and playing piano at the tender age of five. Legend left Ohio at 16 to attend college in Philadelphia, and it was there that he first found a larger audience. Not yet out of his teens, Legend was tapped to play piano on Lauryn Hill's \"Everything Is Everything\" in 1998. After completing college, he moved to New York, where he began to build a loyal following playing in nightclubs and releasing CDs that he would sell at shows. He also became an in-demand session musician, playing and occasionally writing for a wide array of artists, including Alicia Keys, Twista, Janet Jackson, and Kanye West. It wasn't until West signed the young talent to his new label that he adopted the Legend name with 2004's Solo Sessions Vol. 1: Live at the Knitting Factory. Get Lifted, his first studio album, was released later in the year. On the strength of enduring single \"Ordinary People,\" the album reached the Top Five of the Billboard 200. This led to three Grammy Awards: Best R&B Album, Best R&B Male Vocal Performance, and Best New Artist. Once Again, which peaked at number three on the Billboard 200 and number one on the R&B/Hip-Hop Albums chart, followed in October 2006. Live from Philadelphia, sold exclusively at Target stores, was a successful stopgap release that predated October 2008's Evolver. \n\n Read more on Last.fm. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.", 
            "genres": [
                "indie r&b", 
                "neo mellow", 
                "neo soul", 
                "pop", 
                "pop christmas", 
                "pop rap", 
                "r&b", 
                "soul christmas", 
                "urban contemporary"
            ], 
            "id": "5y2Xq6xcjJb2jVM54GHK3t", 
            "image_filepath": "./artist/images/5y2Xq6xcjJb2jVM54GHK3t.jpg", 
            "image_url": "https://i.scdn.co/image/3e431e58af3903f54c265185f8db57c01aeb25b2", 
            "name": "John Legend"
        }, 
        {
            "bio": "The Roots, also known as The Legendary Roots Crew, The Square Roots and The Foundation, are an influential, Grammy winning hip hop group based out of Philadelphia, Pennsylvania, famed for a heavily jazzy sound and live instrumentation. Inspired by the \"hip-hop band\" concept pioneered by Stetsasonic, the Roots themselves have garnered critical acclaim and influenced later hip-hop and R&B acts.\n\nThe Roots' original lineup included Black Thought (MC vocals) and Ahmir \"?uestlove\" Thompson (drums), who were classmates at the Philadelphia High School for Creative Performing Arts. As they began to play at school and on the streets, they added another MC named Malik B., bassist Leonard Hubbardand keyboardist Scott Storch. Another MC, Dice Raw, frequently made album appearances with the group from 1995 to 1999 before leaving to record a solo album. Scott Storch also left to pursue career as a producer following the Do You Want More?!!!??! album, He produced songs such as Still D.R.E. by Dr Dre. The Roots filled his void with another keyboardist, Kamal who is still a member. A beatboxer named Rahzel also joined the group and contributed from 1995-1999. Alongside Rahzel was vocal turntablist, Scratch who greatly contributed to The Roots' sound, most notably in live concerts. He left the group in 2003. Malik B. left the group in 2000. A guitarist, Ben Kenney, enjoyed a short stint with the group and contributed to their Phrenology album, but left to join Incubus. A percussionist, Knuckles, was added in 2002 and guitarist, Kirk Douglas (a.k.a. \"Captain Kirk\") repleaced Kenney. A vocalist, Martin Luther toured with The Roots in 2003 and 2004 and contributed to their album The Tipping Point. The current members of The Roots are Black Thought (MC vocals), ?uestlove (drums), Hub (bass), Kamal (keyboard), Knuckles (percussion), and Captain Kirk (guitar).\n\nThe Roots' debut album, Organix released in 1993, was actually a live recording from a concert in Germany that the Roots sold at their shows. The album earned enough industry buzz to earn the Roots offers from major record labels, and they signed with DGC records, which at the time was better known for its grunge music releases.\n\nThe Roots' first album for DGC, Do You Want More?!!!??! (recorded live without the use of samples), was a moderate hit on alternative radio. Their 1996 release Illadelph Halflife was the group's first album to crack the Top 40 on Billboard's album chart, spurred in part by MTV's airplay of the video for \"What They Do\", a parody of rap video clichés such as the \"beatdown shot,\" and \"Clones\" which was their first to single to reach the top five on the rap charts.\n\nIn 1999, The Roots released Things Fall Apart (named after a novel by Chinua Achebe), their breakthrough album. The track \"You Got Me\", duet with R'n'B singer Erykah Badu, earned them a Grammy award for Best Rap Performance By A Duo Or Group.\n\nIn 2000, Dice Raw left the group to record his solo debut album, Reclaiming the Dead.\n\nThe Roots' reputation as a hip-hop live band made Jay-Z call on them for his MTV Unplugged album in 2002. The album featured good recreations of many of his great songs, played by the band with a little help from female vocalist Jaguar Wright.\n\n2002's Phrenology introduced a more mainstream sound for the Roots, earning a Grammy nomination for Best Rap Album. The album's sales were boosted by radio and TV airplay for two duets on the album, \"Break You Off\" (featuring Musiq Soulchild) and \"The Seed 2.0\" (featuring Cody ChestnuTT). The video for \"The Seed 2.0\" earned a nomination for the MTV2 Award at the 2003 MTV Video Music Awards. \"The Seed\" was also featured on the soundtrack to the Mandy Moore movie Chasing Liberty. Phrenology was certified gold (signifying U.S. sales of at least 500,000 units) in June 2003.\n\nThe Roots' 2004 release, The Tipping Point, took its name from a 2000 book by Malcolm Gladwell. The album earned two more Grammy nominations: one for Best Urban/Alternative Performance for the track \"Star\", and another for Best Rap Performance By A Duo Or Group for the track \"Don't Say Nuthin'\". The album was an immediate hit, debuting at #4 on the Billboard album chart and selling over 100,000 copies in its first week of release.\n\nOn November 15, 2005 The Roots released two compilation albums, Home Grown! The Beginner's Guide To Understanding The Roots, Volumes 1 & 2. These two separately sold discs are a compilation of past hits, live performances, and rare remixes compiled by ?uestlove himself. They also feature 70 pages of liner notes written by ?uestlove. These two albums marked the Roots' last releases on Geffen Records.\n\nThe Roots' album, Game Theory, was released on August 29, 2006. The album, which features a track that samples the song \"You and Whose Army\" by Radiohead, was released on Jay-Z's Def Jam.\n\nThe Roots next album 'Rising Down' was released on April 29th 2008. Features tracks with Common, Mos Def, Talib Kweli, Saigon, and other greats.\n\nThe Make Me Songfacts reports that The Roots' eleventh album, undun, is their first concept album. It tells the story of a man called Redford Stephens who died in 1999 at the age of 25. We hear Redford retelling his life post-mortem and attempting to deconstruct what led to his undoing. \n\nThe Roots are also the house band on Late Night with Jimmy Fallon airing first on March 2nd, 2009. Read more on Last.fm. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.", 
            "genres": [
                "alternative hip hop", 
                "dirty south rap", 
                "east coast hip hop", 
                "hardcore hip hop", 
                "hip hop", 
                "neo soul", 
                "pop rap", 
                "southern hip hop"
            ], 
            "id": "78xUyw6FkVZrRAtziFdtdu", 
            "image_filepath": "./artist/images/78xUyw6FkVZrRAtziFdtdu.jpg", 
            "image_url": "https://i.scdn.co/image/1675935c475858a1110a2c3269559f9c24144add", 
            "name": "The Roots"
        }, 
        {
            "bio": "Anita Baker (born January 26, 1958, in Toledo, Ohio) is a soul and adult contemporary Rhythm and blues singer.\n\nWith her classy, refined brand of romantic soul, Anita Baker was one of the definitive quiet storm singers of the '80s. Gifted with a strong, supple alto, Baker was influenced not only by R&B, but jazz, gospel, and traditional pop, which gave her music a distinctly adult sophistication. Smooth and mellow, but hardly lifeless, it made her one of the most popular romantic singers of her time.\n\nBaker was born January 26, 1958, in Toledo, OH, and raised in nearby Detroit, where she grew up listening to female jazz singers like Sarah Vaughan, Nancy Wilson, and Ella Fitzgerald. At age 12, she began singing a gospel choir, and by age 16 she was performing with several local bands. In 1975, she successfully auditioned for Chapter 8, one of Detroit's most popular acts at the time; the group eventually signed with Ariola and released an album in 1979, but were immediately dropped when the label was acquired by Arista (which didn't care for Baker's vocals). Chastened, Baker worked low-paying jobs in Detroit and eventually found steady work as a receptionist at a law firm. In 1982, Otis Smith -- an executive who'd worked with Chapter 8 -- contacted Baker about recording for his new label Beverly Glen. Happy with her employment benefits and skittish over the experience with Arista, Baker was reluctant at first, but eventually flew out to the West Coast to record her debut album, The Songstress, in 1983. Though it didn't gain quite enough exposure to become a hit, it did help Baker build a strong fan base through word-of-mouth and she was signed by Elektra in 1985.\n\nWorking with producer Michael J. Powell (an old Chapter 8 cohort), Baker released her major-label debut Rapture in 1986. It was a platinum, Grammy winning smash, appealing to both urban and adult contemporary listeners and producing two all-time quiet storm classics in \"Caught Up in the Rapture\" and \"Sweet Love.\" Baker toured the world in 1987 and her guest appearance on the Winans track \"Ain't No Need to Worry\" won a Grammy. Her equally stylish follow-up album, Giving You the Best That I Got, appeared in 1988, spawning more staples in the title track and \"Just Because.\" \"Giving You the Best That I Got\" also won Baker two more Grammys, for Best Female R&B Vocal and Best R&B Song. For her third Elektra album, Baker decided to handle a greater share of the songwriting, hence the title Compositions, which was released in 1990 and featured even stronger jazz inflections than Baker's previous work (not to mention all live instruments).\n\nFollowing Compositions, Baker took a break from recording and touring; after having her first son in 1993, she returned to the studio to craft Rhythm of Love, which was released in 1994. In the years that followed, Baker was mostly silent, despite her fans' clamoring for a jazz album; instead, she raised her family and became embroiled in contract disputes with Elektra, which eventually led her to move to Atlantic. She began working on a new album in 2000, but had to start over from scratch due to defective recording equipment that made the original tracks unsalvageable. In 2004 it was announced that she had signed with Blue Note and still working on her new album. In the meantime, the Atlantic imprint Rhino released Night of Rapture: Live, a 1987 concert originally available on video. Baker finally returned to the studio in 2003 and issued My Everything, her first album in 10 years. Two years later she released her first holiday album, Christmas Fantasy. Read more on Last.fm. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.", 
            "genres": [
                "classic funk rock", 
                "disco", 
                "funk", 
                "hip pop", 
                "jazz christmas", 
                "motown", 
                "neo soul", 
                "new jack swing", 
                "quiet storm", 
                "r&b", 
                "smooth jazz", 
                "soul", 
                "soul christmas", 
                "urban contemporary"
            ], 
            "id": "46CH1Gp8l8QVly8bpG9JFG", 
            "image_filepath": "./artist/images/46CH1Gp8l8QVly8bpG9JFG.jpg", 
            "image_url": "https://i.scdn.co/image/60d7ac6c26105591276c5af3ee284f0494773f11", 
            "name": "Anita Baker"
        }, 
        {
            "bio": "Maxwell (born in Brooklyn, New York on May 23, 1973) is a Grammy Award Winning American R&B artist. He was enormously important in defining and shaping the soul sub-genre, neo-soul, over the latter half of the '90s. He recorded some of the most ambitious R&B of his time, becoming wildly popular and often earning critical raves in the process. What was more, his recurring theme of romantic monogamy set him apart from the vast majority of his bump'n'grind lover-man contemporaries.\n\nMaxwell capitalized on his breakthrough with the MTV Unplugged EP, taken from his live MTV performance. It attracted attention and acclaim outside the R&B community with the left-field cover choices \"This Woman's Work\" (by Kate Bush) and \"Closer\" (by Nine Inch Nails). Additionally, the 'MTV Unplugged' version of \"Whenever, Wherever, Whatever\" earned him another Grammy nomination (for Best Male Pop Vocal). Anticipation for his second full-length album was high, and when Embrya was released in 1998, it entered the charts at number three. Reviews were more mixed this time around, with some critics charging that Maxwell's ambition had crossed the line into indulgence; still, the record duplicated its predecessor's platinum sales.\n\nMaxwell adopted his middle name as his stage moniker, keeping his real identity a closely guarded secret out of concern for his family's privacy. Born of Puerto Rican and black Caribbean stock, Maxwell suffered the loss of his father (in a plane crash) when he was just three years old. The experience made him a deeply religious child, and he first began singing in his Baptist church. Still, he didn't really get serious about music until age 17, when he began writing his own songs using a cheap Casio keyboard given to him by a friend. Initially influenced by early-'80s urban R&B, and drawing his greatest inspiration from the concept of the R&B auteur (looking to artists like Marvin Gaye, Prince, Stevie Wonder). He progressed rapidly, and by 1991 he was performing on the New York club scene, despite ridicule from classmates who couldn't imagine the shy, awkward teenager doing anything of the sort. After making a name for himself, he signed a recording contract with Columbia in 1994. \n\nIn 1999, Maxwell scored his biggest hit to date with the single \"Fortunate,\" an R. Kelly composition he recorded for the soundtrack of the film Life; it was a mammoth success, ranking as the number one R&B hit of the year in Billboard magazine. Later that year, he also cut two songs for the soundtrack of The Best Man.\n\nIn August 2001, Maxwell returned with his third full-length album, Now, which was touted as a return to the more straightforwardly romantic atmosphere of his debut. It entered the album charts at number one and quickly launched a hit single in \"Lifetime.\" ~ Steve Huey, All Music Guide \n---\n... He eventually got a record deal with Columbia Records in 1994 when he was 21 years old. His loss of his father at the age of three had a great impact on him as a person and as an artist.  Maxwell played keyboard in church during his youth; however, he was not aware of his vocal talent during adolescence.  His vocal ability was later discovered during a romantic affair which inspired the music for his first music release \"Urban Hang Suite.\"  Maxwell was heavily inspired by the work of artists such as Marvin Gaye, Prince, Sade, and lastly Anita Baker who he gives credit to \"teaching him how to sing.\"\nAfter taking several years off, Maxwell released his latest album BLACKsummers'night on July 7, 2009. It debuted at #1 on the Billboard Albums Top 200 chart, his second album to receive that ranking. Maxwell said his reason for leaving the music industry for such a long period was \"to just take time off. The music industry has so much competition and there was no rush for me.\nThe follow-up to BLACKsummers'night and the second installment in a planned trilogy, blackSUMMERS'night, is set to be released late 2012 but the exact date is unknown.\n\n---\n---\nThe name \"Maxwell\" also appears to be used by a hip hop beat producer from Oldenburg, Germany. Read more on Last.fm. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.", 
            "genres": [
                "neo soul", 
                "quiet storm", 
                "urban contemporary"
            ], 
            "id": "2AOt5htsbtyaHd5Eq3kl3j", 
            "image_filepath": "./artist/images/2AOt5htsbtyaHd5Eq3kl3j.jpg", 
            "image_url": "https://i.scdn.co/image/dba75a3233c58be2823cd100b0cc0c90062e73a7", 
            "name": "Maxwell"
        }, 
        {
            "bio": "Janet Damita Jo Jackson (born May 16, 1966 in Gary, Indiana, United States) is a Grammy award-winning, and Golden Globe and Academy Award-nominated American singer, songwriter, record producer, dancer, and actress. \n\nThe youngest of the Jackson family, she initially stepped into the limelight in the family's 1974 Las Vegas production, 1976 television show, and later on her own as a television actress. At age sixteen in 1982, she signed a recording contract with A&M, releasing her self-titled debut album Janet Jackson that same year, followed by Dream Street (1984). \n\nIn an effort to establish her own identity apart from her famous family, Jackson teamed up with producers Jimmy Jam and Terry Lewis in the mid 1980s, creating a superstar-making partnership which has lasted to the present day. Jackson's breakout album, Control (1986), led to the Grammy-winning albums Janet Jackson's Rhythm Nation 1814 (1989), janet. (1993), The Velvet Rope (1997), All for You (2001), and Grammy-nominated albums Damita Jo (2004) and 20 Y.O. (2006).\n\nIn 1990, with the release of Black Cat from her Rhythm Nation 1814 album, Jackson became the first and only artist in Billboard history to score a #1 hit on Billboard's Hot 100 chart, R&B chart, Dance chart, Adult Contemporary chart, and Rock chart. When \"Black Cat\" hit #1 on Billboard's Mainstream Rock singles chart as well as Billboard's Hot 100, it was the first time a song had hit #1 simultaneously on both of those charts.\n\nTogether Again sold over 700,000 in the UK, making it one of the biggest selling singles ever in the UK by a female artist, and sold an overall total of four million copies.\n\nIn 2004, Jackson ranked as the ninth most successful artist in the history of rock and roll according to Billboard. Jackson also holds the record for the most Billboard Music Awards won by a single artist, a record 33. In 2006, it was announced that Jackson was the \"Most Searched on the Internet\" and the \"Most Searched-for News Item\" in the Guinness Book of World Records. In 2007, she was ranked the seventh richest woman in the entertainment business by Forbes Magazine, amassing a fortune of over $150 million.\n\nIn 2015, Janet Jackson released Unbreakable, her 11th studio album. It was released on 2 October 2015, under her new independent label Rhythm Nation Records. The album also features rappers J. Cole and Missy Elliott. \"No Sleeep\" was released as a lead single on 22 June 2015. It became her 40th entry on the Billboard Hot 100 singles chart, peaking at No. 63, as well as her most successful entry on Billboard's Adult R&B Songs, peaking at No. 1 for seven weeks.\n\nThe album debuted at No. 1 on the Billboard 200, becoming Jackson's seventh album to top the chart in the United States and making Janet Jackson only the third act to achieve No. 1 albums in each of the last four decades. It also peaked within the top 40 of most major music markets. Unbreakable received predominantly positive reviews. Numerous music critics praised the album's diversity of sound and Jackson's vocal technique throughout its production. Reviewers also complimented her willingness to engage in experimental sound rather than conform to contemporary musical trends, as well as the confidence she projects. Read more on Last.fm. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.", 
            "genres": [
                "dance pop", 
                "hip pop", 
                "motown", 
                "neo soul", 
                "new jack swing", 
                "pop", 
                "pop rap", 
                "pop rock", 
                "quiet storm", 
                "r&b", 
                "urban contemporary"
            ], 
            "id": "4qwGe91Bz9K2T8jXTZ815W", 
            "image_filepath": "./artist/images/4qwGe91Bz9K2T8jXTZ815W.jpg", 
            "image_url": "https://i.scdn.co/image/865e7c8d46c494aeb926c64d6a1f25ce6b72767e", 
            "name": "Janet Jackson"
        }, 
        {
            "bio": "Alicia Augello Cook (born January 25, 1981), better known by her stage name Alicia Keys, is an American recording artist, musician and actress. She was raised by a single mother in the Hell's Kitchen area of Manhattan in New York City, New York, United States. At age seven, Keys began to play classical music on the piano. She attended Professional Performing Arts School and graduated at 16 as valedictorian. She later attended Columbia University before dropping out to pursue her music career. Keys released her debut album with J Records, having had previous record deals first with Columbia and then Arista Records.\nThroughout her career, Keys has won numerous awards including 14 Grammy awards and has sold over 75 million records worldwide. Billboard magazine named her the top R&B artist of the 2000–2009 decade, establishing herself as one of the best-selling artists of her time. In 2010, VH1 included Keys on its list of the 100 Greatest Artists of All Time.\n\nKeys released her first studio album, Songs in A Minor, in June 2001. It debuted at number one on the Billboard 200 and sold 236,000 copies in its first week. The album sold over 6.2 million copies in the United States, where it was certified six times Platinum by the Recording Industry Association of America (RIAA). It went on to sell over 13 million copies worldwide, establishing Keys' popularity both inside and outside the United States, where she became the best-selling new artist and best-selling R&B artist of 2001. The album's lead single, Fallin', spent six weeks at number one on the Billboard Hot 100. The album's second single, A Woman's Worth, peaked at number three on the same chart. The following year, the album was reissued as Remixed & Unplugged in A Minor, which included eight remixes and seven unplugged versions of the songs from the original.\n\nSongs in A Minor led Keys to win five awards at the 2002 Grammy Awards: Song of the Year, Best Female R&B Vocal Performance, and Best R&B Song for Fallin', Best New Artist, and Best R&B Album; Fallin' was also nominated for Record of the Year. Keys became the second female solo artist to win five Grammy Awards in a single night, following Lauryn Hill at the 41st Grammy Awards. That same year, she collaborated with Christina Aguilera for the latter's upcoming album Stripped on a song entitled Impossible, which Keys wrote, co-produced, and provided with background vocals. During the early 2000s, Keys also made small cameos in television series Charmed and American Dreams.\n\nKeys followed up her debut with The Diary of Alicia Keys, which was released in December 2003. The album debuted at number one on the Billboard 200, selling over 618,000 copies its first week of release, becoming the largest first-week sales for a female artist in 2003. It sold 4.4 million copies in the United States and was certified four times Platinum by the RIAA. It sold nine million copies worldwide, becoming the sixth biggest-selling album by a female artist and the second biggest-selling album by a female R&B artist. The singles You Don't Know My Name and If I Ain't Got You both reached the top five of the Billboard Hot 100 chart, and the third single, Diary, entered the top ten. The fourth single, Karma, was less successful on the Billboard Hot 100, peaking at number 20. If I Ain't Got You became the first single by a female artist to remain on the Billboard Hot R&B/Hip-Hop Songs chart for over a year.\n\nKeys won Best R&B Video for If I Ain't Got You at the 2004 MTV Video Music Awards; she performed the song and Higher Ground with Lenny Kravitz and Stevie Wonder. Later that year, Keys released her novel Tears for Water: Songbook of Poems and Lyrics, a collection of unreleased poems from her journals and lyrics. The title derived from one of her poems, \"Love and Chains\" from the line: \"I don't mind drinking my tears for water.\" She said the title is the foundation of her writing because \"everything I have ever written has stemmed from my tears of joy, of pain, of sorrow, of depression, even of question\". The book sold over US$500,000 and Keys made The New York Times bestseller list in 2005. The following year, she won a second consecutive award for Best R&B Video at the MTV Video Music Awards for the video Karma. Keys performed If I Ain't Got You and then joined Jamie Foxx and Quincy Jones in a rendition of Georgia on My Mind, the Hoagy Carmichael song made famous by Ray Charles in 1960 at the 2005 Grammy Awards. That evening, she won four Grammy Awards: Best Female R&B Vocal Performance for If I Ain't Got You, Best R&B Song for You Don't Know My Name, Best R&B Album for The Diary of Alicia Keys, and Best R&B Performance by a Duo or Group with Vocals\" for My Boo with Usher.\n\nKeys performed and taped her installment of the MTV Unplugged series in July 2005 at the Brooklyn Academy of Music. During this session, Keys added new arrangements to her original songs and performed a few choice covers. The session was released on CD and DVD in October 2005. Simply titled Unplugged, the album debuted at number one on the U.S. Billboard 200 chart with 196,000 units sold in its first week of release. The album sold one million copies in the United States, where it was certified Platinum by the RIAA, and two million copies worldwide. The debut of Keys' Unplugged was the highest for an MTV Unplugged album since Nirvana's 1994 MTV Unplugged in New York and the first Unplugged by a female artist to debut at number one. The album's first single, Unbreakable, peaked at number 34 on the Billboard Hot 100 and number four on the Hot R&B/Hip-Hop Songs. It remained at number one on the Billboard Hot Adult R&B Airplay for 11 weeks.\n\nKeys opened a recording studio in Long Island, New York, called The Oven Studios, which she co-owns with her production and songwriting partner Kerry \"Krucial\" Brothers. The studio was designed by renowned studio architect John Storyk of WSDG, designer of Jimi Hendrix' Electric Lady Studios. Keys and Brothers are the co-founders of KrucialKeys Enterprises, a production and songwriting team who assisted Keys in creating her albums as well as create music for other artists.\n\nIn 2006, Keys won three NAACP Image Awards, including Outstanding Female Artist and Outstanding Song for Unbreakable. She also received the Starlight Award by the Songwriters Hall of Fame. In October 2006, she played the voice of Mommy Martian in the \"Mission to Mars\" episode of the children's television series The Backyardigans, in which she sang an original song, Almost Everything Is Boinga Here. That same year, Keys nearly suffered a mental breakdown. Her grandmother had died and her family was heavily dependent on her. She felt she needed to \"escape\" and went to Egypt for three weeks. She explained: \"That trip was definitely the most crucial thing I've ever done for myself in my life to date. It was a very difficult time that I was dealing with, and it just came to the point where I really needed to—basically, I just needed to run away, honestly. And I needed to get as far away as possible.\"\n\nKeys released her third studio album, As I Am, in November 2007; it debuted at number one on the Billboard 200, selling 742,000 copies in its first week. It gained Keys her largest first week sales of her career and became her fourth consecutive number one album, tying her with Britney Spears for the most consecutive number-one debuts on the Billboard 200 by a female artist. The week became the second largest sales week of 2007 and the largest sales week for a female solo artist since singer Norah Jones' album Feels like Home in 2004. The album has sold nearly four million copies in the United States and has been certified three times Platinum by the RIAA. It has sold nearly six million copies worldwide. Keys received five nominations for As I Am at the 2008 American Music Award and ultimately won two. The album's lead single, No One, peaked at number one on the Billboard Hot 100 and Hot R&B/Hip-Hop Songs, becoming Keys' third and fifth number-one single on each chart, respectively. The album's second single, Like You'll Never See Me Again, was released in late 2007 and peaked at number 12 on the Billboard Hot 100 and number one on the Hot R&B/Hip-Hop Songs. The album's third single, Teenage Love Affair, peaked at number three on the Hot R&B/Hip-Hop Songs chart. She released the fourth single, Superwoman, which peaked at number 82 on the Billboard Hot 100 and number 12 on the Hot R&B/Hip-Hop Songs.\n\nNo One earned Keys the awards for Best Female R&B Vocal Performance and Best R&B Song at the 2008 Grammy Awards. Keys opened the ceremony singing Frank Sinatra's 1950s song Learnin' the Blues as a \"duet\" with archival footage of Sinatra in video and No One with John Mayer later in the show. Keys also won Best Female R&B Artist during the show.  Keys, along with The White Stripes' guitarist and lead vocalist Jack White, recorded the theme song to Quantum of Solace, the first duet in Bond soundtrack history. In 2008, Keys was ranked in at number 80 the Billboard Hot 100 All-Time Top Artists. She also received three nominations at the 2009 Grammy Awards and won Best Female R&B Vocal Performance for Superwoman.\n\nIn an interview with Blender magazine, Keys allegedly said \"'Gangsta rap' was a ploy to convince black people to kill each other, 'gangsta rap' didn't exist\" and went on to say that it was created by \"the government\". The magazine also claimed she said that Tupac Shakur and The Notorious B.I.G. were \"essentially assassinated, their beefs stoked by the government and the media, to stop another great black leader from existing\". Keys later wrote a statement clarifying the issues and saying her words were misinterpreted. Later that year, Keys was criticized by anti-smoking campaigners after billboard posters for her forthcoming concerts in Indonesia featured a logo for the A Mild cigarette brand sponsored by tobacco firm Philip Morris. She apologized after discovering that the concert was sponsored by the firm and asked for \"corrective actions\". In response, the company withdrew its sponsorship.\n\nKeys collaborated with record producer Swizz Beatz to write and produce Million Dollar Bill for Whitney Houston's seventh studio album, I Look to You. Keys had approached Clive Davis for permission to submit a song for the album. Keys also collaborated with recording artist Jay-Z on the song Empire State of Mind from his 2009 album, The Blueprint 3. The song topped the Billboard Hot 100 and became her fourth number-one single on that chart.\n\nThe following month, the American Society of Composers, Authors and Publishers honored Keys with the Golden Note Award, an award given to artists \"who have achieved extraordinary career milestones\". She collaborated with Spanish recording artist Alejandro Sanz for Looking for Paradise, which topped the Hot Latin Songs chart. Keys released her fourth studio album, The Element of Freedom, in December 2009. It debuted at number two on the Billboard 200, selling 417,000 copies in its first week. As part of the promotional drive for the album, she performed at the Cayman Island Jazz Festival on December 5, the final night of the three day festival which will be broadcast on Black Entertainment Television (BET). The album's lead single, Doesn't Mean Anything, has peaked at number 60 on the Billboard Hot 100. Keys was ranked as the top R&B recording artist of the 2000–2009 decade by Billboard magazine and ranked at number five as artist of the decade, while her song, No One, was ranked at number six on the magazine's songs of the decade. In the United Kingdom, The Element of Freedom became Keys' first album to top the UK Albums Chart.\n\nAccording to Songfacts, Keys said regarding the title of her fifth studio album, Girl On Fire. \"Before making this record, in some ways I felt like a lion locked in a cage. I felt like a girl misunderstood that no one really knew, I felt like it was time to stop making excuses for any part of my life that I wanted to change. Once I made that choice I became a Girl on Fire, the lion broke free!!\" The title track will be made available on iTunes and radio on September 4, 2012.\n\nIn May 2009, Swizz Beatz announced that he and Keys were romantically involved, and in May 2010, a representative for Keys and Swizz Beatz confirmed that they were engaged and expecting a child together. During the time of the 2010 FIFA World Cup, the couple took part of a union and had the unborn child blessed in a Zulu ceremony, which took place in the Illovo suburb of South Africa. Keys and Swizz Beatz were married on the French island of Corsica on July 31, 2010. On October 14, 2010, Keys gave birth to a son, Egypt Daoud Ibarr Dean, in New York City.\n1997 Read more on Last.fm. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.", 
            "genres": [
                "hip pop", 
                "indie r&b", 
                "neo mellow", 
                "pop", 
                "pop christmas", 
                "pop rap", 
                "post-teen pop", 
                "r&b", 
                "urban contemporary"
            ], 
            "id": "3DiDSECUqqY1AuBP8qtaIa", 
            "image_filepath": "./artist/images/3DiDSECUqqY1AuBP8qtaIa.jpg", 
            "image_url": "https://i.scdn.co/image/05e25d030a1caa1611b1e7248d89b557d9867258", 
            "name": "Alicia Keys"
        }, 
        {
            "bio": "Usher Raymond IV (born October 14, 1978 in Chattanooga, Tennessee), known simply as Usher, is a Grammy Award winning American R&B singer-songwriter, producer and actor. He rose to fame in the late 90s, releasing the multi-platinum albums My Way and 8701. His success continued with the release of his 2004 album, Confessions, which has sold over 20 million copies worldwide, and earned Usher four American Music Awards and eight Grammy nominations. To date, he has sold approximately 40 million albums worldwide and has won five Grammy Awards. He released his debut album in 1994 and has since released 1997's My Way, 2001's 8701, 2004's Confessions and 2008's Here I Stand. His sixth studio album, Raymond v. Raymond, was released March 2010.\n\nIn 1990 Usher joined an R&B local quintet called the NuBeginnings, which was organized by local music svengali, Darryl Wheeler and then he decided to pursue a career in music. Aside from recording, Usher has ventured into business. He has established his own record label, US Records, and is a part owner of the Cleveland Cavaliers franchise. He has also dabbled in acting, with a recurring role on the teen sitcom Moesha, and roles in the films The Faculty (1998, with Josh Harnett) She's All That (1999, with Freddie Prinze, Jr.) and Texas Rangers (2001, with Ashton Kutcher).  Read more on Last.fm. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.", 
            "genres": [
                "dance pop", 
                "hip hop", 
                "pop", 
                "pop christmas", 
                "pop rap", 
                "r&b", 
                "rap", 
                "southern hip hop", 
                "urban contemporary"
            ], 
            "id": "23zg3TcAtWQy7J6upgbUnj", 
            "image_filepath": "./artist/images/23zg3TcAtWQy7J6upgbUnj.jpg", 
            "image_url": "https://i.scdn.co/image/9f1aba3d2d1b342270c4dc332546767a7a6f49b3", 
            "name": "Usher"
        }, 
        {
            "bio": "Beyoncé (born Beyoncé Giselle Knowles, September 4, 1981) is an American pop/RnB singer, songwriter, record producer, actress and model. Beyoncé was named Billboard's Top Female Artist of the 2000s in February 2009 as well as their Artist of the Millennium in May 2011. She was the RIAA's top certified and best-selling overall artist of the decade and the NRJ Music Awards also awarded her as their Artist of the Decade in France. She is one of the most influential artists of the century with record sales surpassing 130 million. She holds the record for the most viewed female viral video of all time with Single Ladies (Put A Ring On it) which has views of 600+ million.\n\nBorn and raised in Houston, Texas, Beyoncé began performing in local competitions at age 7, eventually forming the group Girl's Tyme in 1990 with help from her parents. Girl's Tyme became Destiny's Child in 1997. \n\nDuring the hiatus of Destiny's Child in 2003, Beyoncé released her debut solo album, Dangerously in Love, which became one of the most successful albums of that year, and signaled her viability as a solo artist. The disbanding of Destiny's Child in 2005 facilitated her continued success: her sophomore solo album B'Day, released in 2006, debuted at number one on the Billboard charts. Her third solo album, I Am… Sasha Fierce, was released in November 2008, and in 2009 she received 10 Grammy Awards nominations. On January 31, 2010, she won 6 Grammy Awards, breaking the record for most Grammy awards won by a female artist in one night; she previously held the record of five awards with 5 other artists. Following a career hiatus, Beyoncé released her fourth studio album entitled \"4\" on June 24, 2011, which debuted at number one on the US Billboard 200. \n\n2013 - 5th Album - \"Beyoncé\"\nOn December 12, 2013, Beyoncé unexpectedly released her fifth and self-titled album in the iTunes Store. Beyoncé called it a \"visual album\" as it includes 14 songs and 18 videos - with each track having a music video together with additional bonus videos. The album has a list of collaborators including Drake, Frank Ocean and her husband, Jay-Z, and daughter, Blue Ivy.\n\n2015\nIn February 2015 at the 57th Grammy Awards, Beyoncé won 3 Grammys (and was nominated for 6 Grammy awards) - Best R&B Song for \"Drunk in Love\", Best R&B Performance and Best Surround Sound Album for Beyoncé.\n\nOn April 4th, 2015, Beyoncé surprised her fans with the release of a new single and accompanying video, released exclusively on the streaming service \"Tidal\" which she co-owns with a number of other big name starts including Arcade Fire, Daft Punk, Jack White, Kanye West, Madonna, Rihanna and Usher. The track, \"Die With You\" is a stripped down ballad, with Beyoncé sitting at a piano with pigtail braids: the song celebrates the seventh anniversary of her marriage to Jay-Z.\n\nSuper Bowl - February 2016\nBeyoncé appeared on stage to perform her latest single \"Formation\", supporting the headline act Coldplay at the much coverted Super Bowl 50 half-time show on February 7, 2016. Also appearing on stage was Bruno Mars and Mark Ronson who performed their hit \"Uptown Funk\".\n\n2016 - 6th Album - \"Lemonade\"\n\"Lemonade\" is Beyoncé's sixth solo album and was released on April 23, 2016 as an exclusive on the music streaming service, Tidal after it premiered on the TV Network, HBO, as a conceptual short film. It was subsequently made available for purchase on Apple's iTunes Store on April 24, 2016. The album has 12 tracks, with contributions from artists such as James Blake and Kendrick Lamar. According to a press release from Tidal which accompanied the release, \"Lemonade\" is “based on every woman’s journey of self-knowledge and healing”.\n\n2017 - Grammy Awards\nAt the 59th Grammy Awards on Sun, February 12, 2017, Beyoncé took awards for \"Best Urban Contemporary Album\" for \"Lemonade\"and \"Best Music Video\" for \"Formation\"\n\nMiscellaneous\nBeyoncé began her acting career in 2001, appearing in the musical film Carmen: A Hip Hopera. In 2006, she starred in the lead role in the film adaptation of the 1981 Broadway musical Dreamgirls, for which she earned two Golden Globe nominations. \n\nOn April 4, 2008, Beyoncé and Jay-Z were married in a small, private ceremony in New York. On January 7, 2012, Beyoncé gave birth to a daughter, Blue Ivy Carter, at Lenox Hill Hospital in New York.\n\nBeyoncé launched her family's fashion line, House of Deréon, in 2004, and has endorsed such brands as Pepsi, Tommy Hilfiger, Armani and L'Oréal. \n\nIn 2009, Forbes listed Beyoncé fourth on its list of the 100 Most Powerful and Influential Celebrities in the world, third on its list of the top-grossing musicians, and number one on the list of top Best-Paid Celebs Under 30 with over $87 million dollars in earnings between 2008 and 2009.\n\nBeyoncé has attained five Hot 100 number one singles, becoming one of the two female artists—joint with Rihanna—with the most number ones attained within the 2000s, excluding her three Hot 100 number one singles with Destiny's Child. \n\n\n Read more on Last.fm. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.", 
            "genres": [
                "dance pop", 
                "pop", 
                "pop rap", 
                "post-teen pop", 
                "r&b"
            ], 
            "id": "6vWDO969PvNqNYHIOW5v0m", 
            "image_filepath": "./artist/images/6vWDO969PvNqNYHIOW5v0m.jpg", 
            "image_url": "https://i.scdn.co/image/673cd94546df0536954198867516fee18cee1605", 
            "name": "Beyoncé"
        }, 
        {
            "bio": "Shaffer Chimere Smith (born on October 18, 1979 in Camden, Arkansas), better known by his stage name Ne-Yo, is a Grammy Award winning American R&B singer, producer and actor currently signed to Def Jam Records. In 2006 he released his debut album In My Own Words, which featured the hit single So Sick. The song reached #1 on the Billboard Hot 100 and helped his album debut at #1 on the Billboard 200. He has since released 2007's Grammy award winning Because of You and 2008's Year of the Gentleman, and his fourth LP, Libra Scale, was released on November 22nd, 2010. The initial single was UK #1 Beautiful Monster. Champagne Life and One In A Million followed.\n\nNe-Yo was a beautiful song writer before he became a recording artist. He has written songs for a number of artists, including Mary J. Blige, Ruben Studdard, Marques Houston, Faith Evans, Christina Milian, B2K, Nivea, Tyrese, Jamie Foxx , Heather Headley,and Mario . After coming off a bad deal with Columbia Records, Ne-Yo originally decided to remain as a songwriter until a close friend introduced him to L.A. Reid who signed him to Def Jam Records on the spot. \n\nThe origin of the name Ne-Yo was given by a mutual friend in 1999 who called him Neo because he could 'see' music akin to the character Neo from The Matrix trilogy. He altered the '-yo' part as an homage to his hip hop roots. \n\nNe-Yo's debut album, In My Own Words, was released in early 2006, through Def Jam Recordings, and debuted at number one on Billboard 200, selling over 301,000 copies in the first week and certified platinum. During the same week, Ne-Yo's second single \"So Sick\" (produced by Stargate) reached number one on the Billboard Hot 100 chart. Ne-Yo is as famous for his songwriting as for his singing, writing such songs as Rihanna's top ten hit \"Unfaithful\", Mario's \"Let Me Love You\", Mario Vazquez's \"Gallery\", Paula DeAnda's \"Walk Away (Remember Me)\", and Beyoncé's Billboard Hot 100 ten-week number-one hit \"Irreplaceable\".\n\nHis second album, Because of You, was released May 1, 2007. The first single from the platinum-selling album was \"Because of You\". He has also said that he has written songs for Whitney Houston, Celine Dion, Britney Spears, Corbin Bleu, and Enrique Iglesias for their upcoming albums. Smith also has stated that he will write songs for Craig David, Usher, Chris Brown, Jennifer Hudson, Leona Lewis, and he recently confirmed that he has been contacted by producer will.i.am to work on Michael Jackson's upcoming album.\n\nNe-Yo opened a recording studio called Carrington House and started his own label, Compound Entertainment, in 2007; Paula Campbell, Sixx John, and Shanell are now associated with Compound.\n\nIn December 2007, Ne-Yo and the Goo Goo Dolls performed at a fundraising concert for presidential candidate Sen. Barack Obama.\n\nHe appeared in the song \"Deewangi Deewangi\" in the Hindi movie Om Shanti Om.\n\nIn February 2008 at the 50th Annual Grammy Awards, Ne-Yo won Best Contemporary R&B Album for  Because Of You.\n\nThe Lazy Love Songfacts reports that Ne-Yo's fifth studio album was originally titled 'The Cracks in Mr. Perfect' before Ne-Yo changed it to R.E.D, which stands for \"Realising Every Dream\".     Read more on Last.fm. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.", 
            "genres": [
                "dance pop", 
                "hip pop", 
                "indie r&b", 
                "pop", 
                "pop christmas", 
                "pop rap", 
                "post-teen pop", 
                "r&b", 
                "rap", 
                "urban contemporary"
            ], 
            "id": "21E3waRsmPlU7jZsS13rcj", 
            "image_filepath": "./artist/images/21E3waRsmPlU7jZsS13rcj.jpg", 
            "image_url": "https://i.scdn.co/image/e9737d4204dce148eadbd356da99cce1e075e408", 
            "name": "Ne-Yo"
        }, 
        {
            "bio": "Marshmello is a trap producer and DJ who debuted on Monstercat with his song \"Alone\", which appeared on Monstercat 027 - Cataclysm.\n\nIn June 2016, it was announced that there would be a remix contest for Alone, and that the winner would have their remix released by Monstercat.\n\nOn July the 8th, it was announced that future house duo MRVLZ had won the contest. It is currently unknown when this remix will be released. Read more on Last.fm. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.", 
            "genres": [
                "brostep", 
                "edm", 
                "progressive electro house"
            ], 
            "id": "64KEffDW9EtZ1y2vBYgq8T", 
            "image_filepath": "./artist/images/64KEffDW9EtZ1y2vBYgq8T.jpg", 
            "image_url": "https://i.scdn.co/image/f3dd808a2eff56552da545beb5b0fc5d3892817a", 
            "name": "Marshmello"
        }, 
        {
            "bio": "Skrillex is the pseudonym used by Los Angeles, California, USA musician Sonny Moore to differentiate his electronic solo work from his work with From First to Last and his other solo projects. \n\nAs Skrillex, Moore is an electronic DJ and producer boasting a musical style that incorporates electro house, fidget house, and dubstep.  Moore began producing and performing under the alias Skrillex at clubs in the Los Angeles area in 2008.  \n\nThroughout 2010, Skrillex became a bigger and bigger part of Moore’s life.  On June 7, 2010 he released his debut EP as Skrillex, My Name is Skrillex, as a free download.  Soon after, he was signed to mau5trap and began a nationwide tour with deadmau5.  On October 22, 2010 he released his second EP, Scary Monsters and Nice Sprites, as a co-release through mau5trap and Big Beat.\n\nOn June 2, 2011, Moore announced the release of a \"Scary Monsters and Nice Sprites\" remix EP titled More Monsters and Sprites, which was released on June 7, 2011 on Beatport and June 21, 2011 on iTunes. It contained 3 new tracks, as well as 4 remixes of \"Scary Monsters and Nice Sprites\".\n\nSkrillex announced his label OWSLA on August 17, 2011.\n\nOn December 23, 2011, Moore released the Bangarang EP. The EP features Ellie Goulding on the track \"Summit\", as well as collaborations with Wolfgang Gartner, Kill the Noise, The Doors and 12th Planet\n\nSkrillex has been nominated for five awards at the 54th Annual Grammys to be held in February 2012. Among his nominations are Best New Artist, Best Dance Recording (for \"Scary Monsters & Nice Sprites\") and Best Short Form Music Video (for \"First of the Year (Equinox)\") Read more on Last.fm. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.", 
            "genres": [
                "brostep", 
                "complextro", 
                "edm", 
                "electro", 
                "electro house"
            ], 
            "id": "5he5w2lnU9x7JFhnwcekXX", 
            "image_filepath": "./artist/images/5he5w2lnU9x7JFhnwcekXX.jpg", 
            "image_url": "https://i.scdn.co/image/dfc464638a476db61668e4f0d0e028226530b92f", 
            "name": "Skrillex"
        }, 
        {
            "bio": "Jack Ü is an American DJ duo, side group and collaborative project, consisting of Mad Decent  founder Diplo and OWSLA founder Skrillex, formed in 2013.They are an EDM act with no specific genre, releasing a variety of genres from trap to house to dubstep.\n\nJack Ü performed at Ultra Music Festival Miami in 2014. They released their first official single \"Take Ü There\" featuring vocals from Kiesza on September 17, 2014. Skrillex commented of Jack Ü that he and Diplo will \"feature on each other’s tracks, and put out some singles together, but mostly we [Diplo and Skrillex] just like to DJ together [as Jack Ü].\" On February 3, 2015, the pair announced that they would be working with Missy Elliott on a remix to \"Take Ü There\".\n\nJack Ü’s debut performance took place at the Mad Decent Block Party in San Diego on September 15, 2013, which is a nationwide tour that record label Mad Decent puts together in order to showcase different artists signed to the label. Diplo announced the project by releasing the Mad Decent Block Party lineup with Jack Ü playing at multiple stops on the tour. After some guessing by many of who “Jack Ü” was, Diplo finally came out to reveal that “Jack Ü … means Skrillex and Diplo together”.\n\nThe two have worked with each other on assorted projects over the past five years starting with Skrillex singing and playing guitar on a record for Major Lazer, one of Diplo’s other projects. In 2011, Diplo also worked on a song with Skrillex titled “Amplifire” (though it was never completed or released) for Bangarang. They collaborated on a song that combines trap and dubstep elements and features vocals from Korean pop artists CL and G Dragon titled “Dirty Vibe” for Skrillex’s album Recess. When asked about how the two ended up forming Jack Ü, Diplo stated that Skrillex \"was one of the first producers I met when I moved to LA…we just [have] always been really close musically with our ideas.” The two get together in Downtown L.A or in hotel rooms when on tour to make their songs.\n\nOn March 30, 2014 Jack Ü was given an hour-long slot to play at the Ultra Music Festival. The set included a wide variety of genres featuring songs from Skrillex’s then newly released first studio album, Recess, and including some old school hip-hop with DJ Kool’s “Let Me Clear My Throat”.\n\nOn December 31st, 2014 Jack Ü headlined a concert at Madison Square Garden. Besides their (Diplo and Skrillex) performance, other performers included A$AP Ferg, Diplo, Skrillex, Rudimental and Yellow Claw. The concert was broadcast live on Yahoo. Read more on Last.fm. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.", 
            "genres": [
                "edm", 
                "electro house", 
                "electronic trap", 
                "tropical house"
            ], 
            "id": "1HxJeLhIuegM3KgvPn8sTa", 
            "image_filepath": "./artist/images/1HxJeLhIuegM3KgvPn8sTa.jpg", 
            "image_url": "https://i.scdn.co/image/065e6f73d82db92ddaecf1ca779e833c274da17f", 
            "name": "Jack Ü"
        }, 
        {
            "bio": "Diplo, Diplodocus, Wes Gully, and Wes Diplo are all pseudonyms of Thomas Wesley Pentz, a Philadelphia-based producer and DJ since 2003. Together with DJ Low Budget he runs Hollertronix, a party and music collective. In addition to his solo career, he has worked with Sri-Lankan/Tamil singer and artist M.I.A.. The two were also romantically involved. Pentz's alias, short for Diplodocus, derives from his childhood fascination with dinosaurs.\n\nAs a DJ, Diplo is characterized by his eclectic, often 80s-oriented mashups, mixtapes, and live sets. On his full-length solo effort Florida, however, his sound is closer to sample-based cinematic instrumental hip hop, not unlike the work of DJ Shadow.\n\nBorn in Mississippi and raised across the southern United States, Diplo picked up much of the local culture while growing up there. Music styles such as dirty south, crunk and Miami bass are now trademark ingredients of the Hollertronix output. Pentz's solo work is also influenced by Southern Gothic and other southern literature. Additionally, world music is a strong musical influence on Diplo, especially baile funk which he encountered whilst traveling in Brazil.\n\nDiplo was recently signed to Ninja Tune, on the Big Dada imprint. In 2006, he started his own label, Mad Decent, signing Brazilian baile funk group Bonde do Role and DJ Blaqstarr.\n\nDiplo also is one of two DJ comprising the group  Major Lazer. Made up of DJs Diplo and Switch, the two were introduced after working with M.I.A.. \n Read more on Last.fm. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.", 
            "genres": [
                "bmore", 
                "brostep", 
                "edm", 
                "electro house", 
                "electronic trap", 
                "moombahton", 
                "ninja"
            ], 
            "id": "5fMUXHkw8R8eOP2RNVYEZX", 
            "image_filepath": "./artist/images/5fMUXHkw8R8eOP2RNVYEZX.jpg", 
            "image_url": "https://i.scdn.co/image/72cf22afd023ad548d8b073fdfaefb799f929cca", 
            "name": "Diplo"
        }, 
        {
            "bio": "Quinten van den Berg (born September 21, 1985), better known by his stage name Quintino, is a Dutch DJ and record producer. His music is mostly electro house. His most popular songs include his remix of \"Rap das Armas', 'Selecta', 'Go Hard' and 'Fatality'. In 2014 he was named No. 86 in the Top 100 DJs list put out by the DJ Magazine.\n\nMusic career\n\nQuintino explored a wide variety of artists and music, before he got behind the turntables. Once he finished school, he realized that the DJ profession is his greatest passion and started doing gigs at various locations. When he was 18, Quintino was discovered by Dutch DJ Laidback Luke, who decided to accompany the emerging artist.\n\nQuintino also works as a producer. His breakthrough followed in 2011 with his remix of stairs hit \"Rap Das Armas\", his first number one in the Netherlands, and the release of Epic, which scored platinum and nearly 18 million views on YouTube counts. That same year Quintino and his good friend Afrojack produced club hits like 'Selecta'.\n\nIn 2013 the Dutchman worked together with DJs Tiësto and Alvaro to produce the anthem of Ultra Music Festival. In August, he launched his radio show on Radio SupersoniQ international station SiriusXM's Electric Area.\n\nIn 2014, Quintino produced tracks like 'Go Hard', \"Slammer\", \"Fatality\", \"Genesis\" and a remix of R3hab & Trevor Guthrie's hit \"Soundwave\". In 2014 Quintino performed on larger stages, growing from a support act to a headliner. He made his debut in the DJ Mag Top 100 DJs in 2014, at the 86th position. Read more on Last.fm. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.", 
            "genres": [
                "bass trap", 
                "big room", 
                "brostep", 
                "deep big room", 
                "dutch house", 
                "edm", 
                "electro house", 
                "house", 
                "progressive electro house", 
                "progressive house", 
                "sky room", 
                "tropical house"
            ], 
            "id": "1V3VTM7VspiQjcmRhC010n", 
            "image_filepath": "./artist/images/1V3VTM7VspiQjcmRhC010n.jpg", 
            "image_url": "https://i.scdn.co/image/c5ec466c93e7e99fd0a22315595c8977fbbb80b1", 
            "name": "Quintino"
        }, 
        {
            "bio": "Norah Jones, born on March 30th 1979 in New York City, is one of the most popular contemporary jazz and jazz-influenced singers of our time. She was a member of Wax Poetic before her debut album Come Away with Me. She can still be heard singing with them on two tracks of their release, NuBlu Sessions.\n\nHer debut album Come Away with Me was released in 2002 and sold 26 million copies worldwide. It won 5 Grammy Awards in 2003.\n\nHer second album, Feels Like Home, with folk tendency, is the highest-selling album in the history of Blue Note Records with over a million copies sold within the first week. Norah Jones was listed among the most influential people of 2004 by the Time Magazine.\n\nOn January 30, 2007 Norah Jones released her third album, Not Too Late - a collection of 13 original songs, itunes includes a bonus live track of the song Sinkin' Soon. This was the most pre-ordered album of all time on Amazon.com.\n\nHer fourth studio album, The Fall, was released on November 17, 2009.\n\nHer fifth studio album ...Little Broken Hearts was released on May 1, 2012 and she collaborated with Danger Mouse for its production. The Happy Pills Songfacts reports that the album was recorded at Danger Mouse's Los Angeles studio during the fall of 2011. The record was co-written by Jones and Danger Mouse, with the pair handling the majority of the instrumentals. Jones teamed up with the producer after she contributed vocals to his Rome project with Daniele Luppi.\n\nThe daughter of Beatles-influencing sitar virtuoso Ravi Shankar, Jones doesn't closely follow any particular genre, rather she brings her unique jazzy flavor to songs with roots in country, folk, Americana, and modern light jazz, pop and rock.\n Read more on Last.fm. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.", 
            "genres": [
                "adult standards", 
                "folk christmas", 
                "folk-pop", 
                "neo mellow", 
                "pop christmas", 
                "pop rock", 
                "singer-songwriter"
            ], 
            "id": "2Kx7MNY7cI1ENniW7vT30N", 
            "image_filepath": "./artist/images/2Kx7MNY7cI1ENniW7vT30N.jpg", 
            "image_url": "https://i.scdn.co/image/c369bb5ff8d1ae22f50559c8ef0b45de1a447ae8", 
            "name": "Norah Jones"
        }, 
        {
            "bio": "Billie Joe, who is ranked one of the 10 of the most influential people in punk rock music, was born on February 17, 1972 in Rodeo, California, as the youngest of 6 children. His father, Andy, was a jazz musician and a truck driver for Safeway, who passed away of oesophagous cancer, in September 1982. Billie Joe was only 10 years old. His mother was a waitress at a restaurant called Rod's Hickory Pit. As soon as he started to talk he also began to sing and went to hospitals and sang to patients to cheer them up! Billie Joe's first song was \"Look For Love\". When he was 5, he recorded this song for the locally based Fiat Records. \n\n\nSweet Children\n At the age of 10, Billie Joe met Mike in the school canteen and they got hooked up on punk rock music. Soon after they had formed their first band named Sweet Children. At the age of 11 Billie Joe got his first guitar he called Blue that his mother bought for him. At 14 he wrote his first song named \"Why Do You Want Him?\" (This can be found on 1039/Smoothed Out Slappy Hours, track 12). This song was about Billie Joe's mom and his step-dad that he and his siblings hated. It was obvious that Billie Joe's biggest love was music so he dropped out of school to devote himself to the band. \n\nGreen Day\nThe band's first drummer, Al Sobrante, quit the band to attend college, and he was quickly replaced by Tre Cool. Tre was, at the time, playing with The Lookouts. Sweet Children was renamed Green Day. In a matter of time they were playing across the country, traveling in a bookmobile driven by Tre's father. In 1997 (just after the release of Nimrod) Green Day played a show at Tower Records. The show only lasted 40 minutes. During this time they totally wrecked the place, which cost up to $50,000. The band, however, was not charged. Billie Joe quoted \"You can't start a riot 'cuz you're at Tower records. You start a riot coz you're at a Green Day concert!\"\n\nFamily\n  In 1990 in Minneapolis, Billie Joe caught a glimpse of Adrienne for the first time. They married on July 2, 1994, the service lasting all of five minutes. The next day Adrienne and Billie Joe discovered that they were going to have their first child together. They now have two sons, Joseph Marciano born in March, 1995 and Jakob Danger, born September 12, 1998. \n\nSome Interesting Facts\n The first album that Billie Joe bought was Elvis Presley's \"The Sun Sessions.\" Billie Joe is well-known for his odd and amusing antics on-stage and his kinda rebellious sense of humor. Billie Joe is co-founder and partial owner of the independent label Adeline Records. He's currently a member of a band named Pinhead Gunpowder. He was also member of Blatz, Rancid, The Lookouts, Goodbye Harry, Corrupted Morals. When Billie Joe was in high school he was given the nick name \"$2 Bill\" because he used to sell joints for $2! On the topic of joints, he smoked his first joint with his best friends mom!\n\nGuitars\nSpeaking of his guitars, he has since had a copy of Blue made by Fender. It's just like the original one but with different stickers on. Billie Joe's original Blue had two single-coil pick ups and a Seymour Duncan \"Jeff Beck\" Humbucker pick up. Billie Joe has a Fender Jazzmaster, a sonic blue Fender Jagstang, a Gibson classic Series ES-135 and ES-335, an SG, Rickenbacker, and a Guild sunburst acoustic (played in the \"Good Riddance\" video). And to play them lovely guitars he uses Dunlop Tortex standard size (0.88mm) picks! Read more on Last.fm. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.", 
            "genres": [], 
            "id": "1MrEurzLcL8ugfP1PrUPWG", 
            "image_filepath": "./artist/images/1MrEurzLcL8ugfP1PrUPWG.jpg", 
            "image_url": "https://i.scdn.co/image/f0cf5ff59aeea1d80d406c2cfe4f0535d11a1320", 
            "name": "Billie Joe Armstrong"
        }, 
        {
            "bio": "Born Armando Anthony Corea in Chelsea, Massachusetts, USA, on June 12, 1941, Chick began studying piano at age four.\n\nChick Corea is one of the most prolific and acclaimed of jazz artists from the second half of the 20th century, with contributions to most forms of modern music, including straight-ahead jazz, electric fusion, avant-garde and orchestral music. In 2010 he entered the DownBeat Magazine Hall of Fame and was named Artist of the Year.\n\nAs a member of Miles Davis's band in the 1960s, and later as founder of Return to Forever, he participated in the birth of the electric fusion movement. In the 1980s he helped expand jazz with the Chick Corea Elektric Band and Akoustic Band. Recently, he toured with Return to Forever's classic quartet and recorded widely Read more on Last.fm. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.", 
            "genres": [
                "bebop", 
                "contemporary jazz", 
                "contemporary post-bop", 
                "cool jazz", 
                "hard bop", 
                "jazz", 
                "jazz christmas", 
                "jazz funk", 
                "jazz fusion", 
                "soul jazz", 
                "vocal jazz"
            ], 
            "id": "5olDKSsFhhmwh8UCWwKtpq", 
            "image_filepath": "./artist/images/5olDKSsFhhmwh8UCWwKtpq.jpg", 
            "image_url": "https://i.scdn.co/image/91aed84b009f5237f35978dbbb606b12a0e2b232", 
            "name": "Chick Corea"
        }, 
        {
            "bio": "John William Coltrane (Hamlet, North Carolina, September 23, 1926  – Huntington, New York, July 17, 1967) was an American jazz saxophonist and composer.\n\nAmerican jazz great John Coltrane emerged in the 1950s, playing tenor and soprano sax with Dizzy Gillespie, Miles Davis and Thelonious Monk. A leader of \"hard bop\", in the 1960s he led his own groups and changed the face of jazz with experimentation and improvisation, his later recordings reflecting his belief that music was a form of spiritual expression. Sometimes called simply 'Trane, his recordings include Giant Steps (1959), My Favorite Things (1960), Olé (1961) and A Love Supreme (1964). In his later recordings he collaborated on avante-garde music with his wife, Alice Coltrane (b. Alice McLeod, 1937-2007), who had a career in her own right.\n\nThe band sometimes called Coltrane's \"classic quartet\" of the early 1960s included McCoy Tyner (piano), Elvin Jones (drums) and Jimmy Garrison (bass).\nDespite a relatively brief career (he first came to notice as a sideman at age 29 in 1955, formally launched a solo career at 33 in 1960, and was dead at 40 in 1967), saxophonist John Coltrane was among the most important, and most controversial, figures in jazz. It seems amazing that his period of greatest activity was so short, not only because he recorded prolifically, but also because, taking advantage of his fame, the record companies that recorded him as a sideman in the 1950s frequently reissued those recordings under his name and there has been a wealth of posthumously released material as well. Since Coltrane was a protean player who changed his style radically over the course of his career, this has made for much confusion in his discography and in appreciations of his playing. There remains a critical divide between the adherents of his earlier, more conventional (if still highly imaginative) work and his later, more experimental work. No one, however, questions Coltrane's almost religious commitment to jazz or doubts his significance in the history of the music.\n\nColtrane was the son of John R. Coltrane, a tailor and amateur musician, and Alice (Blair) Coltrane. Two months after his birth, his maternal grandfather, the Reverend William Blair, was promoted to presiding elder in the A.M.E. Zion Church and moved his family, including his infant grandson, to High Point, NC, where Coltrane grew up. Shortly after he graduated from grammar school in 1939, his father, his grandparents, and his uncle died, leaving him to be raised in a family consisting of his mother, his aunt, and his cousin. His mother worked as a domestic to support the family. The same year, he joined a community band in which he played clarinet and E flat alto horn; he took up the alto saxophone in his high school band. During World War II, his mother, aunt, and cousin moved north to New Jersey to seek work, leaving him with family friends; in 1943, when he graduated from high school, he too headed north, settling in Philadelphia. Eventually, the family was reunited there.\n\nWhile taking jobs outside music, Coltrane briefly attended the Ornstein School of Music and studied at Granoff Studios. He also began playing in local clubs. In 1945, he was drafted into the navy and stationed in Hawaii. He never saw combat, but he continued to play music and, in fact, made his first recording with a quartet of other sailors on July 13, 1946. A performance of Tadd Dameron's \"Hot House,\" it was released in 1993 on the Rhino Records anthology The Last Giant. Coltrane was discharged in the summer of 1946 and returned to Philadelphia. That fall, he began playing in the Joe Webb Band. In early 1947, he switched to the King Kolax Band. During the year, he switched from alto to tenor saxophone. One account claims that this was as the result of encountering alto saxophonist Charlie Parker and feeling the better-known musician had exhausted the possibilities on the instrument; another says that the switch occurred simply because Coltrane next joined a band led by Earl Bostic, who was an alto player, forcing Coltrane to play tenor. He moved on to Jimmy Heath's band in mid-1948, staying with the band, which evolved into the Howard McGhee All Stars until early 1949, when he returned to Philadelphia. That fall, he joined a big band led by Dizzy Gillespie, remaining until the spring of 1951, by which time the band had been trimmed to a septet. On March 1, 1951, he took his first solo on record during a performance of \"We Love to Boogie\" with Gillespie.\n\nAt some point during this period, Coltrane became a heroin addict, which made him more difficult to employ. He played with various bands, mostly around Philadelphia, during the early '50s, his next important job coming in the spring of 1954, when Johnny Hodges, temporarily out of the Duke Ellington band, hired him. But he was fired because of his addiction in September 1954. He returned to Philadelphia, where he was playing, when he was hired by Miles Davis a year later. His association with Davis was the big break that finally established him as an important jazz musician. Davis, a former drug addict himself, had kicked his habit and gained recognition at the Newport Jazz Festival in July 1955, resulting in a contract with Columbia Records and the opportunity to organize a permanent band, which, in addition to him and Coltrane, consisted of pianist Red Garland, bassist Paul Chambers, and drummer \"Philly\" Joe Jones. This unit immediately began to record extensively, not only because of the Columbia contract, but also because Davis had signed with the major label before fulfilling a deal with jazz independent Prestige Records that still had five albums to run. The trumpeter's Columbia debut, 'Round About Midnight, which he immediately commenced recording, did not appear until March 1957. The first fruits of his association with Coltrane came in April 1956 with the release of The New Miles Davis Quintet (aka Miles), recorded for Prestige on November 16, 1955. During 1956, in addition to his recordings for Columbia, Davis held two marathon sessions for Prestige to fulfill his obligation to the label, which released the material over a period of time under the titles Cookin' (1957), Relaxin' (1957), Workin' (1958), and Steamin' (1961).\n\nColtrane's association with Davis inaugurated a period when he began to frequently record as a sideman. Davis may have been trying to end his association Prestige, but Coltrane began appearing on many of the label's sessions. After he became better known in the 1960s, Prestige and other labels began to repackage this work under his name, as if he had been the leader, a process that has continued to the present day. (Prestige was acquired by Fantasy Records in 1972, and many of the recordings in which Coltrane participated have been reissued on Fantasy's Original Jazz Classics [OJC] imprint.)\n\nColtrane tried and failed to kick heroin in the summer of 1956, and in October, Davis fired him, though the trumpeter had relented and taken him back by the end of November. Early in 1957, Coltrane formally signed with Prestige as a solo artist, though he remained in the Davis band and also continued to record as a sideman for other labels. In April, Davis fired him again. This may have given him the impetus finally to kick his drug habit, and freed of the necessity of playing gigs with Davis, he began to record even more frequently. On May 31, 1957, he finally made his recording debut as a leader, putting together a pickup band consisting of trumpeter Johnny Splawn, baritone saxophonist Sahib Shihab, pianists Mal Waldron and Red Garland (on different tracks), bassist Paul Chambers, and drummer Al \"Tootie\" Heath. They cut an album Prestige titled simply Coltrane upon release in September 1957. (It has since been reissued under the title First Trane.)\n\nIn June 1957, Coltrane joined the Thelonious Monk Quartet, consisting of Monk on piano, Wilbur Ware on bass, and Shadow Wilson on drums. During this period, he developed a technique of playing several notes at once, and his solos began to go on longer. In August, he recorded material belatedly released on the Prestige albums Lush Life (1960) and The Last Trane (1965), as well as the material for John Coltrane With the Red Garland Trio, released later in the year. (It was later reissued under the title Traneing In.) But Coltrane's second album to be recorded and released contemporaneously under his name alone was cut in September for Blue Note Records. This was Blue Train, featuring trumpeter Lee Morgan, trombonist Curtis Fuller, pianist Kenny Drew, and the Miles Davis rhythm section of Chambers and \"Philly\" Joe Jones; it was released in December 1957. That month, Coltrane rejoined Davis, playing in what was now a sextet that also featured Cannonball Adderley. In January 1958, he led a recording session for Prestige that produced tracks later released on Lush Life, The Last Trane, and The Believer (1964). In February and March, he recorded Davis' album Milestones..., released later in 1958. In between the sessions, he cut his third album to be released under his name alone, Soultrane, issued in September by Prestige. Also in March 1958, he cut tracks as a leader that would be released later on the Prestige collection Settin' the Pace (1961). In May, he again recorded for Prestige as a leader, though the results would not be heard until the release of Black Pearls in 1964.\n\nColtrane appeared as part of the Miles Davis group at the Newport Jazz Festival in July 1958. The band's set was recorded and released in 1964 on an LP also featuring a performance by Thelonious Monk as Miles & Monk at Newport. In 1988, Columbia reissued the material on an album called Miles & Coltrane. The performance inspired a review in Down Beat, the leading jazz magazine, that was an early indication of the differing opinions on Coltrane that would be expressed throughout the rest of his career and long after his death. The review referred to his \"angry tenor,\" which, it said, hampered the solidarity of the Davis band. The review led directly to an article published in the magazine on October 16, 1958, in which critic Ira Gitler defended the saxophonist and coined the much-repeated phrase \"sheets of sound\" to describe his playing.\n\nColtrane's next Prestige session as a leader occurred later in July 1958 and resulted in tracks later released on the albums Standard Coltrane (1962), Stardust (1963), and Bahia (1965). All of these tracks were later compiled on a reissue called The Stardust Session. He did a final session for Prestige in December 1958, recording tracks later released on The Believer, Stardust, and Bahia. This completed his commitment to the label, and he signed to Atlantic Records, doing his first recording for his new employers on January 15, 1959, with a session on which he was co-billed with vibes player Milt Jackson, though it did not appear until 1961 with the LP Bags and Trane.\n\nIn March and April 1959, Coltrane participated with the Davis group on the album Kind of Blue. Released on August 17, 1959, this landmark album known for its \"modal\" playing (improvisations based on scales or \"modes,\" rather than chords) became one of the best-selling and most-acclaimed recordings in the history of jazz. In between the sessions for the album, Coltrane began recording what would be his Atlantic Records debut, Giant Steps, released in early 1960. The album, consisting entirely of Coltrane compositions, in a sense marked his real debut as a leading jazz performer, even though the 33-year-old musician had released three previous solo albums and made numerous other recordings. His next Atlantic album, Coltrane Jazz, was mostly recorded in November and December 1959 and released in February 1961. In April 1960, he finally left the Davis band and formally launched his solo career, beginning an engagement at the Jazz Gallery in New York, accompanied by pianist Steve Kuhn (soon replaced by McCoy Tyner), bassist Steve Davis, and drummer Pete La Roca (later replaced by Billy Higgins and then Elvin Jones). During this period, he increasingly played soprano saxophone as well as tenor.\n\nIn October 1960, Coltrane recorded a series of sessions for Atlantic that would produce material for several albums, including a final track used on Coltrane Jazz and tunes used on My Favorite Things (March 1961), Coltrane Plays the Blues (July 1962), and Coltrane's Sound (June 1964). His soprano version of \"My Favorite Things,\" from the Richard Rodgers/Oscar Hammerstein II musical The Sound of Music, would become a signature song for him. During the winter of 1960-1961, bassist Reggie Workman replaced Steve Davis in his band and saxophone and flute player Eric Dolphy, gradually became a member of the group.\n\nIn the wake of the commercial success of \"My Favorite Things,\" Coltrane's star rose, and he was signed away from Atlantic as the flagship artist of the newly formed Impulse! Records label, an imprint of ABC-Paramount, though in May he cut a final album for Atlantic, Olé (February 1962). The following month, he completed his Impulse! debut, Africa/Brass. By this time, his playing was frequently in a style alternately dubbed \"avant-garde,\" \"free,\" or \"The New Thing.\" Like Ornette Coleman, he played seemingly formless, extended solos that some listeners found tremendously impressive, and others decried as noise. In November 1961, John Tynan, writing in Down Beat, referred to Coltrane's playing as \"anti-jazz.\" That month, however, Coltrane recorded one of his most celebrated albums, Live at the Village Vanguard, an LP paced by the 16-minute improvisation \"Chasin' the Trane.\"\n\nBetween April and June 1962, Coltrane cut his next Impulse! studio album, another release called simply Coltrane when it appeared later in the year. Working with producer Bob Thiele, he began to do extensive studio sessions, far more than Impulse! could profitably release at the time, especially with Prestige and Atlantic still putting out their own archival albums. But the material would serve the label well after the saxophonist's untimely death. Thiele acknowledged that Coltrane's next three Impulse! albums to be released, Ballads, Duke Ellington and John Coltrane, and John Coltrane with Johnny Hartman (all 1963), were recorded at his behest to quiet the critics of Coltrane's more extreme playing. Impressions (1963), drawn from live and studio recordings made in 1962 and 1963, was a more representative effort, as was 1964's Live at Birdland, also a combination of live and studio tracks, despite its title. But Crescent, also released in 1964, seemed to find a middle ground between traditional and free playing, and was welcomed by critics. This trend was continued with 1965's A Love Supreme, one of Coltrane's best-loved albums, which earned him two Grammy nominations, for jazz composition and performance, and became his biggest-selling record. Also during the year, Impulse! released the standards collection The John Coltrane Quartet Plays... and another album of \"free\" playing, Ascension, as well as New Thing at Newport, a live album consisting of one side by Coltrane and the other by Archie Shepp.\n\n1966 saw the release of the albums Kulu Se Mama and Meditations, Coltrane's last recordings to appear during his lifetime, though he had finished and approved release for his next album, Expression, the Friday before his death in July 1967. He died suddenly of liver cancer, entering the hospital on a Sunday and expiring in the early morning hours of the next day. He had left behind a considerable body of unreleased work that came out in subsequent years, including \"Live\" at the Village Vanguard Again! (1967), Om (1967), Cosmic Music (1968), Selflessness (1969), Transition (1969), Sun Ship (1971), Africa/Brass, Vol. 2 (1974), Interstellar Space (1974), and First Meditations (For Quartet) (1977), all on Impulse! Compilations and releases of archival live recordings brought him a series of Grammy nominations, including Best Jazz Performance for the Atlantic album The Coltrane Legacy in 1970; Best Jazz Performance, Group, and Best Jazz Performance, Soloist, for \"Giant Steps\" from the Atlantic album Alternate Takes in 1974; and Best Jazz Performance, Group, and Best Jazz Performance, Soloist, for Afro Blue Impressions in 1977. He won the 1981 Grammy for Best Jazz Performance, Soloist, for Bye Bye Blackbird, an album of recordings made live in Europe in 1962, and he was given the Grammy Lifetime Achievement Award in 1992, 25 years after his death.\n\nJohn Coltrane is sometimes described as one of jazz's most influential musicians, but one is hard put to find followers who actually play in his style. Rather, he is influential by example, inspiring musicians to experiment, take chances, and devote themselves to their craft. The controversy about his work has never died down, but partially as a result, his name lives on and his recordings continue to remain available and to be reissued frequently. Read more on Last.fm. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.", 
            "genres": [
                "bebop", 
                "contemporary post-bop", 
                "cool jazz", 
                "free jazz", 
                "hard bop", 
                "jazz", 
                "jazz blues", 
                "jazz christmas", 
                "vocal jazz"
            ], 
            "id": "2hGh5VOeeqimQFxqXvfCUf", 
            "image_filepath": "./artist/images/2hGh5VOeeqimQFxqXvfCUf.jpg", 
            "image_url": "https://i.scdn.co/image/12aa1cbaad5f077082c0e7e70104fe658bc6318b", 
            "name": "John Coltrane"
        }
    ]
}